#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_humanoidcs_attackik

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ControlRig_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "b1_Managed_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_humanoidcs_attackik.ABP_humanoidcs_attackik_C
// 0x05C0 (0x0990 - 0x03D0)
class UABP_humanoidcs_attackik_C final : public UBUAnimHumanoidCS_AttackIK
{
public:
	uint8                                         Pad_3C4[0x4];                                      // 0x03C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03D0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03D8(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x03E0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0400(0x00C8)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x04C8(0x0458)()
	struct FVector                                __CustomProperty_TargetPosition_4CB2B3A64FE11C05C6C30187B6AF79A3; // 0x0920(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __CustomProperty_BoneScaleName_4CB2B3A64FE11C05C6C30187B6AF79A3; // 0x0938(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_BoneScaleEnable_4CB2B3A64FE11C05C6C30187B6AF79A3; // 0x0940(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_941[0x7];                                      // 0x0941(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           __CustomProperty_SolverEffectorsBoneNameList_4CB2B3A64FE11C05C6C30187B6AF79A3; // 0x0948(0x0010)()
	TArray<class FName>                           __CustomProperty_SolverRootBoneNameList_4CB2B3A64FE11C05C6C30187B6AF79A3; // 0x0958(0x0010)()
	TArray<double>                                __CustomProperty_AtkIKPitch_4CB2B3A64FE11C05C6C30187B6AF79A3; // 0x0968(0x0010)()
	TArray<double>                                __CustomProperty_AtkIKRoll_4CB2B3A64FE11C05C6C30187B6AF79A3; // 0x0978(0x0010)()

public:
	void ExecuteUbergraph_ABP_humanoidcs_attackik(int32 EntryPoint);
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_humanoidcs_attackik_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_humanoidcs_attackik_C")
	}
	static class UABP_humanoidcs_attackik_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_humanoidcs_attackik_C>();
	}
};
DUMPER7_ASSERTS_UABP_humanoidcs_attackik_C;

}

