#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Abp_HumanoidCS_MMRetarget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "b1_Managed_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Abp_HumanoidCS_MMRetarget.Abp_HumanoidCS_MMRetarget_C
// 0x0120 (0x04B0 - 0x0390)
class UAbp_HumanoidCS_MMRetarget_C final : public UBUAnimHumanoidCS_MMRetarget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0390(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0398(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x03A0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x03C0(0x00C8)()
	class FName                                   __CustomProperty_GetTransform_Item_Name_91CD923646478CC7D2616D82EF0CADF8; // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __CustomProperty_SetTransform_Item_Name_91CD923646478CC7D2616D82EF0CADF8; // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __CustomProperty_GetTransform_Item_Name_EB3372A44B45487E871E8D96A2698D0D; // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __CustomProperty_SetTransform_Item_Name_EB3372A44B45487E871E8D96A2698D0D; // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UsePelvis;                                         // 0x04A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Abp_HumanoidCS_MMRetarget(int32 EntryPoint);
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Abp_HumanoidCS_MMRetarget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Abp_HumanoidCS_MMRetarget_C")
	}
	static class UAbp_HumanoidCS_MMRetarget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbp_HumanoidCS_MMRetarget_C>();
	}
};
DUMPER7_ASSERTS_UAbp_HumanoidCS_MMRetarget_C;

}

