#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Abp_HumanoidCS_MonsterLocomotion

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Abp_HumanoidCS_MonsterLocomotion_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "b1_Managed_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Abp_HumanoidCS_MonsterLocomotion.Abp_HumanoidCS_MonsterLocomotion_C
// 0x3B40 (0x3FB0 - 0x0470)
class UAbp_HumanoidCS_MonsterLocomotion_C final : public UBUAnimHumanoidCS_MonsterLocomotion
{
public:
	uint8                                         Pad_461[0x7];                                      // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0468(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct Abp_HumanoidCS_MonsterLocomotion::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x0470(0x0160)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x05D0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x05D8(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x05E0(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_11;                   // 0x0600(0x0108)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_10;                   // 0x0708(0x0108)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_9;                    // 0x0810(0x0108)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_8;                    // 0x0918(0x0108)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_7;                    // 0x0A20(0x0108)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_6;                    // 0x0B28(0x0108)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_5;                    // 0x0C30(0x0108)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_7;                   // 0x0D38(0x00C8)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_6;                   // 0x0E00(0x00C8)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5;                   // 0x0EC8(0x00C8)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x0F90(0x00C8)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x1058(0x00C8)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x1120(0x00C8)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x11E8(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_32;                 // 0x12B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_31;                 // 0x12D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_30;                 // 0x1300(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_29;                 // 0x1328(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_35;                    // 0x1350(0x0028)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_7;                     // 0x1378(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_34;                    // 0x13C8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_33;                    // 0x13F0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_32;                    // 0x1418(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_26;                      // 0x1440(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_31;                    // 0x1460(0x0028)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_6;                     // 0x1488(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_30;                    // 0x14D8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_29;                    // 0x1500(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_28;                    // 0x1528(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_25;                      // 0x1550(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_27;                    // 0x1570(0x0028)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_5;                     // 0x1598(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_26;                    // 0x15E8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_25;                    // 0x1610(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_24;                    // 0x1638(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_24;                      // 0x1660(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_23;                    // 0x1680(0x0028)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_4;                     // 0x16A8(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_22;                    // 0x16F8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_21;                    // 0x1720(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_20;                    // 0x1748(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_23;                      // 0x1770(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_19;                    // 0x1790(0x0028)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_3;                     // 0x17B8(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_18;                    // 0x1808(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_17;                    // 0x1830(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_16;                    // 0x1858(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_22;                      // 0x1880(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_15;                    // 0x18A0(0x0028)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_2;                     // 0x18C8(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_14;                    // 0x1918(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_13;                    // 0x1940(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_12;                    // 0x1968(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_21;                      // 0x1990(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_6;                      // 0x19B0(0x00B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_11;                    // 0x1A68(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_10;                    // 0x1A90(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_4;                    // 0x1AB8(0x0108)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1BC0(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1C08(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_28;                 // 0x1C28(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_27;                 // 0x1C50(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_26;                 // 0x1C78(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_25;                 // 0x1CA0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_24;                 // 0x1CC8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_23;                 // 0x1CF0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_22;                 // 0x1D18(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_21;                 // 0x1D40(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_20;                 // 0x1D68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_19;                 // 0x1D90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_18;                 // 0x1DB8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_14;                   // 0x1DE0(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_20;                      // 0x1E20(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_13;                   // 0x1E40(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_19;                      // 0x1E80(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17;                 // 0x1EA0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0x1EC8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_18;                      // 0x1EF0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_5;                      // 0x1F10(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_17;                      // 0x1FC8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16;                 // 0x1FE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0x2010(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0x2038(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0x2060(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x2088(0x0028)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_3;                   // 0x20B0(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_2;                   // 0x20F8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x2140(0x0028)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_3;                       // 0x2168(0x0100)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x2268(0x00E0)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_11;                // 0x2348(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_10;                // 0x2388(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_9;                 // 0x23C8(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_8;                 // 0x2408(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_7;                 // 0x2448(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_6;                 // 0x2488(0x0040)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_1;                     // 0x24C8(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_16;                      // 0x2518(0x0020)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_1;                   // 0x2538(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x2580(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_5;                 // 0x25C8(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_4;                 // 0x2608(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_3;                 // 0x2648(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_2;                 // 0x2688(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_1;                 // 0x26C8(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x2708(0x0040)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend;                       // 0x2748(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x2798(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x27C0(0x00E0)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_2;                       // 0x28A0(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_15;                      // 0x29A0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x29C0(0x0028)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_1;                       // 0x29E8(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_14;                      // 0x2AE8(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x2B08(0x0028)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve;                         // 0x2B30(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_13;                      // 0x2C30(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x2C50(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x2C78(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_12;                      // 0x2CA0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_4;                      // 0x2CC0(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_11;                      // 0x2D78(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x2D98(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_10;                      // 0x2DC0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x2DE0(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9;                       // 0x2E08(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_3;                      // 0x2E28(0x00B8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0x2EE0(0x0108)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_12;                   // 0x2FE8(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0x3028(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2;                      // 0x3048(0x00B8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x3100(0x0108)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_11;                   // 0x3208(0x0040)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x3248(0x00A8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10;                   // 0x32F0(0x0040)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x3330(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x33F8(0x0068)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x3460(0x0040)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x34A0(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x3568(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x35A8(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x35E8(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x3628(0x0040)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x3668(0x0068)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x36D0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x36F0(0x00B8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x37A8(0x0108)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x38B0(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x38D8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x3920(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x3948(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x3970(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x3998(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x39C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x39E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x3A10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x3A38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x3A60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x3A88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x3AB0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x3AD8(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x3B18(0x0020)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x3B38(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x3B58(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x3B98(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x3BB8(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x3BF8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x3C18(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x3C58(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x3C78(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x3CB8(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x3CD8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x3D00(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x3D20(0x00B8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x3DD8(0x0108)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x3EE0(0x00C8)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void HumanLoopBlending(const struct FPoseLink& FreeFwd, const struct FPoseLink& LockFwd, const struct FPoseLink& Bwd, const struct FPoseLink& FL, const struct FPoseLink& BL, const struct FPoseLink& FR, const struct FPoseLink& BR, struct FPoseLink* HumanLoopBlending_0);
	void ExecuteUbergraph_Abp_HumanoidCS_MonsterLocomotion(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Abp_HumanoidCS_MonsterLocomotion_AnimGraphNode_TransitionResult_E671CB5540404221C9BB3197A8FCF124();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Abp_HumanoidCS_MonsterLocomotion_AnimGraphNode_TransitionResult_C84A0DB54B620FE296E9C8944D75D625();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Abp_HumanoidCS_MonsterLocomotion_AnimGraphNode_TransitionResult_A954EBF74A7C02ED350D9CB34ADA94DD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Abp_HumanoidCS_MonsterLocomotion_AnimGraphNode_TransitionResult_98514E0A4649836BF7CD77936F9D382F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Abp_HumanoidCS_MonsterLocomotion_AnimGraphNode_TransitionResult_5970CBD141B6B77ED5EFE881BAA1D722();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Abp_HumanoidCS_MonsterLocomotion_AnimGraphNode_TransitionResult_52B8664D436EF910B652C6B8D000B839();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Abp_HumanoidCS_MonsterLocomotion_AnimGraphNode_TransitionResult_17EA6C9449C600B55E6E82BCD9D0EEBA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Abp_HumanoidCS_MonsterLocomotion_AnimGraphNode_MultiWayBlend_F695226045AF0F6324CBED9576F43484();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Abp_HumanoidCS_MonsterLocomotion_AnimGraphNode_MultiWayBlend_DE9C523348FCEB1915B229AC1D375DD1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Abp_HumanoidCS_MonsterLocomotion_AnimGraphNode_MultiWayBlend_DC2C416247D2257B535E09844AFC3BE7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Abp_HumanoidCS_MonsterLocomotion_AnimGraphNode_MultiWayBlend_BFB5E324457FC6C6CCB43A806F2E5009();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Abp_HumanoidCS_MonsterLocomotion_AnimGraphNode_MultiWayBlend_AA36E5DD452CEC40EEFA15B550011CC3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Abp_HumanoidCS_MonsterLocomotion_AnimGraphNode_MultiWayBlend_5C76C0A34CB38114D3D630BB8E29AB39();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Abp_HumanoidCS_MonsterLocomotion_AnimGraphNode_MultiWayBlend_51E090414FCD9EA6C5FD048053FB39E2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Abp_HumanoidCS_MonsterLocomotion_AnimGraphNode_MultiWayBlend_4266F63B440F3838701EC4A98E1CD84F();
	void AnimNotify_EnterMoveLoop();
	void AnimNotify_EnterLockStopRight();
	void AnimNotify_EnterLockStopLeft();
	void AnimNotify_EnterLockLoopFR();
	void AnimNotify_EnterLockLoopFL();
	void AnimNotify_EnterLockLoopF();
	void AnimNotify_EnterLockLoopBR();
	void AnimNotify_EnterLockLoopBL();
	void AnimNotify_EnterLockLoopB();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Abp_HumanoidCS_MonsterLocomotion_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Abp_HumanoidCS_MonsterLocomotion_C")
	}
	static class UAbp_HumanoidCS_MonsterLocomotion_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbp_HumanoidCS_MonsterLocomotion_C>();
	}
};
DUMPER7_ASSERTS_UAbp_HumanoidCS_MonsterLocomotion_C;

}

