#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Abp_EquipPreviewActor

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Abp_EquipPreviewActor_structs.hpp"
#include "Engine_structs.hpp"
#include "b1_Managed_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Abp_EquipPreviewActor.Abp_EquipPreviewActor_C
// 0x00D0 (0x0430 - 0x0360)
class UAbp_EquipPreviewActor_C : public UBUAnimEquipPreview
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct Abp_EquipPreviewActor::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;        // 0x0360(0x0010)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0370(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0378(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0380(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x03A0(0x0040)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x03E0(0x0048)()

public:
	void ExecuteUbergraph_Abp_EquipPreviewActor(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Abp_EquipPreviewActor_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Abp_EquipPreviewActor_C")
	}
	static class UAbp_EquipPreviewActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbp_EquipPreviewActor_C>();
	}
};
DUMPER7_ASSERTS_UAbp_EquipPreviewActor_C;

}

