#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_humanoidcs_leftarmseparation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "b1_Managed_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_humanoidcs_leftarmseparation.ABP_humanoidcs_leftarmseparation_C
// 0x04C0 (0x0820 - 0x0360)
class UABP_humanoidcs_leftarmseparation_C final : public UBUAnimHumanoidCS_LeftArmSeparation
{
public:
	uint8                                         Pad_354[0x4];                                      // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0360(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0368(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0370(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x0390(0x00C8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0458(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0538(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x0560(0x00C8)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0628(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x06F0(0x0108)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x07F8(0x0028)()

public:
	void ExecuteUbergraph_ABP_humanoidcs_leftarmseparation(int32 EntryPoint);
	void AnimGraph(const struct FPoseLink& InPose_Normal, const struct FPoseLink& InPose_LeftArm, struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_humanoidcs_leftarmseparation_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_humanoidcs_leftarmseparation_C")
	}
	static class UABP_humanoidcs_leftarmseparation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_humanoidcs_leftarmseparation_C>();
	}
};
DUMPER7_ASSERTS_UABP_humanoidcs_leftarmseparation_C;

}

