#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Abp_InteractiveActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "b1_Managed_classes.hpp"
#include "Abp_InteractiveActor_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Abp_InteractiveActor.Abp_InteractiveActor_C
// 0x00D0 (0x0430 - 0x0360)
class UAbp_InteractiveActor_C : public UBUAnimInteractiveActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct Abp_InteractiveActor::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;         // 0x0368(0x0010)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0388(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x03A8(0x0040)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x03E8(0x0048)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_Abp_InteractiveActor(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Abp_InteractiveActor_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Abp_InteractiveActor_C")
	}
	static class UAbp_InteractiveActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbp_InteractiveActor_C>();
	}
};
DUMPER7_ASSERTS_UAbp_InteractiveActor_C;

}

