#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Abp_HumanoidCS_SpecialMove

#include "Basic.hpp"

#include "Abp_HumanoidCS_SpecialMove_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "b1_Managed_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Abp_HumanoidCS_SpecialMove.Abp_HumanoidCS_SpecialMove_C
// 0x6C30 (0x73D0 - 0x07A0)
class UAbp_HumanoidCS_SpecialMove_C final : public UBUAnimHumanoidCS_SpecialMove
{
public:
	uint8                                         Pad_797[0x1];                                      // 0x0797(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0798(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct Abp_HumanoidCS_SpecialMove::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;   // 0x07A0(0x0318)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0AB8(0x0008)()
	struct FAnimSubsystemInstance_NodeRelevancy   AnimBlueprintExtension_NodeRelevancy;              // 0x0AC0(0x00A8)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0B68(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x0B70(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x0B90(0x0040)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0BD0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x0BF0(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x0CB8(0x0108)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_146;                // 0x0DC0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_145;                // 0x0DE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_144;                // 0x0E10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_143;                // 0x0E38(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_70;                   // 0x0E60(0x0040)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_10;                    // 0x0EA0(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_19;                    // 0x0F68(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_112;                     // 0x0F90(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_69;                   // 0x0FB0(0x0040)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_9;                     // 0x0FF0(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_18;                    // 0x10B8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_111;                     // 0x10E0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_17;                    // 0x1100(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_110;                     // 0x1128(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_29;                     // 0x1148(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1200(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x1220(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x12E8(0x0108)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_142;                // 0x13F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_141;                // 0x1418(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_140;                // 0x1440(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_139;                // 0x1468(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_138;                // 0x1490(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_137;                // 0x14B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_136;                // 0x14E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_135;                // 0x1508(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_134;                // 0x1530(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_133;                // 0x1558(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_132;                // 0x1580(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_131;                // 0x15A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_130;                // 0x15D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_129;                // 0x15F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_128;                // 0x1620(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_127;                // 0x1648(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_126;                // 0x1670(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_125;                // 0x1698(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_124;                // 0x16C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_123;                // 0x16E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_122;                // 0x1710(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_121;                // 0x1738(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_120;                // 0x1760(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_119;                // 0x1788(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_118;                // 0x17B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_117;                // 0x17D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_116;                // 0x1800(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_115;                // 0x1828(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_114;                // 0x1850(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_113;                // 0x1878(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_112;                // 0x18A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_111;                // 0x18C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_110;                // 0x18F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_109;                // 0x1918(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_68;                   // 0x1940(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_109;                     // 0x1980(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_67;                   // 0x19A0(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_108;                     // 0x19E0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_108;                // 0x1A00(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_28;                     // 0x1A28(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_107;                     // 0x1AE0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_107;                // 0x1B00(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_106;                // 0x1B28(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_66;                   // 0x1B50(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_106;                     // 0x1B90(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_65;                   // 0x1BB0(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_105;                     // 0x1BF0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_105;                // 0x1C10(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_27;                     // 0x1C38(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_104;                     // 0x1CF0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_26;                     // 0x1D10(0x00B8)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_1;                       // 0x1DC8(0x0100)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve;                         // 0x1EC8(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_103;                     // 0x1FC8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_104;                // 0x1FE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_103;                // 0x2010(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_64;                   // 0x2038(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_102;                     // 0x2078(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_63;                   // 0x2098(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_101;                     // 0x20D8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_102;                // 0x20F8(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_25;                     // 0x2120(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_100;                     // 0x21D8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_101;                // 0x21F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_100;                // 0x2220(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_62;                   // 0x2248(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_99;                      // 0x2288(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_61;                   // 0x22A8(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_98;                      // 0x22E8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_99;                 // 0x2308(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_24;                     // 0x2330(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_97;                      // 0x23E8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_98;                 // 0x2408(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_97;                 // 0x2430(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_60;                   // 0x2458(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_96;                      // 0x2498(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_59;                   // 0x24B8(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_95;                      // 0x24F8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_96;                 // 0x2518(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_23;                     // 0x2540(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_94;                      // 0x25F8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_95;                 // 0x2618(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_94;                 // 0x2640(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_58;                   // 0x2668(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_93;                      // 0x26A8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_57;                   // 0x26C8(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_92;                      // 0x2708(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_93;                 // 0x2728(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_22;                     // 0x2750(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_91;                      // 0x2808(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_21;                     // 0x2828(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_90;                      // 0x28E0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_92;                 // 0x2900(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_91;                 // 0x2928(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_56;                   // 0x2950(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_89;                      // 0x2990(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_55;                   // 0x29B0(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_88;                      // 0x29F0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_16;                    // 0x2A10(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_87;                      // 0x2A38(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_20;                     // 0x2A58(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_86;                      // 0x2B10(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_90;                 // 0x2B30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_89;                 // 0x2B58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_88;                 // 0x2B80(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_87;                 // 0x2BA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_86;                 // 0x2BD0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_85;                 // 0x2BF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_84;                 // 0x2C20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_83;                 // 0x2C48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_82;                 // 0x2C70(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_81;                 // 0x2C98(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_80;                 // 0x2CC0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_79;                 // 0x2CE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_78;                 // 0x2D10(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_54;                   // 0x2D38(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_85;                      // 0x2D78(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_53;                   // 0x2D98(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_84;                      // 0x2DD8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_19;                     // 0x2DF8(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_83;                      // 0x2EB0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_77;                 // 0x2ED0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_76;                 // 0x2EF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_75;                 // 0x2F20(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_52;                   // 0x2F48(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_82;                      // 0x2F88(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_51;                   // 0x2FA8(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_81;                      // 0x2FE8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_74;                 // 0x3008(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_15;                    // 0x3030(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_80;                      // 0x3058(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_18;                     // 0x3078(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_79;                      // 0x3130(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_73;                 // 0x3150(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_72;                 // 0x3178(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_71;                 // 0x31A0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_50;                   // 0x31C8(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_78;                      // 0x3208(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_49;                   // 0x3228(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_77;                      // 0x3268(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_70;                 // 0x3288(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_14;                    // 0x32B0(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_76;                      // 0x32D8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_17;                     // 0x32F8(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_75;                      // 0x33B0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_69;                 // 0x33D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_68;                 // 0x33F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_67;                 // 0x3420(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_66;                 // 0x3448(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_65;                 // 0x3470(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_64;                 // 0x3498(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_63;                 // 0x34C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_62;                 // 0x34E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_61;                 // 0x3510(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_60;                 // 0x3538(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_59;                 // 0x3560(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_48;                   // 0x3588(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_74;                      // 0x35C8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_47;                   // 0x35E8(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_73;                      // 0x3628(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_46;                   // 0x3648(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_72;                      // 0x3688(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_45;                   // 0x36A8(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_71;                      // 0x36E8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_44;                   // 0x3708(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_70;                      // 0x3748(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_43;                   // 0x3768(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_69;                      // 0x37A8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_42;                   // 0x37C8(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_68;                      // 0x3808(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_41;                   // 0x3828(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_67;                      // 0x3868(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_40;                   // 0x3888(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_66;                      // 0x38C8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_39;                   // 0x38E8(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_65;                      // 0x3928(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_38;                   // 0x3948(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_64;                      // 0x3988(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_37;                   // 0x39A8(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_63;                      // 0x39E8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_58;                 // 0x3A08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_57;                 // 0x3A30(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_13;                    // 0x3A58(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_62;                      // 0x3A80(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_16;                     // 0x3AA0(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_61;                      // 0x3B58(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_56;                 // 0x3B78(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_36;                   // 0x3BA0(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_60;                      // 0x3BE0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_35;                   // 0x3C00(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_34;                   // 0x3C40(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_33;                   // 0x3C80(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_32;                   // 0x3CC0(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_31;                   // 0x3D00(0x0040)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x3D40(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_30;                   // 0x3D88(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_59;                      // 0x3DC8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_15;                     // 0x3DE8(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_58;                      // 0x3EA0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_12;                    // 0x3EC0(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_57;                      // 0x3EE8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_14;                     // 0x3F08(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_56;                      // 0x3FC0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_55;                 // 0x3FE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_54;                 // 0x4008(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_53;                 // 0x4030(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_29;                   // 0x4058(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_55;                      // 0x4098(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_28;                   // 0x40B8(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_54;                      // 0x40F8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_52;                 // 0x4118(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_11;                    // 0x4140(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_53;                      // 0x4168(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_13;                     // 0x4188(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_52;                      // 0x4240(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_51;                 // 0x4260(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_50;                 // 0x4288(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_49;                 // 0x42B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_48;                 // 0x42D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_47;                 // 0x4300(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_27;                   // 0x4328(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_51;                      // 0x4368(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_26;                   // 0x4388(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_50;                      // 0x43C8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_25;                   // 0x43E8(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_49;                      // 0x4428(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_24;                   // 0x4448(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_48;                      // 0x4488(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_46;                 // 0x44A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_45;                 // 0x44D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_44;                 // 0x44F8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_10;                    // 0x4520(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_47;                      // 0x4548(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_12;                     // 0x4568(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_46;                      // 0x4620(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_23;                   // 0x4640(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_45;                      // 0x4680(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_43;                 // 0x46A0(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_11;                 // 0x46C8(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_10;                 // 0x4730(0x0068)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_42;                 // 0x4798(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_41;                 // 0x47C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_40;                 // 0x47E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_39;                 // 0x4810(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_38;                 // 0x4838(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_9;                  // 0x4860(0x0068)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_44;                      // 0x48C8(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_8;                  // 0x48E8(0x0068)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_43;                      // 0x4950(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_7;                  // 0x4970(0x0068)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_42;                      // 0x49D8(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_6;                  // 0x49F8(0x0068)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_41;                      // 0x4A60(0x0020)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_40;                      // 0x4A80(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_11;                     // 0x4AA0(0x00B8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_8;                     // 0x4B58(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_7;                     // 0x4C20(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_39;                      // 0x4CE8(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0x4D08(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_38;                      // 0x4D30(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_10;                     // 0x4D50(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_37;                      // 0x4E08(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_22;                   // 0x4E28(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_36;                      // 0x4E68(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_37;                 // 0x4E88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_36;                 // 0x4EB0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_35;                 // 0x4ED8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_34;                 // 0x4F00(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_21;                   // 0x4F28(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_35;                      // 0x4F68(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_33;                 // 0x4F88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_32;                 // 0x4FB0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_31;                 // 0x4FD8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_20;                   // 0x5000(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_34;                      // 0x5040(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_19;                   // 0x5060(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_33;                      // 0x50A0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_30;                 // 0x50C0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x50E8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_32;                      // 0x5110(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_9;                      // 0x5130(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_31;                      // 0x51E8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_29;                 // 0x5208(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_28;                 // 0x5230(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_27;                 // 0x5258(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_18;                   // 0x5280(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_30;                      // 0x52C0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_17;                   // 0x52E0(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_29;                      // 0x5320(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_26;                 // 0x5340(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x5368(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_28;                      // 0x5390(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_8;                      // 0x53B0(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_27;                      // 0x5468(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_16;                   // 0x5488(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x54C8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_15;                   // 0x5510(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_26;                      // 0x5550(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x5570(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_25;                      // 0x5598(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_7;                      // 0x55B8(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_24;                      // 0x5670(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_25;                 // 0x5690(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_24;                 // 0x56B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_23;                 // 0x56E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_22;                 // 0x5708(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_21;                 // 0x5730(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_20;                 // 0x5758(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_19;                 // 0x5780(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_18;                 // 0x57A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17;                 // 0x57D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16;                 // 0x57F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0x5820(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_14;                   // 0x5848(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_23;                      // 0x5888(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_13;                   // 0x58A8(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_22;                      // 0x58E8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0x5908(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_12;                   // 0x5930(0x0040)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_4;                       // 0x5970(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_11;                   // 0x5A38(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_21;                      // 0x5A78(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10;                   // 0x5A98(0x0040)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_3;                       // 0x5AD8(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x5BA0(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_20;                      // 0x5BE0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0x5C00(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x5C28(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x5C50(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_19;                      // 0x5C78(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x5C98(0x0040)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_2;                       // 0x5CD8(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x5DA0(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_18;                      // 0x5DE0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x5E00(0x0040)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_1;                       // 0x5E40(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x5F08(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_17;                      // 0x5F48(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x5F68(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_6;                      // 0x5F90(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_16;                      // 0x6048(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x6068(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x6090(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x60B8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_15;                      // 0x60E0(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_5;                  // 0x6100(0x0068)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_6;                     // 0x6168(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x6230(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_14;                      // 0x6270(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_4;                  // 0x6290(0x0068)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_5;                     // 0x62F8(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_3;                  // 0x63C0(0x0068)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_4;                     // 0x6428(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2;                  // 0x64F0(0x0068)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_3;                     // 0x6558(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x6620(0x0068)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_2;                     // 0x6688(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x6750(0x0068)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x67B8(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x6880(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x68C0(0x0040)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x6900(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_13;                      // 0x69C8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_5;                      // 0x69E8(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_12;                      // 0x6AA0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_4;                      // 0x6AC0(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_11;                      // 0x6B78(0x0020)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_10;                      // 0x6B98(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x6BB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x6BE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x6C08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x6C30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x6C58(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x6C80(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9;                       // 0x6CC0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x6CE0(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0x6D20(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x6D40(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x6D68(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x6D90(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_3;                      // 0x6DB0(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x6E68(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x6E88(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x6EB0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2;                      // 0x6ED0(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x6F88(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x6FA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x6FD0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x6FF8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x7020(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x7048(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x7068(0x00A8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x7110(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x71D8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x7200(0x0020)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x7220(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x7240(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x72F8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x7318(0x00B8)()

public:
	void GroundedAddivite(struct FPoseLink* GroundedAddivite_0);
	void GlideLoopFlatRotationAdditive(const struct FPoseLink& GlideLoopBase, struct FPoseLink* GlideLoopFlatRotationAdditive_0);
	void ExecuteUbergraph_Abp_HumanoidCS_SpecialMove(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Abp_HumanoidCS_SpecialMove_AnimGraphNode_TransitionResult_F3FAD29E405DC287D52DA0A560604D81();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Abp_HumanoidCS_SpecialMove_AnimGraphNode_TransitionResult_B5F0044D4C706D8D616FE5968E8DAA3F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Abp_HumanoidCS_SpecialMove_AnimGraphNode_TransitionResult_A2848EDA4052FED61BF898915FD98B90();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Abp_HumanoidCS_SpecialMove_AnimGraphNode_TransitionResult_6885BAE440EA0596516789AF403218E6();
