#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Abp_HumanoidCS_MotionMatching

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Abp_HumanoidCS_MotionMatching_structs.hpp"
#include "GSEngineExtent_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "b1_Managed_classes.hpp"
#include "MM_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Abp_HumanoidCS_MotionMatching.Abp_HumanoidCS_MotionMatching_C
// 0x1400 (0x1900 - 0x0500)
class UAbp_HumanoidCS_MotionMatching_C final : public UBUAnimHumanoidCS_MotionMatching
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0500(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct Abp_HumanoidCS_MotionMatching::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x0508(0x0040)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0548(0x0008)()
	struct FAnimSubsystemInstance_NodeRelevancy   AnimBlueprintExtension_NodeRelevancy;              // 0x0550(0x00A8)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x05F8(0x0008)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x0600(0x0108)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x0708(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x0750(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x0778(0x0028)()
	struct FAnimNode_GSLayeredBoneBlend           AnimGraphNode_GSLayeredBoneBlend;                  // 0x07A0(0x00F8)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0898(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x0960(0x0108)()
	uint8                                         Pad_A68[0x8];                                      // 0x0A68(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMMForLMAnimGraph                      MMForLMAnimationNode;                              // 0x0A70(0x02C0)()
	struct FMotionMatchingAnimGraph               MotionMatchingAnimationNode;                       // 0x0D30(0x0250)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0F80(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x0FC8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2;                      // 0x0FE8(0x00B8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x10A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x10C8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x10F0(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x1130(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x1150(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x1178(0x0068)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x11E0(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x12A8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x12C8(0x00B8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x1380(0x0040)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x13C0(0x0108)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x14C8(0x0040)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x1508(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x1530(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1558(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x1598(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x15B8(0x0068)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x1620(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x1640(0x00B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x16F8(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x1720(0x00E0)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1800(0x0020)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x1820(0x00E0)()

public:
	void ExecuteUbergraph_Abp_HumanoidCS_MotionMatching(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Abp_HumanoidCS_MotionMatching_AnimGraphNode_TransitionResult_A0C5014E4DC1C8BB25FF76A03836132A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Abp_HumanoidCS_MotionMatching_AnimGraphNode_TransitionResult_04AF3E014296BCBA5706FAA367B97870();
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Abp_HumanoidCS_MotionMatching_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Abp_HumanoidCS_MotionMatching_C")
	}
	static class UAbp_HumanoidCS_MotionMatching_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbp_HumanoidCS_MotionMatching_C>();
	}
};
DUMPER7_ASSERTS_UAbp_HumanoidCS_MotionMatching_C;

}

