#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_humanoidcs_footik

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ABP_humanoidcs_footik.ABP_humanoidcs_footik_C.ExecuteUbergraph_ABP_humanoidcs_footik
// 0x0028 (0x0028 - 0x0000)
struct ABP_humanoidcs_footik_C_ExecuteUbergraph_ABP_humanoidcs_footik final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector_Z_WideningCast;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_humanoidcs_footik_C_ExecuteUbergraph_ABP_humanoidcs_footik;

// Function ABP_humanoidcs_footik.ABP_humanoidcs_footik_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct ABP_humanoidcs_footik_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimGraph_0;                                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_humanoidcs_footik_C_AnimGraph;

}

