#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_humanoidcs_upperbodyseparation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ABP_humanoidcs_upperbodyseparation_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "b1_Managed_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_humanoidcs_upperbodyseparation.ABP_humanoidcs_upperbodyseparation_C
// 0x07A0 (0x0B10 - 0x0370)
class UABP_humanoidcs_upperbodyseparation_C final : public UBUAnimHumanoidCS_UpperBodySeparation
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0368(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_humanoidcs_upperbodyseparation::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x0370(0x0018)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0388(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0390(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0398(0x0020)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x03B8(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x0480(0x0068)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x04E8(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x05B0(0x0020)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x05D0(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x06B0(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x06D8(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x07A0(0x00A8)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x0848(0x00C8)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0910(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x09D8(0x0108)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0AE0(0x0028)()

public:
	void UpperBodyBlendAdditivePose(const struct FPoseLink& InPose, struct FPoseLink* UpperBodyBlendAdditivePose_0);
	void ExecuteUbergraph_ABP_humanoidcs_upperbodyseparation(int32 EntryPoint);
	void AnimGraph(const struct FPoseLink& InPose_Normal, const struct FPoseLink& InPose_UpperBody, struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_humanoidcs_upperbodyseparation_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_humanoidcs_upperbodyseparation_C")
	}
	static class UABP_humanoidcs_upperbodyseparation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_humanoidcs_upperbodyseparation_C>();
	}
};
DUMPER7_ASSERTS_UABP_humanoidcs_upperbodyseparation_C;

}

