#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Abp_HumanoidCS_Simple4Dir

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "GSEngineExtent_structs.hpp"
#include "Abp_HumanoidCS_Simple4Dir_structs.hpp"
#include "b1_Managed_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Abp_HumanoidCS_Simple4Dir.Abp_HumanoidCS_Simple4Dir_C
// 0x1020 (0x1460 - 0x0440)
class UAbp_HumanoidCS_Simple4Dir_C final : public UBUAnimHumanoidCS_Simple4Dir
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0440(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct Abp_HumanoidCS_Simple4Dir::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;    // 0x0448(0x0160)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x05A8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x05B0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x05B8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0x05D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0x0600(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x0628(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x0650(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x0678(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x06A0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x06C8(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9;                       // 0x0708(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0728(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0x0768(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0788(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x07C8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x07E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x0810(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x0838(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x0860(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x0888(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x08B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x08D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0900(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0928(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_11;                 // 0x0950(0x0068)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x09B8(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_10;                 // 0x09D8(0x0068)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x0A40(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_9;                  // 0x0A60(0x0068)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x0AC8(0x0020)()
	struct FAnimMode_GSOrientationWarping         AnimGraphNode_GSOrientationWarping;                // 0x0AE8(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_8;                  // 0x0B50(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_7;                  // 0x0BB8(0x0068)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x0C20(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x0C68(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x0CB0(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_6;                  // 0x0CF8(0x0068)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x0D60(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_5;                  // 0x0DA8(0x0068)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0E10(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_4;                  // 0x0E58(0x0068)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x0EC0(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_3;                  // 0x0F08(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2;                  // 0x0F70(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x0FD8(0x0068)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x1040(0x0068)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x10A8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x10C8(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x1108(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2;                      // 0x1128(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x11E0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x1200(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x12B8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x12D8(0x00B8)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x1390(0x00C8)()

public:
	void ExecuteUbergraph_Abp_HumanoidCS_Simple4Dir(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Abp_HumanoidCS_Simple4Dir_AnimGraphNode_TransitionResult_F9B8D6D242AEAA75FB435F80A681A584();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Abp_HumanoidCS_Simple4Dir_AnimGraphNode_TransitionResult_D102B5B8414212C266469CAD833AACB3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Abp_HumanoidCS_Simple4Dir_AnimGraphNode_TransitionResult_BBCC167249B3F206916C6D8749070E0B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Abp_HumanoidCS_Simple4Dir_AnimGraphNode_TransitionResult_9B82B7134310A46AA01B3EB1BD58CF18();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Abp_HumanoidCS_Simple4Dir_AnimGraphNode_TransitionResult_61B479AA4B4E26AF9E356C9A27DFAF1D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Abp_HumanoidCS_Simple4Dir_AnimGraphNode_TransitionResult_35C984434C1F5F898F593BB514E5956C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Abp_HumanoidCS_Simple4Dir_AnimGraphNode_TransitionResult_1071C6D745E7C01659E7EF980DA34D64();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Abp_HumanoidCS_Simple4Dir_AnimGraphNode_SequencePlayer_A87E1822407ECB0E657412AAA73B4BA9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Abp_HumanoidCS_Simple4Dir_AnimGraphNode_BlendListByBool_D35932C7404D125E33B0F2B6AB9D7E28();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Abp_HumanoidCS_Simple4Dir_AnimGraphNode_BlendListByBool_71387B3C4302358A8D5D5887DDC22A19();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Abp_HumanoidCS_Simple4Dir_AnimGraphNode_BlendListByBool_2953EC634E9365C1EBA3618085A896D9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Abp_HumanoidCS_Simple4Dir_AnimGraphNode_BlendListByBool_1B511D7041E0C6A313D2F98EEEDF6B94();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Abp_HumanoidCS_Simple4Dir_AnimGraphNode_BlendListByBool_1807C5B4455D7B071974BBB76625E78E();
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Abp_HumanoidCS_Simple4Dir_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Abp_HumanoidCS_Simple4Dir_C")
	}
	static class UAbp_HumanoidCS_Simple4Dir_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbp_HumanoidCS_Simple4Dir_C>();
	}
};
DUMPER7_ASSERTS_UAbp_HumanoidCS_Simple4Dir_C;

}

