#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_humanoidcs_boneaim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ControlRig_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "b1_Managed_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_humanoidcs_boneaim.ABP_humanoidcs_boneaim_C
// 0x0590 (0x0930 - 0x03A0)
class UABP_humanoidcs_boneaim_C final : public UBUAnimHumanoidCS_BoneAim
{
public:
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03A0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03A8(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x03B0(0x0020)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x03D0(0x0458)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0828(0x00C8)()
	double                                        __CustomProperty_DegreesConstraint_E04E67FC4C0C89C0F1D31A9589F1169B; // 0x08F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                __CustomProperty_AimAxis_E04E67FC4C0C89C0F1D31A9589F1169B; // 0x08F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __CustomProperty_WeaponBoneName_E04E67FC4C0C89C0F1D31A9589F1169B; // 0x0910(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                __CustomProperty_AimPos_E04E67FC4C0C89C0F1D31A9589F1169B; // 0x0918(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ABP_humanoidcs_boneaim(int32 EntryPoint);
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_humanoidcs_boneaim_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_humanoidcs_boneaim_C")
	}
	static class UABP_humanoidcs_boneaim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_humanoidcs_boneaim_C>();
	}
};
DUMPER7_ASSERTS_UABP_humanoidcs_boneaim_C;

}

