#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AO_Parameters

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct AO_Parameters.AO_Parameters
// 0x0050 (0x0050 - 0x0000)
struct FAO_Parameters final
{
public:
	class FString                                 EnableAO_4_402B20584E745E3C12F1B7AF7AA87854;       // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 AOEnableMaterial_5_CC7E87EA478E0E374391B688FD73F056; // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 AOEnableTwoSideGeometry_6_C6D7C81641885C9241D31F8F7FDB1BFD; // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 AOSPP_10_2666C0F2490AC980438465B1B37CDDDC;         // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 AODenoiserHistoryConvolutionSampleCount_13_50EF88A94EC31AFC5F939FA82C735B40; // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FAO_Parameters;

}

