#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Arteries

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum Arteries.EArteriesGroupType
// NumValues: 0x0004
enum class EArteriesGroupType : uint8
{
	Point                                    = 0,
	Primitive                                = 1,
	Object                                   = 2,
	EArteriesGroupType_MAX                   = 3,
};

// Enum Arteries.EArteriesAlignType
// NumValues: 0x0004
enum class EArteriesAlignType : uint8
{
	Start                                    = 0,
	Center                                   = 1,
	End                                      = 2,
	EArteriesAlignType_MAX                   = 3,
};

// Enum Arteries.EArteriesTangentOutputType
// NumValues: 0x0004
enum class EArteriesTangentOutputType : uint8
{
	None                                     = 0,
	Flatten                                  = 1,
	Normal                                   = 2,
	EArteriesTangentOutputType_MAX           = 3,
};

// ScriptStruct Arteries.ArteriesElement
// 0x0198 (0x0198 - 0x0000)
struct FArteriesElement
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, int32>                      IntValues;                                         // 0x0008(0x0050)(Edit, NativeAccessSpecifierPublic)
	TMap<class FName, float>                      FloatValues;                                       // 0x0058(0x0050)(Edit, NativeAccessSpecifierPublic)
	TMap<class FName, struct FVector2D>           Vec2Values;                                        // 0x00A8(0x0050)(Edit, NativeAccessSpecifierPublic)
	TMap<class FName, struct FVector>             Vec3Values;                                        // 0x00F8(0x0050)(Edit, NativeAccessSpecifierPublic)
	TMap<class FName, class FString>              StrValues;                                         // 0x0148(0x0050)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FArteriesElement;

// ScriptStruct Arteries.ArteriesGroup
// 0x0010 (0x0010 - 0x0000)
struct FArteriesGroup
{
public:
	TArray<int32>                                 IDs;                                               // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FArteriesGroup;

// ScriptStruct Arteries.ArteriesPointGroup
// 0x0010 (0x0020 - 0x0010)
struct FArteriesPointGroup final : public FArteriesGroup
{
public:
	uint8                                         Pad_10[0x10];                                      // 0x0010(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FArteriesPointGroup;

// ScriptStruct Arteries.ArteriesPrimitiveGroup
// 0x0010 (0x0020 - 0x0010)
struct FArteriesPrimitiveGroup final : public FArteriesGroup
{
public:
	uint8                                         Pad_10[0x10];                                      // 0x0010(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FArteriesPrimitiveGroup;

// ScriptStruct Arteries.ArteriesEdgeGroup
// 0x0020 (0x0020 - 0x0000)
struct FArteriesEdgeGroup final
{
public:
	TArray<struct FIntPoint>                      IDs;                                               // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x10];                                      // 0x0010(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FArteriesEdgeGroup;

// ScriptStruct Arteries.ArteriesGroupRange
// 0x001C (0x001C - 0x0000)
struct FArteriesGroupRange final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Start;                                             // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         End;                                               // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Select;                                            // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Of;                                                // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Offset;                                            // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FArteriesGroupRange;

// ScriptStruct Arteries.ArteriesInstances
// 0x0010 (0x0010 - 0x0000)
struct FArteriesInstances final
{
public:
	TArray<struct FTransform>                     Transforms;                                        // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FArteriesInstances;

// ScriptStruct Arteries.ArteriesPoint
// 0x0028 (0x01C0 - 0x0198)
struct FArteriesPoint final : public FArteriesElement
{
public:
	struct FVector                                position;                                          // 0x0198(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B0[0x10];                                     // 0x01B0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FArteriesPoint;

// ScriptStruct Arteries.ArteriesPrimitive
// 0x0028 (0x01C0 - 0x0198)
struct FArteriesPrimitive final : public FArteriesElement
{
public:
	class UMaterialInterface*                     Material;                                          // 0x0198(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bClosed : 1;                                       // 0x01A0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1A1[0x1F];                                     // 0x01A1(0x001F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FArteriesPrimitive;

}

