#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AsyncLoadingScreen

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "AsyncLoadingScreen_structs.hpp"
#include "MoviePlayer_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class AsyncLoadingScreen.LoadingScreenSettings
// 0x0070 (0x00A0 - 0x0030)
class ULoadingScreenSettings final : public UDataAsset
{
public:
	class UUserWidget*                            LoadingScreenWidget;                               // 0x0030(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMoviePlaybackType                            PlaybackType;                                      // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         MoviePaths;                                        // 0x0040(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         ChildWidgetFadeAwayTime;                           // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BackgroundFadeAwayTime;                            // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ToggleIconFadeInTime;                              // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SlideFadeInTime;                                   // 0x005C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ProtectSwitchSlideTime;                            // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           PreviewAction;                                     // 0x0068(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInputAction*                           NextAction;                                        // 0x0070(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInputAction*                           ContinuePlayAction;                                // 0x0078(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FLoadingProgressInfo>           ProgressInfos;                                     // 0x0080(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FLoadingProgressInfo>           ProgressInfosWhite;                                // 0x0090(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LoadingScreenSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LoadingScreenSettings")
	}
	static class ULoadingScreenSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULoadingScreenSettings>();
	}
};
DUMPER7_ASSERTS_ULoadingScreenSettings;

// Class AsyncLoadingScreen.ToggleWidgetActionListener
// 0x0020 (0x0048 - 0x0028)
class UToggleWidgetActionListener final : public UObject
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DoContinuePlay() const;
	void DoNext() const;
	void DoPreview() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ToggleWidgetActionListener")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ToggleWidgetActionListener")
	}
	static class UToggleWidgetActionListener* GetDefaultObj()
	{
		return GetDefaultObjImpl<UToggleWidgetActionListener>();
	}
};
DUMPER7_ASSERTS_UToggleWidgetActionListener;

}

