#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AsyncLoadingScreen

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum AsyncLoadingScreen.EGSLoadingScreenState
// NumValues: 0x0005
enum class EGSLoadingScreenState : uint8
{
	Idle                                     = 0,
	SlateThreadUpdating                      = 1,
	GameThreadWaitingMovieFinish             = 2,
	MainThreadUpdating                       = 3,
	EGSLoadingScreenState_MAX                = 4,
};

// Enum AsyncLoadingScreen.EGSLoadingScreenType
// NumValues: 0x0008
enum class EGSLoadingScreenType : uint8
{
	Unknown                                  = 0,
	LoadProgOnly                             = 1,
	Full                                     = 2,
	FullBlack                                = 3,
	FullWhite                                = 4,
	Chapter                                  = 5,
	BossRush                                 = 6,
	EGSLoadingScreenType_MAX                 = 7,
};

// Enum AsyncLoadingScreen.EBossRushLoadingType
// NumValues: 0x0003
enum class EBossRushLoadingType : uint8
{
	ReChallengeBoss                          = 0,
	BossIterations                           = 1,
	EBossRushLoadingType_MAX                 = 2,
};

// ScriptStruct AsyncLoadingScreen.LoadingTipsInfo
// 0x0040 (0x0040 - 0x0000)
struct FLoadingTipsInfo final
{
public:
	int32                                         TipsId;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DurTime;                                           // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Title;                                             // 0x0008(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   Tips;                                              // 0x0020(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class UTexture2D*                             ImageObj;                                          // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLoadingTipsInfo;

// ScriptStruct AsyncLoadingScreen.LoadingProgressInfo
// 0x0030 (0x0030 - 0x0000)
struct FLoadingProgressInfo final
{
public:
	float                                         Duration;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        ProgressSprite;                                    // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSoftObjectPath>                DetailSprites;                                     // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLoadingProgressInfo;

// ScriptStruct AsyncLoadingScreen.ChapterInfo
// 0x0040 (0x0040 - 0x0000)
struct FChapterInfo final
{
public:
	bool                                          IsNeedShow;                                        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ChapterPreName;                                    // 0x0008(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   ChapterName;                                       // 0x0020(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class UTexture2D*                             ImageObj;                                          // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FChapterInfo;

// ScriptStruct AsyncLoadingScreen.BossRushInfo
// 0x0100 (0x0100 - 0x0000)
struct FBossRushInfo final
{
public:
	EBossRushLoadingType                          LoadingType;                                       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   BossName;                                          // 0x0008(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   DifficultyTitle;                                   // 0x0020(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   DifficultyDesc;                                    // 0x0038(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   DifficultyText;                                    // 0x0050(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	int32                                         DifficultyLevel;                                   // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   GroupText;                                         // 0x0070(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	int32                                         IterationsChallengeCurrentIndex;                   // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IterationsChallengeCount;                          // 0x008C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 DebuffList;                                        // 0x0090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class UTexture2D*                             BossImage;                                         // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsNeedHide;                                        // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class UTexture2D*>          Masks;                                             // 0x00B0(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBossRushInfo;

}

