#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: b1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "b1_structs.hpp"
#include "OnlineSubsystemUtils_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "SlateCore_structs.hpp"
#include "ReplicationGraph_structs.hpp"
#include "ReplicationGraph_classes.hpp"
#include "UnrealExtent_structs.hpp"
#include "UnrealExtent_classes.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "ProceduralMeshComponent_structs.hpp"
#include "AkAudio_structs.hpp"
#include "LevelSequence_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "MovieScene_classes.hpp"
#include "PhysicsCore_structs.hpp"
#include "AsyncLoadingScreen_structs.hpp"
#include "NetCore_structs.hpp"


namespace SDK
{

// Class b1.ActorDataContainer
// 0x0010 (0x00D0 - 0x00C0)
class UActorDataContainer : public UActorComponent
{
public:
	TArray<class UObject*>                        mDatas;                                            // 0x00C0(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)

public:
	void AddDataObjInCS(class UObject* Obj);
	void ClearDataObj();
	void InitOnNewInCS();
	void LateECSBeginPlay();
	void OnDestoryInCS();
	void PreECSBeginPlay();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ActorDataContainer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ActorDataContainer")
	}
	static class UActorDataContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorDataContainer>();
	}
};
DUMPER7_ASSERTS_UActorDataContainer;

// Class b1.ActorCompContainer
// 0x0018 (0x00D8 - 0x00C0)
class UActorCompContainer final : public UActorComponent
{
public:
	class UActorDataContainer*                    DataContainer;                                     // 0x00C0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UObject*                                EventCollection;                                   // 0x00C8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         TeamID;                                            // 0x00D0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void FillDataContainer(class UActorDataContainer* DataObj);
	void FillEventCollection(class UObject* DataObj);
	void SetTeamID(int32 ID);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ActorCompContainer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ActorCompContainer")
	}
	static class UActorCompContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorCompContainer>();
	}
};
DUMPER7_ASSERTS_UActorCompContainer;

// Class b1.BGUCrowdFollowingComponent
// 0x0090 (0x03B8 - 0x0328)
class UBGUCrowdFollowingComponent final : public UGSCrowdFollowingComponent
{
public:
	float                                         RotationSpeed;                                     // 0x0328(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPause;                                            // 0x032C(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32D[0x3];                                      // 0x032D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                DesiredVelocity;                                   // 0x0330(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DesiredAngleDelta;                                 // 0x0348(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34C[0x4];                                      // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RequestedVelocity;                                 // 0x0350(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         YawDelta;                                          // 0x0368(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               TerrainRotation;                                   // 0x0370(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         SpeedLimit;                                        // 0x0388(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38C[0x4];                                      // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                DeltaPosition;                                     // 0x0390(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotationSpeedMax;                                  // 0x03A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotationSpeedAcc;                                  // 0x03AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSupportFlock;                                     // 0x03B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetCrowdFollowingEnabled(bool bEnabled, bool bIsObstacle);
	void SetCrowdFollowingParam(float fSeparationWeight, float fCollisionQueryRange, float fPathOptimizationRange, int32 iAvoidanceQualityLevel);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BGUCrowdFollowingComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BGUCrowdFollowingComponent")
	}
	static class UBGUCrowdFollowingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBGUCrowdFollowingComponent>();
	}
};
DUMPER7_ASSERTS_UBGUCrowdFollowingComponent;

// Class b1.AnimNotifyFuncLibrary
// 0x0000 (0x0028 - 0x0028)
class UAnimNotifyFuncLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool ActorTryAnimNotifyDelayExecute(class AActor* NotifyOwner);
	static bool CanAnimNotifyDelayExecute(class AActor* NotifyOwner);
	static void DeleteAnimNotifyAndAnimNotifyState(class UAnimMontage* AnimMontage, const TArray<EGsEnAnimN>& NotifyTypeList, const TArray<EGsEnAnimNS>& NotifyStateTypeList);
	static void GetAllAnimNotifySoftAsset(class UAnimSequenceBase* AnimBase, TMap<class UAnimNotify_GSBase*, struct FNotifySoftRefs>* outNotifyRefs, TMap<class UAnimNotifyState_GSBase*, struct FNotifySoftRefs>* outNotifyStateRefs);
	static void PrepareAnimationsNotifySoftAsset(const TArray<class UAnimSequenceBase*>& AnimBases, TMap<class UAnimNotify_GSBase*, struct FNotifySoftRefs>* outNotifyRefs, TMap<class UAnimNotifyState_GSBase*, struct FNotifySoftRefs>* outNotifyStateRefs);
	static void PrepareAnimNotifySoftAsset(class UAnimSequenceBase* AnimBase, TMap<class UAnimNotify_GSBase*, struct FNotifySoftRefs>* outNotifyRefs, TMap<class UAnimNotifyState_GSBase*, struct FNotifySoftRefs>* outNotifyStateRefs);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotifyFuncLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotifyFuncLibrary")
	}
	static class UAnimNotifyFuncLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyFuncLibrary>();
	}
};
DUMPER7_ASSERTS_UAnimNotifyFuncLibrary;

// Class b1.BGUDataComp
// 0x0010 (0x00E0 - 0x00D0)
class UBGUDataComp : public UActorDataContainer
{
public:
	class UBUC_AIComponent*                       mUBUC_AIComponent;                                 // 0x00D0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBUC_ACharacterComponent*               mUBUC_ACharacterComponent;                         // 0x00D8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void InitWithAIController(class ABGUAIController* AIController);
	void InitWithCharacter(class ABGUCharacter* Character);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BGUDataComp")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BGUDataComp")
	}
	static class UBGUDataComp* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBGUDataComp>();
	}
};
DUMPER7_ASSERTS_UBGUDataComp;

// Class b1.AnimNotifyState_GSBase
// 0x0018 (0x0048 - 0x0030)
class UAnimNotifyState_GSBase : public UAnimNotifyState
{
public:
	EGsEnAnimNS                                   AnimNSType;                                        // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCanTriggerEndByCrossMontageBegin;                 // 0x0031(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          IsCheckAnimInstance;                               // 0x0032(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          CanBePlacedInASCS;                                 // 0x0033(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          CanUseQueuedType;                                  // 0x0034(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          isPreload;                                         // 0x0035(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        PreloadedAssets;                                   // 0x0038(0x0010)(BlueprintReadOnly, ZeroConstructor, Transient, NativeAccessSpecifierPrivate)

public:
	void AddPreloadedAsset(class UObject* Obj) const;
	EGsEnAnimNS GetAnimNSType() const;
	class FString GetJumpableSectionPrefix() const;
	float GetModifySpeedRate() const;
	TArray<class UObject*> GetPreloadedAssets() const;
	TArray<struct FSoftObjectPath> GetSoftReferences() const;
	bool GSAllowCrossSection() const;
	void GSNotifyBegin_Delay(struct FUStGSNotifyParam* NotifyParam, float TotalDuration) const;
	void GSNotifyBeginCS(const struct FUStGSNotifyParam& NotifyParam, float TotalDuration) const;
	int32 GSNotifyDebugPostBeginCS(const struct FUStGSNotifyParam& NotifyParam) const;
	int32 GSNotifyDebugPostEndCS(const struct FUStGSNotifyParam& NotifyParam) const;
	int32 GSNotifyDebugPostTickCS(const struct FUStGSNotifyParam& NotifyParam) const;
	int32 GSNotifyDebugPreBeginCS(const struct FUStGSNotifyParam& NotifyParam) const;
	int32 GSNotifyDebugPreEndCS(const struct FUStGSNotifyParam& NotifyParam) const;
	int32 GSNotifyDebugPreTickCS(const struct FUStGSNotifyParam& NotifyParam) const;
	void GSNotifyEnd_Delay(struct FUStGSNotifyParam* NotifyParam) const;
	void GSNotifyEndCS(const struct FUStGSNotifyParam& NotifyParam) const;
	void GSNotifyTick_Delay(struct FUStGSNotifyParam* NotifyParam, float FrameDeltaTime) const;
	void GSNotifyTickCS(const struct FUStGSNotifyParam& NotifyParam, float FrameDeltaTime) const;
	void GSOnSectionManuallyChanged(class ABGUCharacter* OwnerChar, float RemainingDuration) const;
	void GSValidateInputCS(class AActor* Actor) const;
	void UpdateDataOnNotifyStateReplace(const class UAnimNotifyState* NewNotifyState) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotifyState_GSBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotifyState_GSBase")
	}
	static class UAnimNotifyState_GSBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_GSBase>();
	}
};
DUMPER7_ASSERTS_UAnimNotifyState_GSBase;

// Class b1.EnvironmentSurfaceEffectMgr
// 0x0028 (0x02B0 - 0x0288)
class AEnvironmentSurfaceEffectMgr : public AActor
{
public:
	int32                                         DefaultEnvironmentSurfaceEffectID;                 // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWeatherType                                  WeatherType;                                       // 0x028C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_28D[0x3];                                      // 0x028D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class ABGWEnvironmentSurfaceVolume>> RegisteredVolumes;                    // 0x0290(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<TSoftObjectPtr<class ABGWEnvironmentSurfaceVolume>> DisabledVolumes;                      // 0x02A0(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	class ABGWEnvironmentSurfaceVolume* GetEnvironmentSurfaceVolumeByLocation(const struct FVector& Location);
	void RegisterVolume(const TSoftObjectPtr<class ABGWEnvironmentSurfaceVolume>& InVolume);
	void UnregisterVolume(const TSoftObjectPtr<class ABGWEnvironmentSurfaceVolume>& InVolume, bool IsDisableVolume);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EnvironmentSurfaceEffectMgr")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EnvironmentSurfaceEffectMgr")
	}
	static class AEnvironmentSurfaceEffectMgr* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEnvironmentSurfaceEffectMgr>();
	}
};
DUMPER7_ASSERTS_AEnvironmentSurfaceEffectMgr;

// Class b1.BGUDebugCircleComponent
// 0x0010 (0x0590 - 0x0580)
class UBGUDebugCircleComponent final : public UShapeComponent
{
public:
	float                                         CircleRadius;                                      // 0x0580(0x0004)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CircleThickness;                                   // 0x0584(0x0004)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_588[0x8];                                      // 0x0588(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetCircleRadius(float InCircleRadius);

	float GetScaledCircleRadius() const;
	float GetShapeScale() const;
	float GetUnscaledCircleRadius() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BGUDebugCircleComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BGUDebugCircleComponent")
	}
	static class UBGUDebugCircleComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBGUDebugCircleComponent>();
	}
};
DUMPER7_ASSERTS_UBGUDebugCircleComponent;

// Class b1.AnimNotifyState_GSDevLineHit
// 0x0018 (0x0060 - 0x0048)
class UAnimNotifyState_GSDevLineHit : public UAnimNotifyState_GSBase
{
public:
	ECollisionChannel                             CollisionChannel;                                  // 0x0048(0x0001)(BlueprintReadOnly, ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESweepCheckHitFilterType                      ResultFilterType;                                  // 0x0049(0x0001)(BlueprintReadOnly, ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HitVEffectID;                                      // 0x004C(0x0004)(BlueprintReadOnly, ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bHitFromActorLocation : 1;                         // 0x0050(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HitCheckRadius;                                    // 0x0054(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bRenderDebugShape : 1;                             // 0x0058(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (BlueprintReadOnly, Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotifyState_GSDevLineHit")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotifyState_GSDevLineHit")
	}
	static class UAnimNotifyState_GSDevLineHit* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_GSDevLineHit>();
	}
};
DUMPER7_ASSERTS_UAnimNotifyState_GSDevLineHit;

// Class b1.BGUDebugSectorComponent
// 0x0010 (0x0590 - 0x0580)
class UBGUDebugSectorComponent final : public UShapeComponent
{
public:
	float                                         SectorRadius;                                      // 0x0580(0x0004)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SectorMinAngle;                                    // 0x0584(0x0004)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SectorMaxAngle;                                    // 0x0588(0x0004)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SectorThickness;                                   // 0x058C(0x0004)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetSectorMaxAngle(float InMaxAngle);
	void SetSectorMinAngle(float InMinAngle);
	void SetSectorRadius(float InSectorRadius);

	float GetScaledSectorRadius() const;
	float GetShapeScale() const;
	float GetUnscaledSectorRadius() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BGUDebugSectorComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BGUDebugSectorComponent")
	}
	static class UBGUDebugSectorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBGUDebugSectorComponent>();
	}
};
DUMPER7_ASSERTS_UBGUDebugSectorComponent;

// Class b1.AnimNotifyState_GSEditorHelper
// 0x0000 (0x0048 - 0x0048)
class UAnimNotifyState_GSEditorHelper : public UAnimNotifyState_GSBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotifyState_GSEditorHelper")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotifyState_GSEditorHelper")
	}
	static class UAnimNotifyState_GSEditorHelper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_GSEditorHelper>();
	}
};
DUMPER7_ASSERTS_UAnimNotifyState_GSEditorHelper;

// Class b1.BUC_ACharacterComponent
// 0x0028 (0x0050 - 0x0028)
class UBUC_ACharacterComponent final : public UObject
{
public:
	class ACharacter*                             OwnerCharacter;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBGUCharacterMovementComponent*         OwnerMovement;                                     // 0x0030(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UShapeComponent*                        OwnerShapeComponent;                               // 0x0038(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 MainSkinMesh;                                      // 0x0040(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AController*                            OwnerController;                                   // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BUC_ACharacterComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BUC_ACharacterComponent")
	}
	static class UBUC_ACharacterComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBUC_ACharacterComponent>();
	}
};
DUMPER7_ASSERTS_UBUC_ACharacterComponent;

// Class b1.BGUEditorTickableActor
// 0x0018 (0x02A0 - 0x0288)
class ABGUEditorTickableActor final : public AActor
{
public:
	uint8                                         Pad_288[0x18];                                     // 0x0288(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FVector GetViewportCameraLocation();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BGUEditorTickableActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BGUEditorTickableActor")
	}
	static class ABGUEditorTickableActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABGUEditorTickableActor>();
	}
};
DUMPER7_ASSERTS_ABGUEditorTickableActor;

// Class b1.AnimNotifyState_GSHeadLock
// 0x0008 (0x0050 - 0x0048)
class UAnimNotifyState_GSHeadLock : public UAnimNotifyState_GSBase
{
public:
	float                                         ReduceHeadLockAlphaScale;                          // 0x0048(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotifyState_GSHeadLock")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotifyState_GSHeadLock")
	}
	static class UAnimNotifyState_GSHeadLock* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_GSHeadLock>();
	}
};
DUMPER7_ASSERTS_UAnimNotifyState_GSHeadLock;

// Class b1.BGUEQSObject
// 0x00D8 (0x0100 - 0x0028)
class UBGUEQSObject final : public UObject
{
public:
	class UEnvQuery*                              EnvQuery;                                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FEnvQueryRequest                       EvnQueryReq;                                       // 0x0030(0x0068)(NativeAccessSpecifierPrivate)
	class AActor*                                 QuerierObject;                                     // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<int32, struct FGSEQSExParam>             Req_ExParamMap;                                    // 0x00A0(0x0050)(NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void(const TArray<struct FVector>& Results, const TArray<float>& Scores, const struct FGSEQSExParam& ExParam, int32 QueryID)> FBUE_RunEQSFinish; // 0x00F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	int32 EQSObjRun(const class UEnvQuery* EnvQueryObj, class AActor* Querier, EBGURunEQSObjReason Reason, const struct FGSEQSExParam& _ExParam);
	void EQSObjRunInstant(const class UEnvQuery* EnvQueryObj, class AActor* Querier, TArray<struct FVector>* Locations, TArray<float>* Scores);
	void EQSObjRunInstantWithCustomParams(const class UEnvQuery* EnvQueryObj, class AActor* Querier, const TArray<struct FGSEnvNamedValue>& NamedParams, TArray<struct FVector>* Locations, TArray<float>* Scores);
	int32 EQSObjRunWithCustomParams(const class UEnvQuery* EnvQueryObj, class AActor* Querier, EBGURunEQSObjReason Reason, const TArray<struct FGSEnvNamedValue>& NamedParams);
	int32 EQSRun(const class FString& EQSPath, class AActor* Querier, EBGURunEQSObjReason Reason, const struct FGSEQSExParam& _ExParam);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BGUEQSObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BGUEQSObject")
	}
	static class UBGUEQSObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBGUEQSObject>();
	}
};
DUMPER7_ASSERTS_UBGUEQSObject;

// Class b1.AnimNotifyState_GSLockHandFoot
// 0x0008 (0x0050 - 0x0048)
class UAnimNotifyState_GSLockHandFoot : public UAnimNotifyState_GSBase
{
public:
	EBUHandFootType                               NeedLockType;                                      // 0x0048(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BeginReduceScale;                                  // 0x004C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotifyState_GSLockHandFoot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotifyState_GSLockHandFoot")
	}
	static class UAnimNotifyState_GSLockHandFoot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_GSLockHandFoot>();
	}
};
DUMPER7_ASSERTS_UAnimNotifyState_GSLockHandFoot;

// Class b1.BGUFluid2DComponent
// 0x0218 (0x02D8 - 0x00C0)
class UBGUFluid2DComponent : public UActorComponent
{
public:
	bool                                          toggleSim;                                         // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bPostProcessCollisionData;                         // 0x00C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          blueprintDrivenParameters;                         // 0x00C2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bMovedCheck;                                       // 0x00C3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          blocationCheck;                                    // 0x00C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bLocalSim;                                         // 0x00C5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHighQualitySim;                                   // 0x00C6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSimAreaClamp;                                     // 0x00C7(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         MaxIteration;                                      // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         SimulationResX;                                    // 0x00CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         SimulationResY;                                    // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SimAreaSizeInCM;                                   // 0x00D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   SnappedPosParameterName;                           // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialParameterCollection*           dynamicSDFMpc;                                     // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         worldOffsetThreshold;                              // 0x00E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         moveThreadhold;                                    // 0x00EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         edgeExtendSize;                                    // 0x00F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bExportVeloDensity;                                // 0x00F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bExportPressureDivergence;                         // 0x00F5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F6[0x2];                                       // 0x00F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 veloDensityOutput;                                 // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextureRenderTarget2D*                 pressureDivergenceOutput;                          // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                     CollisionQueryMaterial;                            // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                     PPCollisionQueryMaterial;                          // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                     CompositeMaterial;                                 // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                     AdvectMaterial;                                    // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                     DivergenceMaterial;                                // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                     PressureStep1Material;                             // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                     PressureStep2Material;                             // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BrushPuncture;                                     // 0x0140(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         VeloDirNoise;                                      // 0x0144(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Speed;                                             // 0x0148(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         VeloFromSimAreaMotion;                             // 0x014C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SimEdgeBouncyness;                                 // 0x0150(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FadeDensityAtSimEdge;                              // 0x0154(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         VeloDirNoiseSize;                                  // 0x0158(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         VeloDirNoiseSpeed;                                 // 0x015C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         VeloOffsetX;                                       // 0x0160(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         VeloOffsetY;                                       // 0x0164(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         VeloFromBrushMotion;                               // 0x0168(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         VeloStrength;                                      // 0x016C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         VeloRotate;                                        // 0x0170(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         VeloAmpNoise;                                      // 0x0174(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         InputFeedback;                                     // 0x0178(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FlowFeedback;                                      // 0x017C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Divergence;                                        // 0x0180(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BrushSize;                                         // 0x0184(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BrushStrength;                                     // 0x0188(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         EraserMode;                                        // 0x018C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BrushHardness;                                     // 0x0190(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             DensityTemplate;                                   // 0x0198(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTexture2D*                             VelocityTemplate;                                  // 0x01A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         VelocityOffsetSpeed;                               // 0x01A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         EdgeMaskWidth;                                     // 0x01AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DensityTxtMult;                                    // 0x01B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DensityTxtScale;                                   // 0x01B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DensityTxtOffsetX;                                 // 0x01B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DensityTxtOffsetY;                                 // 0x01BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BrushNoise;                                        // 0x01C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         VeloInputTile;                                     // 0x01C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DensityInputNoiseAmp;                              // 0x01C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DensityInputNoiseOffset;                           // 0x01CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DensityInputNoiseTile;                             // 0x01D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BrushRnd;                                          // 0x01D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         worldOffsetX;                                      // 0x01D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         worldOffsetY;                                      // 0x01DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1E0[0x90];                                     // 0x01E0(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 RT_CollisionResult;                                // 0x0270(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextureRenderTarget2D*                 RT_PPCollisionResult;                              // 0x0278(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextureRenderTarget2D*                 RT_Advection;                                      // 0x0280(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextureRenderTarget2D*                 RT_PressureDivergence;                             // 0x0288(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextureRenderTarget2D*                 RT_Composite;                                      // 0x0290(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextureRenderTarget2D*                 RT_PressureDivergenceTemp;                         // 0x0298(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInstanceDynamic*               CollisionQueryMaterialInstance;                    // 0x02A0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInstanceDynamic*               PPCollisionQueryMaterialInstance;                  // 0x02A8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInstanceDynamic*               CompositeMaterialInstance;                         // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInstanceDynamic*               AdvectMaterialInstance;                            // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInstanceDynamic*               DivergenceMaterialInstance;                        // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInstanceDynamic*               PressureStep1MaterialInstance;                     // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInstanceDynamic*               PressureStep2MaterialInstance;                     // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class UTextureRenderTarget2D* GetPressureDivergenceTexture();
	class UTextureRenderTarget2D* GetVeloDensityTexture();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BGUFluid2DComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BGUFluid2DComponent")
	}
	static class UBGUFluid2DComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBGUFluid2DComponent>();
	}
};
DUMPER7_ASSERTS_UBGUFluid2DComponent;

// Class b1.AnimNotifyState_GSNvFlow
// 0x0008 (0x0050 - 0x0048)
class UAnimNotifyState_GSNvFlow : public UAnimNotifyState_GSBase
{
public:
	bool                                          bFlowEmit;                                         // 0x0048(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFlowCollision;                                    // 0x0049(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CollisionIndex;                                    // 0x004C(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotifyState_GSNvFlow")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotifyState_GSNvFlow")
	}
	static class UAnimNotifyState_GSNvFlow* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_GSNvFlow>();
	}
};
DUMPER7_ASSERTS_UAnimNotifyState_GSNvFlow;

// Class b1.BGU_AIMover
// 0x0038 (0x0060 - 0x0028)
class UBGU_AIMover final : public UObject
{
public:
	TMulticastInlineDelegate<void(int32 RequestID, EPathFollowingResult Result)> FBUE_OnMoveComplete; // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class AController*                            OwnerCtrl;                                         // 0x0038(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPathFollowingComponent*                PathFollowingComponent;                            // 0x0040(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_48[0x18];                                      // 0x0048(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AbortMove();
	int32 GetRequestID();
	void Init(class AController* OwnerAICtrl);
	bool IsOutOfRange();
	bool IsRequestValid();
	void MoveTo(const struct FBGU_AIMoverRequest& request);
	void ResetRequest();

	EPathFollowingStatus GetMoveStatus() const;
	class UPathFollowingComponent* GetPathFollowingComponent() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BGU_AIMover")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BGU_AIMover")
	}
	static class UBGU_AIMover* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBGU_AIMover>();
	}
};
DUMPER7_ASSERTS_UBGU_AIMover;

// Class b1.BGUFuncLibData
// 0x0000 (0x0028 - 0x0028)
class UBGUFuncLibData final : public UBlueprintFunctionLibrary
{
public:
	static void BGUGetTagEnum(class AActor* Unit, const struct FGameplayTag& Tag, bool* IsValid, uint8* Out);
	static void BGUGetTagFloat(class AActor* Unit, const struct FGameplayTag& Tag, bool* IsValid, float* Out);
	static void BGUGetTagFloatByName(class AActor* Unit, const class FName& TagName, bool* IsValid, float* Out);
	static void BGUGetTagInt(class AActor* Unit, const struct FGameplayTag& Tag, bool* IsValid, int32* Out);
	static void BGUGetTagIntByName(class AActor* Unit, const class FName& TagName, bool* IsValid, int32* Out);
	static void BGUGetTagName(class AActor* Unit, const struct FGameplayTag& Tag, bool* IsValid, class FName* Out);
	static class UObject* BGUGetTagObject(class AActor* Unit, const struct FGameplayTag& Tag);
	static void BGUGetTagVector(class AActor* Unit, const struct FGameplayTag& Tag, bool* IsValid, struct FVector* Out);
	static void BGUSetTagEnum(class AActor* Unit, const struct FGameplayTag& Tag, uint8 Val);
	static void BGUSetTagFloat(class AActor* Unit, const struct FGameplayTag& Tag, float Val);
	static void BGUSetTagFloatByName(class AActor* Unit, const class FName& TagName, float Val);
	static void BGUSetTagInt(class AActor* Unit, const struct FGameplayTag& Tag, int32 Val);
	static void BGUSetTagIntByName(class AActor* Unit, const class FName& TagName, float Val);
	static void BGUSetTagName(class AActor* Unit, const struct FGameplayTag& Tag, const class FName& Val);
	static void BGUSetTagNameWithGameplayTag(class AActor* Unit, const struct FGameplayTag& Tag, const struct FGameplayTag& Val);
	static void BGUSetTagObject(class AActor* Unit, const struct FGameplayTag& Tag, class UObject* Val);
	static void BGUSetTagVector(class AActor* Unit, const struct FGameplayTag& Tag, const struct FVector& Val);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BGUFuncLibData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BGUFuncLibData")
	}
	static class UBGUFuncLibData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBGUFuncLibData>();
	}
};
DUMPER7_ASSERTS_UBGUFuncLibData;

// Class b1.AnimNotifyState_GSTimedParticleEffect
// 0x0018 (0x0090 - 0x0078)
class UAnimNotifyState_GSTimedParticleEffect : public UAnimNotifyState_TimedParticleEffect
{
public:
	EAttachLocation                               AttachRule;                                        // 0x0078(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FParticleSysParam>              InstanceParameters;                                // 0x0080(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotifyState_GSTimedParticleEffect")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotifyState_GSTimedParticleEffect")
	}
	static class UAnimNotifyState_GSTimedParticleEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_GSTimedParticleEffect>();
	}
};
DUMPER7_ASSERTS_UAnimNotifyState_GSTimedParticleEffect;

// Class b1.GSEQGBase_ProjectedPoint
// 0x00B8 (0x0108 - 0x0050)
class UGSEQGBase_ProjectedPoint : public UEnvQueryGenerator
{
public:
	struct FEnvTraceData                          ProjectionData;                                    // 0x0050(0x0040)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	class FText                                   GeneratorsActionDescription;                       // 0x0090(0x0018)(Edit, NativeAccessSpecifierPublic)
	TSubclassOf<class UEnvQueryContext>           Context;                                           // 0x00A8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        GenerateItemList;                                  // 0x00B0(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FEnvTraceData                          TraceData;                                         // 0x00C0(0x0040)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_100[0x8];                                      // 0x0100(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddGeneratedActor(class AActor* GeneratedActor) const;
	void AddGeneratedVector(const struct FVector& GeneratedVector) const;
	void DoItemGenerationCS(const TArray<struct FVector>& ContextLocations) const;
	class UObject* GetQuerier() const;
	TArray<struct FVector> ProjectAndFilterNavPointsInCS(const TArray<struct FVector>& Points) const;
	TArray<struct FVector> RunNavRaycastsInCS(const TArray<struct FVector>& Points, const struct FVector& SourcePt) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSEQGBase_ProjectedPoint")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSEQGBase_ProjectedPoint")
	}
	static class UGSEQGBase_ProjectedPoint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSEQGBase_ProjectedPoint>();
	}
};
DUMPER7_ASSERTS_UGSEQGBase_ProjectedPoint;

// Class b1.BGUFuncLibMove
// 0x0000 (0x0028 - 0x0028)
class UBGUFuncLibMove final : public UBlueprintFunctionLibrary
{
public:
	static void BGUMovementForceSaveBaseLocation(class UCharacterMovementComponent* MoveComp);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BGUFuncLibMove")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BGUFuncLibMove")
	}
	static class UBGUFuncLibMove* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBGUFuncLibMove>();
	}
};
DUMPER7_ASSERTS_UBGUFuncLibMove;

// Class b1.AnimNotifyState_GSTrail
// 0x0008 (0x0060 - 0x0058)
class UAnimNotifyState_GSTrail : public UAnimNotifyState_Trail
{
public:
	uint8                                         bIsNeedPauseWithOwner : 1;                         // 0x0058(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotifyState_GSTrail")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotifyState_GSTrail")
	}
	static class UAnimNotifyState_GSTrail* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_GSTrail>();
	}
};
DUMPER7_ASSERTS_UAnimNotifyState_GSTrail;

// Class b1.BGUFuncLibAI
// 0x0000 (0x0028 - 0x0028)
class UBGUFuncLibAI final : public UBlueprintFunctionLibrary
{
public:
	static float BGUAICaculateTargetAngle(class AActor* Target, class AActor* MySelf);
	static bool BGUIsAIRequestActive(class AActor* Unit, int32 RequestID);
	static int32 BGURequestAITurnTo(class AActor* Unit, const struct FVector& position);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BGUFuncLibAI")
	}
	static const class FName& StaticName()
	{
