#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: b1_Managed

#include "Basic.hpp"

#include "b1_structs.hpp"
#include "b1_Managed_structs.hpp"
#include "Calliope_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GSInput_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Slate_structs.hpp"
#include "DonAINavigation_structs.hpp"
#include "AIModule_structs.hpp"
#include "GSE_ProtobufDB_structs.hpp"
#include "UnrealExtent_structs.hpp"


namespace SDK::Params
{

// Function b1-Managed.BANS_GSBase.GSNotifyDebugPostBeginCS
// 0x0050 (0x0050 - 0x0000)
struct BANS_GSBase_GSNotifyDebugPostBeginCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0048)(Parm, NoDestructor)
	int32                                         ReturnValue;                                       // 0x0048(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BANS_GSBase_GSNotifyDebugPostBeginCS;

// Function b1-Managed.BANS_GSBase.GSNotifyDebugPreBeginCS
// 0x0050 (0x0050 - 0x0000)
struct BANS_GSBase_GSNotifyDebugPreBeginCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0048)(Parm, NoDestructor)
	int32                                         ReturnValue;                                       // 0x0048(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BANS_GSBase_GSNotifyDebugPreBeginCS;

// Function b1-Managed.BANS_GSBase.GSNotifyDebugPostTickCS
// 0x0050 (0x0050 - 0x0000)
struct BANS_GSBase_GSNotifyDebugPostTickCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0048)(Parm, NoDestructor)
	int32                                         ReturnValue;                                       // 0x0048(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BANS_GSBase_GSNotifyDebugPostTickCS;

// Function b1-Managed.BANS_GSBase.GSNotifyDebugPreTickCS
// 0x0050 (0x0050 - 0x0000)
struct BANS_GSBase_GSNotifyDebugPreTickCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0048)(Parm, NoDestructor)
	int32                                         ReturnValue;                                       // 0x0048(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BANS_GSBase_GSNotifyDebugPreTickCS;

// Function b1-Managed.BANS_GSBase.GSNotifyDebugPostEndCS
// 0x0050 (0x0050 - 0x0000)
struct BANS_GSBase_GSNotifyDebugPostEndCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0048)(Parm, NoDestructor)
	int32                                         ReturnValue;                                       // 0x0048(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BANS_GSBase_GSNotifyDebugPostEndCS;

// Function b1-Managed.BANS_GSBase.GSNotifyDebugPreEndCS
// 0x0050 (0x0050 - 0x0000)
struct BANS_GSBase_GSNotifyDebugPreEndCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0048)(Parm, NoDestructor)
	int32                                         ReturnValue;                                       // 0x0048(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BANS_GSBase_GSNotifyDebugPreEndCS;

// Function b1-Managed.BANS_GSBase.GetSoftReferences
// 0x0010 (0x0010 - 0x0000)
struct BANS_GSBase_GetSoftReferences final
{
public:
	TArray<struct FSoftObjectPath>                ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_BANS_GSBase_GetSoftReferences;

// Function b1-Managed.BANS_GSBase.GSValidateInputCS
// 0x0008 (0x0008 - 0x0000)
struct BANS_GSBase_GSValidateInputCS final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BANS_GSBase_GSValidateInputCS;

// Function b1-Managed.BANS_GSTimedPlayNiagaraFX.GetSoftReferences
// 0x0010 (0x0010 - 0x0000)
struct BANS_GSTimedPlayNiagaraFX_GetSoftReferences final
{
public:
	TArray<struct FSoftObjectPath>                ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_BANS_GSTimedPlayNiagaraFX_GetSoftReferences;

// Function b1-Managed.BANS_GSTimedPlayNiagaraFX.GSNotifyBeginCS
// 0x0050 (0x0050 - 0x0000)
struct BANS_GSTimedPlayNiagaraFX_GSNotifyBeginCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0048)(Parm, NoDestructor)
	float                                         TotalDuration;                                     // 0x0048(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BANS_GSTimedPlayNiagaraFX_GSNotifyBeginCS;

// Function b1-Managed.BANS_GSTimedPlayNiagaraFX.GSNotifyEndCS
// 0x0048 (0x0048 - 0x0000)
struct BANS_GSTimedPlayNiagaraFX_GSNotifyEndCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0048)(Parm, NoDestructor)
};
DUMPER7_ASSERTS_BANS_GSTimedPlayNiagaraFX_GSNotifyEndCS;

// Function b1-Managed.BANS_GSTimedPlayNiagaraFX_WithCondition.GSNotifyBeginCS
// 0x0050 (0x0050 - 0x0000)
struct BANS_GSTimedPlayNiagaraFX_WithCondition_GSNotifyBeginCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0048)(Parm, NoDestructor)
	float                                         TotalDuration;                                     // 0x0048(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BANS_GSTimedPlayNiagaraFX_WithCondition_GSNotifyBeginCS;

// Function b1-Managed.BANS_GSTimedPlayNiagaraFX_WithCondition.GSNotifyEndCS
// 0x0048 (0x0048 - 0x0000)
struct BANS_GSTimedPlayNiagaraFX_WithCondition_GSNotifyEndCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0048)(Parm, NoDestructor)
};
DUMPER7_ASSERTS_BANS_GSTimedPlayNiagaraFX_WithCondition_GSNotifyEndCS;

// Function b1-Managed.BED_CalliopeNodeBae.GetBranchGraphToEditInCS
// 0x0018 (0x0018 - 0x0000)
struct BED_CalliopeNodeBae_GetBranchGraphToEditInCS final
{
public:
	class FString                                 OutBranchGraphIdentifier;                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	uint8                                         ReturnValue : 1;                                   // 0x0010(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
DUMPER7_ASSERTS_BED_CalliopeNodeBae_GetBranchGraphToEditInCS;

// Function b1-Managed.BED_CalliopeNodeBae.IsSupportViewType
// 0x0002 (0x0002 - 0x0000)
struct BED_CalliopeNodeBae_IsSupportViewType final
{
public:
	ECalliopeViewType                             InViewType;                                        // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         ReturnValue : 1;                                   // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
DUMPER7_ASSERTS_BED_CalliopeNodeBae_IsSupportViewType;

// Function b1-Managed.BED_CalliopeNodeBae.IsBranchGraphNode
// 0x0001 (0x0001 - 0x0000)
struct BED_CalliopeNodeBae_IsBranchGraphNode final
{
public:
	uint8                                         ReturnValue : 1;                                   // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
DUMPER7_ASSERTS_BED_CalliopeNodeBae_IsBranchGraphNode;

// Function b1-Managed.BED_CalliopeNodeBae.IsRerouteNode
// 0x0001 (0x0001 - 0x0000)
struct BED_CalliopeNodeBae_IsRerouteNode final
{
public:
	uint8                                         ReturnValue : 1;                                   // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
DUMPER7_ASSERTS_BED_CalliopeNodeBae_IsRerouteNode;

// Function b1-Managed.BED_CalliopeNodeBae.GetGuid
// 0x0010 (0x0010 - 0x0000)
struct BED_CalliopeNodeBae_GetGuid final
{
public:
	struct FCalliopeGuid                          ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BED_CalliopeNodeBae_GetGuid;

// Function b1-Managed.BED_CalliopeNodeBae.GetActorGuidOptions
// 0x0028 (0x0028 - 0x0000)
struct BED_CalliopeNodeBae_GetActorGuidOptions final
{
public:
	class FString                                 PropertyName;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FActorGuidOption>               OutOptions;                                        // 0x0010(0x0010)(Parm, OutParm)
	int32                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BED_CalliopeNodeBae_GetActorGuidOptions;

// Function b1-Managed.BED_CalliopeNodeBae.CanManageStates
// 0x0001 (0x0001 - 0x0000)
struct BED_CalliopeNodeBae_CanManageStates final
{
public:
	uint8                                         ReturnValue : 1;                                   // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
DUMPER7_ASSERTS_BED_CalliopeNodeBae_CanManageStates;

// Function b1-Managed.BED_CalliopeNodeBae.GetActorGuid
// 0x0020 (0x0020 - 0x0000)
struct BED_CalliopeNodeBae_GetActorGuid final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 OutActorGuid;                                      // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	uint8                                         ReturnValue : 1;                                   // 0x0018(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
DUMPER7_ASSERTS_BED_CalliopeNodeBae_GetActorGuid;

// Function b1-Managed.BED_ProcessNode.IsSupportViewType
// 0x0002 (0x0002 - 0x0000)
struct BED_ProcessNode_IsSupportViewType final
{
public:
	ECalliopeViewType                             InViewType;                                        // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         ReturnValue : 1;                                   // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
DUMPER7_ASSERTS_BED_ProcessNode_IsSupportViewType;

// Function b1-Managed.BED_ProcessMachineNode_NPCState.GetBranchGraphToEditInCS
// 0x0018 (0x0018 - 0x0000)
struct BED_ProcessMachineNode_NPCState_GetBranchGraphToEditInCS final
{
public:
	class FString                                 OutBranchGraphIdentifier;                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	uint8                                         ReturnValue : 1;                                   // 0x0010(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
DUMPER7_ASSERTS_BED_ProcessMachineNode_NPCState_GetBranchGraphToEditInCS;

// Function b1-Managed.BED_ProcessMachineNode_NPCState.GetContextOutputsInCS
// 0x0010 (0x0010 - 0x0000)
struct BED_ProcessMachineNode_NPCState_GetContextOutputsInCS final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_BED_ProcessMachineNode_NPCState_GetContextOutputsInCS;

// Function b1-Managed.BED_ProcessMachineNode_NPCState.PostPropertyChanged
// 0x0020 (0x0020 - 0x0000)
struct BED_ProcessMachineNode_NPCState_PostPropertyChanged final
{
public:
	class FString                                 MemberName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 PropertyName;                                      // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BED_ProcessMachineNode_NPCState_PostPropertyChanged;

// Function b1-Managed.BED_ProcessMachineNode_NPCState.GetNodeDescriptionInCS
// 0x0010 (0x0010 - 0x0000)
struct BED_ProcessMachineNode_NPCState_GetNodeDescriptionInCS final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BED_ProcessMachineNode_NPCState_GetNodeDescriptionInCS;

// Function b1-Managed.DispLib_DBCSimpleMaterialQualityManager.TickComponentInCS
// 0x0004 (0x0004 - 0x0000)
struct DispLib_DBCSimpleMaterialQualityManager_TickComponentInCS final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_DispLib_DBCSimpleMaterialQualityManager_TickComponentInCS;

// Function b1-Managed.BED_FSMNode.IsSupportViewType
// 0x0002 (0x0002 - 0x0000)
struct BED_FSMNode_IsSupportViewType final
{
public:
	ECalliopeViewType                             InViewType;                                        // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         ReturnValue : 1;                                   // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
DUMPER7_ASSERTS_BED_FSMNode_IsSupportViewType;

// Function b1-Managed.BED_FSMNode_Condition_GI_Loading_IsNeedOpenLoadingScreen.GetNodeDescriptionInCS
// 0x0010 (0x0010 - 0x0000)
struct BED_FSMNode_Condition_GI_Loading_IsNeedOpenLoadingScreen_GetNodeDescriptionInCS final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BED_FSMNode_Condition_GI_Loading_IsNeedOpenLoadingScreen_GetNodeDescriptionInCS;

// Function b1-Managed.BED_BehaviorNode.IsSupportViewType
// 0x0002 (0x0002 - 0x0000)
struct BED_BehaviorNode_IsSupportViewType final
{
public:
	ECalliopeViewType                             InViewType;                                        // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         ReturnValue : 1;                                   // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
DUMPER7_ASSERTS_BED_BehaviorNode_IsSupportViewType;

// Function b1-Managed.BED_BehaviorNode_DetectUnit.GetNodeDescriptionInCS
// 0x0010 (0x0010 - 0x0000)
struct BED_BehaviorNode_DetectUnit_GetNodeDescriptionInCS final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BED_BehaviorNode_DetectUnit_GetNodeDescriptionInCS;

// Function b1-Managed.BED_BehaviorNode_DetectUnit.IsSupportViewType
// 0x0002 (0x0002 - 0x0000)
struct BED_BehaviorNode_DetectUnit_IsSupportViewType final
{
public:
	ECalliopeViewType                             InViewType;                                        // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         ReturnValue : 1;                                   // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
DUMPER7_ASSERTS_BED_BehaviorNode_DetectUnit_IsSupportViewType;

// Function b1-Managed.BED_FSMNode_GI_LoadingAnyState.PostPropertyChanged
// 0x0020 (0x0020 - 0x0000)
struct BED_FSMNode_GI_LoadingAnyState_PostPropertyChanged final
{
public:
	class FString                                 MemberName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 PropertyName;                                      // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BED_FSMNode_GI_LoadingAnyState_PostPropertyChanged;

// Function b1-Managed.GSDispLib_PostProcessActor.OnAlreadyFinish
// 0x0008 (0x0008 - 0x0000)
struct GSDispLib_PostProcessActor_OnAlreadyFinish final
{
public:
	class UGSDispLib_PostProcessContext*          Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GSDispLib_PostProcessActor_OnAlreadyFinish;

// Function b1-Managed.GSDispLib_PostProcessActor.OnAlreadyBegin
// 0x0008 (0x0008 - 0x0000)
struct GSDispLib_PostProcessActor_OnAlreadyBegin final
{
public:
	class UGSDispLib_PostProcessContext*          Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GSDispLib_PostProcessActor_OnAlreadyBegin;

// Function b1-Managed.GSDispLib_PostProcessActor.OnEnterFinish
// 0x0008 (0x0008 - 0x0000)
struct GSDispLib_PostProcessActor_OnEnterFinish final
{
public:
	class UGSDispLib_PostProcessContext*          Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GSDispLib_PostProcessActor_OnEnterFinish;

// Function b1-Managed.GSDispLib_PostProcessActor.OnEnterBegin
// 0x0008 (0x0008 - 0x0000)
struct GSDispLib_PostProcessActor_OnEnterBegin final
{
public:
	class UGSDispLib_PostProcessContext*          Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GSDispLib_PostProcessActor_OnEnterBegin;

// Function b1-Managed.GSDispLib_PostProcessActor.OnEffectTick
// 0x0010 (0x0010 - 0x0000)
struct GSDispLib_PostProcessActor_OnEffectTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Progress_0;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGSDispLib_PostProcessContext*          Context;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GSDispLib_PostProcessActor_OnEffectTick;

// Function b1-Managed.GSDispLib_PostProcessActor.OnEndFinish
// 0x0008 (0x0008 - 0x0000)
struct GSDispLib_PostProcessActor_OnEndFinish final
{
public:
	class UGSDispLib_PostProcessContext*          Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GSDispLib_PostProcessActor_OnEndFinish;

// Function b1-Managed.GSDispLib_PostProcessActor.OnEndBegin
// 0x0008 (0x0008 - 0x0000)
struct GSDispLib_PostProcessActor_OnEndBegin final
{
public:
	class UGSDispLib_PostProcessContext*          Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GSDispLib_PostProcessActor_OnEndBegin;

// Function b1-Managed.GSDispLib_PostProcessActor.OnInit
// 0x0038 (0x0038 - 0x0000)
struct GSDispLib_PostProcessActor_OnInit final
{
public:
	class UGSDispLib_PostProcessContext*          Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUDispLib_PostPorcessCommonConf        Conf;                                              // 0x0008(0x0030)(Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GSDispLib_PostProcessActor_OnInit;

// Function b1-Managed.GSDispLib_PP_VaFogOfWar.OnAlreadyBegin
// 0x0008 (0x0008 - 0x0000)
struct GSDispLib_PP_VaFogOfWar_OnAlreadyBegin final
{
public:
	class UGSDispLib_PostProcessContext*          Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GSDispLib_PP_VaFogOfWar_OnAlreadyBegin;

// Function b1-Managed.GSDispLib_PP_VaFogOfWar.OnEnterFinish
// 0x0008 (0x0008 - 0x0000)
struct GSDispLib_PP_VaFogOfWar_OnEnterFinish final
{
public:
	class UGSDispLib_PostProcessContext*          Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GSDispLib_PP_VaFogOfWar_OnEnterFinish;

// Function b1-Managed.GSDispLib_PP_VaFogOfWar.OnEnterBegin
// 0x0008 (0x0008 - 0x0000)
struct GSDispLib_PP_VaFogOfWar_OnEnterBegin final
{
public:
	class UGSDispLib_PostProcessContext*          Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GSDispLib_PP_VaFogOfWar_OnEnterBegin;

// Function b1-Managed.GSDispLib_PP_VaFogOfWar.OnEffectTick
// 0x0010 (0x0010 - 0x0000)
struct GSDispLib_PP_VaFogOfWar_OnEffectTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Progress_0;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGSDispLib_PostProcessContext*          Context;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GSDispLib_PP_VaFogOfWar_OnEffectTick;

// Function b1-Managed.GSDispLib_PP_VaFogOfWar.OnEndFinish
// 0x0008 (0x0008 - 0x0000)
struct GSDispLib_PP_VaFogOfWar_OnEndFinish final
{
public:
	class UGSDispLib_PostProcessContext*          Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GSDispLib_PP_VaFogOfWar_OnEndFinish;

// Function b1-Managed.GSDispLib_PP_VaFogOfWar.OnEndBegin
// 0x0008 (0x0008 - 0x0000)
struct GSDispLib_PP_VaFogOfWar_OnEndBegin final
{
public:
	class UGSDispLib_PostProcessContext*          Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GSDispLib_PP_VaFogOfWar_OnEndBegin;

// Function b1-Managed.GSDispLib_PP_VaFogOfWar.OnInit
// 0x0038 (0x0038 - 0x0000)
struct GSDispLib_PP_VaFogOfWar_OnInit final
{
public:
	class UGSDispLib_PostProcessContext*          Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUDispLib_PostPorcessCommonConf        Conf;                                              // 0x0008(0x0030)(Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GSDispLib_PP_VaFogOfWar_OnInit;

// Function b1-Managed.HelloUFromUSharp.CallMe
// 0x0010 (0x0010 - 0x0000)
struct HelloUFromUSharp_CallMe final
{
public:
	class FString                                 Arg1;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_HelloUFromUSharp_CallMe;

// Function b1-Managed.BED_ProcessStateNode.IsBranchGraphNode
// 0x0001 (0x0001 - 0x0000)
struct BED_ProcessStateNode_IsBranchGraphNode final
{
public:
	uint8                                         ReturnValue : 1;                                   // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
DUMPER7_ASSERTS_BED_ProcessStateNode_IsBranchGraphNode;

// Function b1-Managed.OldMKSpawnTest.SpawnActorCS
// 0x0010 (0x0010 - 0x0000)
struct OldMKSpawnTest_SpawnActorCS final
{
public:
	class UClass*                                 ActorClass;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_OldMKSpawnTest_SpawnActorCS;

// Function b1-Managed.BED_FSMNode_Condition_GI_Loading_IsInStartUpLevel.GetNodeDescriptionInCS
// 0x0010 (0x0010 - 0x0000)
struct BED_FSMNode_Condition_GI_Loading_IsInStartUpLevel_GetNodeDescriptionInCS final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BED_FSMNode_Condition_GI_Loading_IsInStartUpLevel_GetNodeDescriptionInCS;

// Function b1-Managed.BED_FSMNode_Condition_GI_Loading_DetermineTravelLevelByHandlingArchive.GetNodeDescriptionInCS
// 0x0010 (0x0010 - 0x0000)
struct BED_FSMNode_Condition_GI_Loading_DetermineTravelLevelByHandlingArchive_GetNodeDescriptionInCS final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BED_FSMNode_Condition_GI_Loading_DetermineTravelLevelByHandlingArchive_GetNodeDescriptionInCS;

// Function b1-Managed.BED_FSMNode_SubGraph.PostPropertyChanged
// 0x0020 (0x0020 - 0x0000)
struct BED_FSMNode_SubGraph_PostPropertyChanged final
{
public:
	class FString                                 MemberName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 PropertyName;                                      // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BED_FSMNode_SubGraph_PostPropertyChanged;

// Function b1-Managed.BED_FSMNode_SubGraph.PrePropertyChanged
// 0x0010 (0x0010 - 0x0000)
struct BED_FSMNode_SubGraph_PrePropertyChanged final
{
public:
	class FString                                 PropertyName;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BED_FSMNode_SubGraph_PrePropertyChanged;

// Function b1-Managed.BED_FSMNode_SubGraph.GetAssetToEditInCS
// 0x0008 (0x0008 - 0x0000)
struct BED_FSMNode_SubGraph_GetAssetToEditInCS final
{
public:
	class UObject*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BED_FSMNode_SubGraph_GetAssetToEditInCS;

// Function b1-Managed.BED_FSMNode_SubGraph.GetNodeDescriptionInCS
// 0x0010 (0x0010 - 0x0000)
struct BED_FSMNode_SubGraph_GetNodeDescriptionInCS final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BED_FSMNode_SubGraph_GetNodeDescriptionInCS;

// Function b1-Managed.BED_FSMNode_GI_Global_SubG_GI_Loading_PostWXLoginFinish.GetNodeDescriptionInCS
// 0x0010 (0x0010 - 0x0000)
struct BED_FSMNode_GI_Global_SubG_GI_Loading_PostWXLoginFinish_GetNodeDescriptionInCS final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BED_FSMNode_GI_Global_SubG_GI_Loading_PostWXLoginFinish_GetNodeDescriptionInCS;

// Function b1-Managed.BED_QuestNode.IsSupportViewType
// 0x0002 (0x0002 - 0x0000)
struct BED_QuestNode_IsSupportViewType final
{
public:
	ECalliopeViewType                             InViewType;                                        // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         ReturnValue : 1;                                   // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
DUMPER7_ASSERTS_BED_QuestNode_IsSupportViewType;

// Function b1-Managed.BED_QuestNode_PlayerUseItem.GetNodeDescriptionInCS
// 0x0010 (0x0010 - 0x0000)
struct BED_QuestNode_PlayerUseItem_GetNodeDescriptionInCS final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BED_QuestNode_PlayerUseItem_GetNodeDescriptionInCS;

// Function b1-Managed.BANS_DispLibTimedModifyMPC.GSNotifyBeginCS
// 0x0050 (0x0050 - 0x0000)
struct BANS_DispLibTimedModifyMPC_GSNotifyBeginCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0048)(Parm, NoDestructor)
	float                                         TotalDuration;                                     // 0x0048(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BANS_DispLibTimedModifyMPC_GSNotifyBeginCS;

// Function b1-Managed.BANS_DispLibTimedModifyMPC.GSNotifyEndCS
// 0x0048 (0x0048 - 0x0000)
struct BANS_DispLibTimedModifyMPC_GSNotifyEndCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0048)(Parm, NoDestructor)
};
DUMPER7_ASSERTS_BANS_DispLibTimedModifyMPC_GSNotifyEndCS;

// Function b1-Managed.BED_FSMNode_Condition_GI_Loading_IsStandAlone.GetNodeDescriptionInCS
// 0x0010 (0x0010 - 0x0000)
struct BED_FSMNode_Condition_GI_Loading_IsStandAlone_GetNodeDescriptionInCS final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BED_FSMNode_Condition_GI_Loading_IsStandAlone_GetNodeDescriptionInCS;

// Function b1-Managed.BED_FSMNode_Condition_GI_Loading_BattleLevelTravelNeedWaitCameraBlend.GetNodeDescriptionInCS
// 0x0010 (0x0010 - 0x0000)
struct BED_FSMNode_Condition_GI_Loading_BattleLevelTravelNeedWaitCameraBlend_GetNodeDescriptionInCS final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BED_FSMNode_Condition_GI_Loading_BattleLevelTravelNeedWaitCameraBlend_GetNodeDescriptionInCS;

// Function b1-Managed.BAN_GSBase.GSPostNotifyDebugCS
// 0x0050 (0x0050 - 0x0000)
struct BAN_GSBase_GSPostNotifyDebugCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0048)(Parm, NoDestructor)
	int32                                         ReturnValue;                                       // 0x0048(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BAN_GSBase_GSPostNotifyDebugCS;

// Function b1-Managed.BAN_GSBase.GSPreNotifyDebugCS
// 0x0050 (0x0050 - 0x0000)
struct BAN_GSBase_GSPreNotifyDebugCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0048)(Parm, NoDestructor)
	int32                                         ReturnValue;                                       // 0x0048(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BAN_GSBase_GSPreNotifyDebugCS;

// Function b1-Managed.BAN_GSBase.GetSoftReferences
// 0x0010 (0x0010 - 0x0000)
struct BAN_GSBase_GetSoftReferences final
{
public:
	TArray<struct FSoftObjectPath>                ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_BAN_GSBase_GetSoftReferences;

// Function b1-Managed.BAN_GSBase.GSValidateInputCS
// 0x0008 (0x0008 - 0x0000)
struct BAN_GSBase_GSValidateInputCS final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BAN_GSBase_GSValidateInputCS;

// Function b1-Managed.BAN_GSPlayNiagaraFX.GetSoftReferences
// 0x0010 (0x0010 - 0x0000)
struct BAN_GSPlayNiagaraFX_GetSoftReferences final
{
public:
	TArray<struct FSoftObjectPath>                ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_BAN_GSPlayNiagaraFX_GetSoftReferences;

// Function b1-Managed.BAN_GSPlayNiagaraFX.GetAnimNType
// 0x0001 (0x0001 - 0x0000)
struct BAN_GSPlayNiagaraFX_GetAnimNType final
{
public:
	EGsEnAnimN                                    ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BAN_GSPlayNiagaraFX_GetAnimNType;

// Function b1-Managed.BAN_GSPlayNiagaraFX.GSNotifyCS
// 0x0048 (0x0048 - 0x0000)
struct BAN_GSPlayNiagaraFX_GSNotifyCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0048)(Parm, NoDestructor)
};
DUMPER7_ASSERTS_BAN_GSPlayNiagaraFX_GSNotifyCS;

// Function b1-Managed.BAN_GSPlayNiagaraFX_WithCondition.GSNotifyCS
// 0x0048 (0x0048 - 0x0000)
struct BAN_GSPlayNiagaraFX_WithCondition_GSNotifyCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0048)(Parm, NoDestructor)
};
DUMPER7_ASSERTS_BAN_GSPlayNiagaraFX_WithCondition_GSNotifyCS;

// Function b1-Managed.BANS_DispLibTimedModifyMaterial.GSNotifyBeginCS
// 0x0050 (0x0050 - 0x0000)
struct BANS_DispLibTimedModifyMaterial_GSNotifyBeginCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0048)(Parm, NoDestructor)
	float                                         TotalDuration;                                     // 0x0048(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BANS_DispLibTimedModifyMaterial_GSNotifyBeginCS;

// Function b1-Managed.BANS_DispLibTimedModifyMaterial.GSNotifyEndCS
// 0x0048 (0x0048 - 0x0000)
struct BANS_DispLibTimedModifyMaterial_GSNotifyEndCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0048)(Parm, NoDestructor)
};
DUMPER7_ASSERTS_BANS_DispLibTimedModifyMaterial_GSNotifyEndCS;

// Function b1-Managed.GSEventCollectionBase.EndPlayInCS
// 0x0001 (0x0001 - 0x0000)
struct GSEventCollectionBase_EndPlayInCS final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GSEventCollectionBase_EndPlayInCS;

// Function b1-Managed.BAN_SpawnLightningFXActor_MultiSockets.GSNotifyCS
// 0x0048 (0x0048 - 0x0000)
struct BAN_SpawnLightningFXActor_MultiSockets_GSNotifyCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0048)(Parm, NoDestructor)
};
DUMPER7_ASSERTS_BAN_SpawnLightningFXActor_MultiSockets_GSNotifyCS;

// Function b1-Managed.BED_FSMNode_GI_Loading_WaitImportantAssetLoadFinsh.PostPropertyChanged
// 0x0020 (0x0020 - 0x0000)
struct BED_FSMNode_GI_Loading_WaitImportantAssetLoadFinsh_PostPropertyChanged final
{
public:
	class FString                                 MemberName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 PropertyName;                                      // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BED_FSMNode_GI_Loading_WaitImportantAssetLoadFinsh_PostPropertyChanged;

// Function b1-Managed.BED_FSMNode_GI_Loading_WaitImportantAssetLoadFinsh.GetNodeDescriptionInCS
// 0x0010 (0x0010 - 0x0000)
struct BED_FSMNode_GI_Loading_WaitImportantAssetLoadFinsh_GetNodeDescriptionInCS final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BED_FSMNode_GI_Loading_WaitImportantAssetLoadFinsh_GetNodeDescriptionInCS;

// Function b1-Managed.BED_ComboNode.IsSupportViewType
// 0x0002 (0x0002 - 0x0000)
struct BED_ComboNode_IsSupportViewType final
{
public:
	ECalliopeViewType                             InViewType;                                        // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         ReturnValue : 1;                                   // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
DUMPER7_ASSERTS_BED_ComboNode_IsSupportViewType;

// Function b1-Managed.BED_ComboNode_State.GetContextOutputsInCS
// 0x0010 (0x0010 - 0x0000)
struct BED_ComboNode_State_GetContextOutputsInCS final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_BED_ComboNode_State_GetContextOutputsInCS;

// Function b1-Managed.BED_ComboNode_State.PostPropertyChanged
// 0x0020 (0x0020 - 0x0000)
struct BED_ComboNode_State_PostPropertyChanged final
{
public:
	class FString                                 MemberName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 PropertyName;                                      // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BED_ComboNode_State_PostPropertyChanged;

// Function b1-Managed.BED_FSMNode_Condition_GI_Loading_HasArchive.GetNodeDescriptionInCS
// 0x0010 (0x0010 - 0x0000)
struct BED_FSMNode_Condition_GI_Loading_HasArchive_GetNodeDescriptionInCS final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BED_FSMNode_Condition_GI_Loading_HasArchive_GetNodeDescriptionInCS;

// Function b1-Managed.BED_TaskStageNode.IsSupportViewType
// 0x0002 (0x0002 - 0x0000)
struct BED_TaskStageNode_IsSupportViewType final
{
public:
	ECalliopeViewType                             InViewType;                                        // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         ReturnValue : 1;                                   // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
DUMPER7_ASSERTS_BED_TaskStageNode_IsSupportViewType;

// Function b1-Managed.DispLib_EditorNiagaraReviewToolFuncLib.CheckProjectileUseUnrealNiagaraCompWithLowNiagaraAsset
// 0x0028 (0x0028 - 0x0000)
struct DispLib_EditorNiagaraReviewToolFuncLib_CheckProjectileUseUnrealNiagaraCompWithLowNiagaraAsset final
{
public:
	class FString                                 ProjectileAssetPath;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 NiagaraAssetPath;                                  // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
	uint8                                         ReturnValue : 1;                                   // 0x0020(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
DUMPER7_ASSERTS_DispLib_EditorNiagaraReviewToolFuncLib_CheckProjectileUseUnrealNiagaraCompWithLowNiagaraAsset;

// Function b1-Managed.DispLib_EditorNiagaraReviewToolFuncLib.GetPythonParam_NiagaraPathArrayFromNiagaraRefDCList
// 0x0020 (0x0020 - 0x0000)
struct DispLib_EditorNiagaraReviewToolFuncLib_GetPythonParam_NiagaraPathArrayFromNiagaraRefDCList final
{
public:
	TArray<struct FNiagaraRefByUnitDescription_Collection> NiagaraRefDCList;                         // 0x0000(0x0010)(Parm)
	TArray<class FString>                         ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_DispLib_EditorNiagaraReviewToolFuncLib_GetPythonParam_NiagaraPathArrayFromNiagaraRefDCList;

// Function b1-Managed.DispLib_EditorNiagaraReviewToolFuncLib.GetUnitAllSkillAnimAssetPathByResID
// 0x0018 (0x0018 - 0x0000)
struct DispLib_EditorNiagaraReviewToolFuncLib_GetUnitAllSkillAnimAssetPathByResID final
{
public:
	int32                                         ResID;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_DispLib_EditorNiagaraReviewToolFuncLib_GetUnitAllSkillAnimAssetPathByResID;

// Function b1-Managed.DispLib_EditorNiagaraReviewToolFuncLib.GetAllUnitsUsedAllNiagaraSystemPath
// 0x0028 (0x0028 - 0x0000)
struct DispLib_EditorNiagaraReviewToolFuncLib_GetAllUnitsUsedAllNiagaraSystemPath final
{
public:
	class UObject*                                Outer_0;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         AllUnitTamerAssetPath;                             // 0x0008(0x0010)(Parm)
	TArray<struct FNiagaraRefByUnitDescription_Collection> ReturnValue;                              // 0x0018(0x0010)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_DispLib_EditorNiagaraReviewToolFuncLib_GetAllUnitsUsedAllNiagaraSystemPath;

// Function b1-Managed.DispLib_EditorNiagaraReviewToolFuncLib.GetEditorNiagaraReviewToolConfig
// 0x0060 (0x0060 - 0x0000)
struct DispLib_EditorNiagaraReviewToolFuncLib_GetEditorNiagaraReviewToolConfig final
{
public:
	class FString                                 ConfigTxtPath;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FEditorNiagaraReviewToolConfig         ReturnValue;                                       // 0x0010(0x0050)(Parm, OutParm, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_DispLib_EditorNiagaraReviewToolFuncLib_GetEditorNiagaraReviewToolConfig;

// Function b1-Managed.DispLib_EditorNiagaraReviewToolFuncLib.GetUnitUsedAllNiagaraSystemPath
// 0x0028 (0x0028 - 0x0000)
struct DispLib_EditorNiagaraReviewToolFuncLib_GetUnitUsedAllNiagaraSystemPath final
{
public:
	class UObject*                                Outer_0;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 UnitTamerAssetPath;                                // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FNiagaraRefByUnitDescription_Collection> ReturnValue;                              // 0x0018(0x0010)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_DispLib_EditorNiagaraReviewToolFuncLib_GetUnitUsedAllNiagaraSystemPath;

// Function b1-Managed.DispLib_EditorNiagaraReviewToolFuncLib.GetNiagaraExpectedLowAssetPath
// 0x0020 (0x0020 - 0x0000)
struct DispLib_EditorNiagaraReviewToolFuncLib_GetNiagaraExpectedLowAssetPath final
{
public:
	class FString                                 NiagaraAssetPath;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_DispLib_EditorNiagaraReviewToolFuncLib_GetNiagaraExpectedLowAssetPath;

// Function b1-Managed.DispLib_EditorNiagaraReviewToolFuncLib.GetPythonReturnLogIndexCount
// 0x0018 (0x0018 - 0x0000)
struct DispLib_EditorNiagaraReviewToolFuncLib_GetPythonReturnLogIndexCount final
{
public:
	TArray<class FString>                         AllReturnLog;                                      // 0x0000(0x0010)(Parm)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_DispLib_EditorNiagaraReviewToolFuncLib_GetPythonReturnLogIndexCount;

// Function b1-Managed.DispLib_EditorNiagaraReviewToolFuncLib.GetPythonResultFromReturnLog
// 0x0028 (0x0028 - 0x0000)
struct DispLib_EditorNiagaraReviewToolFuncLib_GetPythonResultFromReturnLog final
{
public:
	TArray<class FString>                         AllReturnLog;                                      // 0x0000(0x0010)(Parm)
	uint8                                         SplitByIndexMarkFirst : 1;                         // 0x0010(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ResultIndex;                                       // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_DispLib_EditorNiagaraReviewToolFuncLib_GetPythonResultFromReturnLog;

// Function b1-Managed.DispLib_EditorNiagaraReviewToolFuncLib.GetNiagaraSystemLowAssetPath
// 0x0028 (0x0028 - 0x0000)
struct DispLib_EditorNiagaraReviewToolFuncLib_GetNiagaraSystemLowAssetPath final
{
public:
	class FString                                 NiagaraAssetPath;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 LowAssetPath;                                      // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	uint8                                         ReturnValue : 1;                                   // 0x0020(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
DUMPER7_ASSERTS_DispLib_EditorNiagaraReviewToolFuncLib_GetNiagaraSystemLowAssetPath;

// Function b1-Managed.DispLib_EditorNiagaraReviewToolFuncLib.NiagaraSystemIsLowAsset
// 0x0018 (0x0018 - 0x0000)
struct DispLib_EditorNiagaraReviewToolFuncLib_NiagaraSystemIsLowAsset final
{
public:
	class FString                                 NiagaraAssetPath;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
	uint8                                         ReturnValue : 1;                                   // 0x0010(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
DUMPER7_ASSERTS_DispLib_EditorNiagaraReviewToolFuncLib_NiagaraSystemIsLowAsset;

// Function b1-Managed.DispLib_EditorNiagaraReviewToolFuncLib.GetUnitResIDByAssetPath
// 0x0018 (0x0018 - 0x0000)
struct DispLib_EditorNiagaraReviewToolFuncLib_GetUnitResIDByAssetPath final
{
public:
	class FString                                 UnitTamerAssetPath;                                // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_DispLib_EditorNiagaraReviewToolFuncLib_GetUnitResIDByAssetPath;

// Function b1-Managed.DispLib_EditorNiagaraReviewToolFuncLib.GetPythonFuncLibPath
// 0x0010 (0x0010 - 0x0000)
struct DispLib_EditorNiagaraReviewToolFuncLib_GetPythonFuncLibPath final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_DispLib_EditorNiagaraReviewToolFuncLib_GetPythonFuncLibPath;

// Function b1-Managed.DispLib_EditorNiagaraReviewToolFuncLib.TryGetSeqRefInfo
// 0x0008 (0x0008 - 0x0000)
struct DispLib_EditorNiagaraReviewToolFuncLib_TryGetSeqRefInfo final
{
public:
	class UBGWDataAsset_SeqLevelLoadRelationInfo* DA;                                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_DispLib_EditorNiagaraReviewToolFuncLib_TryGetSeqRefInfo;

// Function b1-Managed.DispLib_EditorNiagaraReviewToolFuncLib.GooseMainTest
// 0x0008 (0x0008 - 0x0000)
struct DispLib_EditorNiagaraReviewToolFuncLib_GooseMainTest final
{
public:
	class UObject*                                Obj;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_DispLib_EditorNiagaraReviewToolFuncLib_GooseMainTest;

// Function b1-Managed.DispLib_EditorNiagaraReviewToolFuncLib.SplitString
// 0x0030 (0x0030 - 0x0000)
struct DispLib_EditorNiagaraReviewToolFuncLib_SplitString final
{
public:
	class FString                                 SourceString;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 SplitBy;                                           // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_DispLib_EditorNiagaraReviewToolFuncLib_SplitString;

// Function b1-Managed.DispLib_DBCNiagaraComponent.TickComponentInCS
// 0x0004 (0x0004 - 0x0000)
struct DispLib_DBCNiagaraComponent_TickComponentInCS final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_DispLib_DBCNiagaraComponent_TickComponentInCS;

// Function b1-Managed.DispLib_DBCNiagaraComponent.OnPropertyChanged
// 0x0020 (0x0020 - 0x0000)
struct DispLib_DBCNiagaraComponent_OnPropertyChanged final
{
public:
	class FString                                 MemberName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 PropertyName;                                      // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_DispLib_DBCNiagaraComponent_OnPropertyChanged;

// Function b1-Managed.DispLib_DBCNiagaraComponent.EndPlayInCS
// 0x0001 (0x0001 - 0x0000)
struct DispLib_DBCNiagaraComponent_EndPlayInCS final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_DispLib_DBCNiagaraComponent_EndPlayInCS;

// Function b1-Managed.BGUSimpleActorBaseCS.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BGUSimpleActorBaseCS_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BGUSimpleActorBaseCS_ReceiveEndPlay;

// Function b1-Managed.BGUActorBaseCS.OnConstructionCS
// 0x0060 (0x0060 - 0x0000)
struct BGUActorBaseCS_OnConstructionCS final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BGUActorBaseCS_OnConstructionCS;

// Function b1-Managed.BGUActorBaseCS.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BGUActorBaseCS_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BGUActorBaseCS_ReceiveEndPlay;

// Function b1-Managed.BGUActorBaseCS.GetActorGuidCS
// 0x0018 (0x0018 - 0x0000)
struct BGUActorBaseCS_GetActorGuidCS final
{
public:
	class FString                                 OutActorGuid;                                      // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	uint8                                         ReturnValue : 1;                                   // 0x0010(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
DUMPER7_ASSERTS_BGUActorBaseCS_GetActorGuidCS;

// Function b1-Managed.BANS_GSCallMultiPointsRegister.GSNotifyBeginCS
// 0x0050 (0x0050 - 0x0000)
struct BANS_GSCallMultiPointsRegister_GSNotifyBeginCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0048)(Parm, NoDestructor)
	float                                         TotalDuration;                                     // 0x0048(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BANS_GSCallMultiPointsRegister_GSNotifyBeginCS;

// Function b1-Managed.BUI_Widget.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct BUI_Widget_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(Parm, NoDestructor)
};
DUMPER7_ASSERTS_BUI_Widget_OnRemovedFromFocusPath;

// Function b1-Managed.BUI_Widget.OnAnalogValueChanged
// 0x0138 (0x0138 - 0x0000)
struct BUI_Widget_OnAnalogValueChanged final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(Parm, IsPlainOldData, NoDestructor)
	struct FAnalogInputEvent                      InAnalogInputEvent;                                // 0x0040(0x0040)(Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0080(0x00B8)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_BUI_Widget_OnAnalogValueChanged;

// Function b1-Managed.BUI_Widget.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct BUI_Widget_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(Parm, NoDestructor)
};
DUMPER7_ASSERTS_BUI_Widget_OnAddedToFocusPath;

// Function b1-Managed.BUI_Widget.OnPreviewKeyDown
// 0x0130 (0x0130 - 0x0000)
struct BUI_Widget_OnPreviewKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0040(0x0038)(Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0078(0x00B8)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_BUI_Widget_OnPreviewKeyDown;

// Function b1-Managed.BUI_Widget.OnFocusChanging
// 0x0008 (0x0008 - 0x0000)
struct BUI_Widget_OnFocusChanging final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor)
};
DUMPER7_ASSERTS_BUI_Widget_OnFocusChanging;

// Function b1-Managed.BUI_Widget.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BUI_Widget_PreConstruct final
{
public:
	uint8                                         IsDesignTime : 1;                                  // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor, HasGetValueTypeHash))
};
DUMPER7_ASSERTS_BUI_Widget_PreConstruct;

// Function b1-Managed.BUI_Widget.OnMouseWheel
// 0x0188 (0x0188 - 0x0000)
struct BUI_Widget_OnMouseWheel final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0040(0x0090)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00D0(0x00B8)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_BUI_Widget_OnMouseWheel;

// Function b1-Managed.BUI_Widget.OnKeyDown
// 0x0130 (0x0130 - 0x0000)
struct BUI_Widget_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0040(0x0038)(Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0078(0x00B8)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_BUI_Widget_OnKeyDown;

// Function b1-Managed.BUI_Widget.OnAnimationSequenceEvent
// 0x0018 (0x0018 - 0x0000)
struct BUI_Widget_OnAnimationSequenceEvent final
{
public:
