#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: b1_Managed

#include "Basic.hpp"

#include "Calliope_structs.hpp"
#include "Calliope_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "UMGSpline_classes.hpp"
#include "b1_Managed_structs.hpp"
#include "b1_structs.hpp"
#include "b1_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GSInput_structs.hpp"
#include "GSInput_classes.hpp"
#include "InputCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GSDynamicSDF_classes.hpp"
#include "UnrealExtent_structs.hpp"
#include "UnrealExtent_classes.hpp"
#include "EnhancedInput_structs.hpp"
#include "GSE_ProtobufDB_structs.hpp"
#include "SlateCore_structs.hpp"
#include "GSEngineExtent_structs.hpp"
#include "AkAudio_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "CalliopeWin64_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "DonAINavigation_structs.hpp"
#include "CinematicCamera_classes.hpp"
#include "AIModule_structs.hpp"
#include "Slate_structs.hpp"
#include "GSAnimationKeyBlender_structs.hpp"
#include "LevelSequence_classes.hpp"
#include "GSReplaySystem_classes.hpp"
#include "AsyncLoadingScreen_structs.hpp"
#include "MM_structs.hpp"
#include "MM_classes.hpp"
#include "JavascriptUMG_classes.hpp"


namespace SDK
{

// SharpClass b1-Managed.BAID_Base
// 0x0000 (0x0090 - 0x0090)
class UBAID_Base : public UBTDecorator_USharpBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BAID_Base")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BAID_Base")
	}
	static class UBAID_Base* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBAID_Base>();
	}
};
DUMPER7_ASSERTS_UBAID_Base;

// SharpClass b1-Managed.BAID_SelfBeyondPursuitRange
// 0x0000 (0x0090 - 0x0090)
class UBAID_SelfBeyondPursuitRange final : public UBAID_Base
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BAID_SelfBeyondPursuitRange")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BAID_SelfBeyondPursuitRange")
	}
	static class UBAID_SelfBeyondPursuitRange* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBAID_SelfBeyondPursuitRange>();
	}
};
DUMPER7_ASSERTS_UBAID_SelfBeyondPursuitRange;

// SharpClass b1-Managed.UIKRigDefinition
// 0x0038 (0x0060 - 0x0028)
class UUIKRigDefinition final : public UObject
{
public:
	TArray<struct FTransform>                     TargetTransforms;                                  // 0x0028(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FTransform>                     RefTransforms;                                     // 0x0038(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<class FName>                           BoneNames;                                         // 0x0048(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                         ChainLength;                                       // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UIKRigDefinition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIKRigDefinition")
	}
	static class UUIKRigDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIKRigDefinition>();
	}
};
DUMPER7_ASSERTS_UUIKRigDefinition;

// SharpClass b1-Managed.BANS_GSBase
// 0x0000 (0x0048 - 0x0048)
class UBANS_GSBase : public UAnimNotifyState_GSBase
{
public:
	int32 GSNotifyDebugPostBeginCS(const struct FUStGSNotifyParam& NotifyParam) const;
	int32 GSNotifyDebugPreBeginCS(const struct FUStGSNotifyParam& NotifyParam) const;
	int32 GSNotifyDebugPostTickCS(const struct FUStGSNotifyParam& NotifyParam) const;
	int32 GSNotifyDebugPreTickCS(const struct FUStGSNotifyParam& NotifyParam) const;
	int32 GSNotifyDebugPostEndCS(const struct FUStGSNotifyParam& NotifyParam) const;
	int32 GSNotifyDebugPreEndCS(const struct FUStGSNotifyParam& NotifyParam) const;
	TArray<struct FSoftObjectPath> GetSoftReferences() const;
	void GSValidateInputCS(class AActor* Actor) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BANS_GSBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BANS_GSBase")
	}
	static class UBANS_GSBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBANS_GSBase>();
	}
};
DUMPER7_ASSERTS_UBANS_GSBase;

// SharpClass b1-Managed.BANS_GSTimedPlayNiagaraFX
// 0x0270 (0x02B8 - 0x0048)
class UBANS_GSTimedPlayNiagaraFX : public UBANS_GSBase
{
public:
	uint8                                         EditorActive : 1;                                  // 0x0048(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UNiagaraSystem>          Template;                                          // 0x0050(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DelayTimeAfterStop;                                // 0x0078(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDispLibDBCEffectDestroyTiming                DestroyTiming;                                     // 0x007C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   OverrideSKMTagName;                                // 0x0080(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Attached : 1;                                      // 0x0088(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SocketName;                                        // 0x008C(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         offsetInLocaSpace : 1;                             // 0x0094(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LocationOffset;                                    // 0x0098(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               RotationOffset;                                    // 0x00B0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                Scale;                                             // 0x00C8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         SnapGround : 1;                                    // 0x00E0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	EDispLibDBCSnapGroundRotationMode             SnapGroundRotationMode;                            // 0x00E1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ignoreRootBoneScale : 1;                           // 0x00E2(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         BitPad_E2_1 : 7;                                   // 0x00E2(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         SetSelfMeshParam : 1;                              // 0x00E3(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           OverrideSKMBones;                                  // 0x00E8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TArray<class FName>                           OverrideSKMSockets;                                // 0x00F8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TArray<struct FGSNiagaraSysParam>             customParams;                                      // 0x0108(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	uint8                                         DetachOnEndDispStageBegin : 1;                     // 0x0118(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         BitPad_118_1 : 7;                                  // 0x0118(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         EnableShadow : 1;                                  // 0x0119(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_11A[0x2];                                      // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TranslucentSortPriority;                           // 0x011C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PausePriority;                                     // 0x0120(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDispLibDBCPauseMode                          PauseMode;                                         // 0x0124(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         EndStagePriority;                                  // 0x0128(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ForceChangeVisibleStateDEFPriority;                // 0x012C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDispLibDBCNiagaraForceVisibleStateMode       ForceVisibleStateDefaultMode;                      // 0x0130(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CompTag;                                           // 0x0134(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBUC_DispLibDBC_NiagaraEventScalabilitySettings ScalabilitySettings;                      // 0x0140(0x0170)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         hasAttachedSocket : 1;                             // 0x02B0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))

public:
	TArray<struct FSoftObjectPath> GetSoftReferences() const;
	void GSNotifyBeginCS(const struct FUStGSNotifyParam& NotifyParam, float TotalDuration) const;
	void GSNotifyEndCS(const struct FUStGSNotifyParam& NotifyParam) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BANS_GSTimedPlayNiagaraFX")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BANS_GSTimedPlayNiagaraFX")
	}
	static class UBANS_GSTimedPlayNiagaraFX* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBANS_GSTimedPlayNiagaraFX>();
	}
};
DUMPER7_ASSERTS_UBANS_GSTimedPlayNiagaraFX;

// SharpClass b1-Managed.BANS_GSTimedPlayNiagaraFX_WithCondition
// 0x0020 (0x02D8 - 0x02B8)
class UBANS_GSTimedPlayNiagaraFX_WithCondition final : public UBANS_GSTimedPlayNiagaraFX
{
public:
	struct FPlayNiagaraConditions                 Condition;                                         // 0x02B8(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void GSNotifyBeginCS(const struct FUStGSNotifyParam& NotifyParam, float TotalDuration) const;
	void GSNotifyEndCS(const struct FUStGSNotifyParam& NotifyParam) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BANS_GSTimedPlayNiagaraFX_WithCondition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BANS_GSTimedPlayNiagaraFX_WithCondition")
	}
	static class UBANS_GSTimedPlayNiagaraFX_WithCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBANS_GSTimedPlayNiagaraFX_WithCondition>();
	}
};
DUMPER7_ASSERTS_UBANS_GSTimedPlayNiagaraFX_WithCondition;

// SharpClass b1-Managed.ActorEditCompBase
// 0x0000 (0x00C8 - 0x00C8)
class UActorEditCompBase : public UEditorOnlyCompBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ActorEditCompBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ActorEditCompBase")
	}
	static class UActorEditCompBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorEditCompBase>();
	}
};
DUMPER7_ASSERTS_UActorEditCompBase;

// SharpClass b1-Managed.BUS_SpawnMultiPointComp
// 0x0130 (0x01F8 - 0x00C8)
class UBUS_SpawnMultiPointComp final : public UActorEditCompBase
{
public:
	uint8                                         bDefaultStartSpawn : 1;                            // 0x00C8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnvQuery*                              GeneratePointsEQSTemplate;                         // 0x00D0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGSEnvNamedValue>               QueryConfig;                                       // 0x00D8(0x0010)(BlueprintVisible, NativeAccessSpecifierPublic)
	class UStaticMesh*                            PreviewMesh;                                       // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     Material;                                          // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           DiffuseColor;                                      // 0x00F8(0x0010)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        SpawnPoints;                                       // 0x0108(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FRotator>                       SpawnPointsRot;                                    // 0x0118(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         UseSpawnPointsRot : 1;                             // 0x0128(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SpawnNum;                                          // 0x012C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReSpawnThreshold;                                  // 0x0130(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         IsLRU : 1;                                         // 0x0134(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         BitPad_134_1 : 7;                                  // 0x0134(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         IsNotSpawnedInPlayerSight : 1;                     // 0x0135(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_136[0x2];                                      // 0x0136(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LowerLimitNum;                                     // 0x0138(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReSpawnNum;                                        // 0x013C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReSpawnTestInterval;                               // 0x0140(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESpawnType                                    Type;                                              // 0x0144(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SpawnedTag;                                        // 0x0148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESpawnRule                                    SpawnRule;                                         // 0x0150(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClass*>                         SpawnActorList;                                    // 0x0158(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                         SpawnHeight;                                       // 0x0168(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAnimMontage*>                   SpawnMontages;                                     // 0x0170(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         bIsFacePlayer : 1;                                 // 0x0180(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         BitPad_180_1 : 7;                                  // 0x0180(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         bIsCatchPlayer : 1;                                // 0x0181(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_182[0x6];                                      // 0x0182(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class ABUTamerActor>           TamerMaster;                                       // 0x0188(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOnlineSpawnConfig                     OlineConfig;                                       // 0x01B0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class ABGUCharacterCS>         SpawnMaster;                                       // 0x01C0(0x0028)(Edit, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         GeneratedActors;                                   // 0x01E8(0x0010)(NativeAccessSpecifierPublic)

public:
	void PreviewRecordSpawnPoints();
	void ClearGenerateActors();
	void RecordSpawnPoints();
	void RunEQSQuery();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BUS_SpawnMultiPointComp")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BUS_SpawnMultiPointComp")
	}
	static class UBUS_SpawnMultiPointComp* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBUS_SpawnMultiPointComp>();
	}
};
DUMPER7_ASSERTS_UBUS_SpawnMultiPointComp;

// SharpClass b1-Managed.BGWDataAsset_CloudMoveConfig
// 0x0190 (0x01C0 - 0x0030)
class UBGWDataAsset_CloudMoveConfig final : public UBGWDataAsset
{
public:
	int32                                         CloudSkillCooldownTime;                            // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CloudSkill_Ride_Walk;                              // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CloudSkill_Ride_Run;                               // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CloudSkill_Ride_Sprint;                            // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CloudSkill_Ride_Fall;                              // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CloudSkill_Ride_Fall_MinHeight;                    // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CloudSkill_GetOff_Walk_Low;                        // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CloudSkill_GetOff_Walk_High;                       // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CloudSkill_GetOff_Run_Low_Forward;                 // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CloudSkill_GetOff_Run_Low_Upward;                  // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CloudSkill_GetOff_Run_Low_Downward;                // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CloudSkill_GetOff_Run_High_Forward;                // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CloudSkill_GetOff_Run_High_Upward;                 // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CloudSkill_GetOff_Run_High_Downward;               // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CloudSkill_GetOff_Rush_Low_Forward;                // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CloudSkill_GetOff_Rush_Low_Upward;                 // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CloudSkill_GetOff_Rush_Low_Downward;               // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CloudSkill_GetOff_Rush_High_Forward;               // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CloudSkill_GetOff_Rush_High_Upward;                // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CloudSkill_GetOff_Rush_High_Downward;              // 0x007C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<int32, struct FCloudMoveBreakSkillConfig> CloudSkill_BreakSkills;                           // 0x0080(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                         HeightLimitThreshold;                              // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            HeightLimitMaxPitchCurve;                          // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         DisableHeightLimitIfNoInput : 1;                   // 0x00E0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinimumHeightRestriction;                          // 0x00E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinimumHeightRestrictionThreshold;                 // 0x00E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HorizontalFlightUpAngleRange;                      // 0x00EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HorizontalFlightDownAngleRange;                    // 0x00F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RushEffectSpeed;                                   // 0x00F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 RushEffectBuffList;                                // 0x00F8(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                          RushAkEvent;                                       // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CloudMoveItemId;                                   // 0x0110(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CloudMoveBuffId;                                   // 0x0118(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class UBGWDataAsset_B1DBC*                    CloudEffectDBC;                                    // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            CloudEffectDBC_RotateLerpSpeedCurve;               // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            CloudEffectDBC_LocationLerpSpeedCurve;             // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveVector*                           CloudEffectDBC_OffsetCurve;                        // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                          CloudAkEventBegin;                                 // 0x0148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                          CloudAkEventStop;                                  // 0x0150(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            CloudFoliageFadeScaleCurve;                        // 0x0158(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GroundEffectDistance;                              // 0x0160(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GroundEffectInterval;                              // 0x0164(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GroundEffectSpeed;                                 // 0x0168(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<ESceneItemSurfaceType, struct FCloudMoveGroundEffectConfig> GroundEffects;                  // 0x0170(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BGWDataAsset_CloudMoveConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BGWDataAsset_CloudMoveConfig")
	}
	static class UBGWDataAsset_CloudMoveConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBGWDataAsset_CloudMoveConfig>();
	}
};
DUMPER7_ASSERTS_UBGWDataAsset_CloudMoveConfig;

// SharpClass b1-Managed.HelloWorldActor
// 0x0008 (0x0290 - 0x0288)
class AHelloWorldActor final : public AActor
{
public:
	int32                                         Value123;                                          // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void ReceiveBeginPlay();
	void CallMe();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HelloWorldActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HelloWorldActor")
	}
	static class AHelloWorldActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHelloWorldActor>();
	}
};
DUMPER7_ASSERTS_AHelloWorldActor;

// SharpClass b1-Managed.BED_CalliopeNodeBae
// 0x0000 (0x02A0 - 0x02A0)
class UBED_CalliopeNodeBae : public UCalliopeNode
{
public:
	uint8 GetBranchGraphToEditInCS(class FString* OutBranchGraphIdentifier);

	uint8 IsSupportViewType(const ECalliopeViewType& InViewType) const;
	uint8 IsBranchGraphNode() const;
	uint8 IsRerouteNode() const;
	struct FCalliopeGuid GetGuid() const;
	int32 GetActorGuidOptions(const class FString& PropertyName, TArray<struct FActorGuidOption>* OutOptions) const;
	uint8 CanManageStates() const;
	uint8 GetActorGuid(class AActor* InActor, class FString* OutActorGuid) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BED_CalliopeNodeBae")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BED_CalliopeNodeBae")
	}
	static class UBED_CalliopeNodeBae* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBED_CalliopeNodeBae>();
	}
};
DUMPER7_ASSERTS_UBED_CalliopeNodeBae;

// SharpClass b1-Managed.BED_ProcessNode
// 0x0000 (0x02A0 - 0x02A0)
class UBED_ProcessNode : public UBED_CalliopeNodeBae
{
public:
	uint8 IsSupportViewType(const ECalliopeViewType& InViewType) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BED_ProcessNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BED_ProcessNode")
	}
	static class UBED_ProcessNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBED_ProcessNode>();
	}
};
DUMPER7_ASSERTS_UBED_ProcessNode;

// SharpClass b1-Managed.BED_ProcessMachineNode
// 0x0000 (0x02A0 - 0x02A0)
class UBED_ProcessMachineNode : public UBED_ProcessNode
{
public:
	void OnRefreshAssetInCS() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BED_ProcessMachineNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BED_ProcessMachineNode")
	}
	static class UBED_ProcessMachineNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBED_ProcessMachineNode>();
	}
};
DUMPER7_ASSERTS_UBED_ProcessMachineNode;

// SharpClass b1-Managed.BED_ProcessMachineNode_NPCState
// 0x0068 (0x0308 - 0x02A0)
class UBED_ProcessMachineNode_NPCState final : public UBED_ProcessMachineNode
{
public:
	TMap<class FName, uint8>                      StateList;                                         // 0x02A0(0x0050)(Edit, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FTaskStageConditionInfo>        TaskStageConditionList;                            // 0x02F0(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FName                                   CurrentState;                                      // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	uint8 GetBranchGraphToEditInCS(class FString* OutBranchGraphIdentifier);
	TArray<class FName> GetContextOutputsInCS();
	void PostPropertyChanged(const class FString& MemberName, const class FString& PropertyName);

	class FString GetNodeDescriptionInCS() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BED_ProcessMachineNode_NPCState")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BED_ProcessMachineNode_NPCState")
	}
	static class UBED_ProcessMachineNode_NPCState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBED_ProcessMachineNode_NPCState>();
	}
};
DUMPER7_ASSERTS_UBED_ProcessMachineNode_NPCState;

// SharpClass b1-Managed.DispLib_DBCSimpleMaterialQualityManager
// 0x0008 (0x00D8 - 0x00D0)
class UDispLib_DBCSimpleMaterialQualityManager final : public UBaseActorCompTickable
{
public:
	uint8                                         InitOver : 1;                                      // 0x00D0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))

public:
	void TickComponentInCS(float DeltaTime);
	void BeginPlayInCS();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DispLib_DBCSimpleMaterialQualityManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DispLib_DBCSimpleMaterialQualityManager")
	}
	static class UDispLib_DBCSimpleMaterialQualityManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDispLib_DBCSimpleMaterialQualityManager>();
	}
};
DUMPER7_ASSERTS_UDispLib_DBCSimpleMaterialQualityManager;

// SharpClass b1-Managed.BED_FSMNode
// 0x0000 (0x02A0 - 0x02A0)
class UBED_FSMNode : public UBED_CalliopeNodeBae
{
public:
	uint8 IsSupportViewType(const ECalliopeViewType& InViewType) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BED_FSMNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BED_FSMNode")
	}
	static class UBED_FSMNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBED_FSMNode>();
	}
};
DUMPER7_ASSERTS_UBED_FSMNode;

// SharpClass b1-Managed.BED_FSMNode_ConditionBase
// 0x0000 (0x02A0 - 0x02A0)
class UBED_FSMNode_ConditionBase : public UBED_FSMNode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BED_FSMNode_ConditionBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BED_FSMNode_ConditionBase")
	}
	static class UBED_FSMNode_ConditionBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBED_FSMNode_ConditionBase>();
	}
};
DUMPER7_ASSERTS_UBED_FSMNode_ConditionBase;

// SharpClass b1-Managed.BED_FSMNode_Condition_GI_Loading_IsNeedOpenLoadingScreen
// 0x0000 (0x02A0 - 0x02A0)
class UBED_FSMNode_Condition_GI_Loading_IsNeedOpenLoadingScreen final : public UBED_FSMNode_ConditionBase
{
public:
	class FString GetNodeDescriptionInCS() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BED_FSMNode_Condition_GI_Loading_IsNeedOpenLoadingScreen")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BED_FSMNode_Condition_GI_Loading_IsNeedOpenLoadingScreen")
	}
	static class UBED_FSMNode_Condition_GI_Loading_IsNeedOpenLoadingScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBED_FSMNode_Condition_GI_Loading_IsNeedOpenLoadingScreen>();
	}
};
DUMPER7_ASSERTS_UBED_FSMNode_Condition_GI_Loading_IsNeedOpenLoadingScreen;

// SharpClass b1-Managed.BED_BehaviorNode
// 0x0000 (0x02A0 - 0x02A0)
class UBED_BehaviorNode : public UBED_CalliopeNodeBae
{
public:
	uint8 IsSupportViewType(const ECalliopeViewType& InViewType) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BED_BehaviorNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BED_BehaviorNode")
	}
	static class UBED_BehaviorNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBED_BehaviorNode>();
	}
};
DUMPER7_ASSERTS_UBED_BehaviorNode;

// SharpClass b1-Managed.BED_BehaviorNode_Condition
// 0x0008 (0x02A8 - 0x02A0)
class UBED_BehaviorNode_Condition : public UBED_BehaviorNode
{
public:
	uint8                                         bReverseCondition : 1;                             // 0x02A0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ConditionCoolDownTimeMs;                           // 0x02A4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BED_BehaviorNode_Condition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BED_BehaviorNode_Condition")
	}
	static class UBED_BehaviorNode_Condition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBED_BehaviorNode_Condition>();
	}
};
DUMPER7_ASSERTS_UBED_BehaviorNode_Condition;

// SharpClass b1-Managed.BED_BehaviorNode_DetectUnit
// 0x0030 (0x02D8 - 0x02A8)
class UBED_BehaviorNode_DetectUnit final : public UBED_BehaviorNode_Condition
{
public:
	EDetectedUnitType                             UnitType;                                          // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGsSmartParam                          SmartUnit;                                         // 0x02AC(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDetectCondition>               Conditions;                                        // 0x02C0(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	EConditionalRelation                          ConditionalRelation;                               // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	class FString GetNodeDescriptionInCS() const;
	uint8 IsSupportViewType(const ECalliopeViewType& InViewType) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BED_BehaviorNode_DetectUnit")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BED_BehaviorNode_DetectUnit")
	}
	static class UBED_BehaviorNode_DetectUnit* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBED_BehaviorNode_DetectUnit>();
	}
};
DUMPER7_ASSERTS_UBED_BehaviorNode_DetectUnit;

// SharpClass b1-Managed.HelloUTestComp
// 0x0000 (0x00C0 - 0x00C0)
class UHelloUTestComp final : public UActorComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HelloUTestComp")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HelloUTestComp")
	}
	static class UHelloUTestComp* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHelloUTestComp>();
	}
};
DUMPER7_ASSERTS_UHelloUTestComp;

// SharpClass b1-Managed.BED_FSMNode_GI_LoadingBase
// 0x0000 (0x02A0 - 0x02A0)
class UBED_FSMNode_GI_LoadingBase : public UBED_FSMNode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BED_FSMNode_GI_LoadingBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BED_FSMNode_GI_LoadingBase")
	}
	static class UBED_FSMNode_GI_LoadingBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBED_FSMNode_GI_LoadingBase>();
	}
};
DUMPER7_ASSERTS_UBED_FSMNode_GI_LoadingBase;

// SharpClass b1-Managed.BED_FSMNode_GI_LoadingAnyState
// 0x0010 (0x02B0 - 0x02A0)
class UBED_FSMNode_GI_LoadingAnyState final : public UBED_FSMNode_GI_LoadingBase
{
public:
	TArray<EGI_Loading>                           AcceptEvents;                                      // 0x02A0(0x0010)(Edit, NativeAccessSpecifierPublic)

public:
	void PostPropertyChanged(const class FString& MemberName, const class FString& PropertyName);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BED_FSMNode_GI_LoadingAnyState")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BED_FSMNode_GI_LoadingAnyState")
	}
	static class UBED_FSMNode_GI_LoadingAnyState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBED_FSMNode_GI_LoadingAnyState>();
	}
};
DUMPER7_ASSERTS_UBED_FSMNode_GI_LoadingAnyState;

// SharpClass b1-Managed.BGWDataAsset_EnvironmentMaskConfig
// 0x0010 (0x0040 - 0x0030)
class UBGWDataAsset_EnvironmentMaskConfig final : public UBGWDataAsset
{
public:
	TArray<struct FEnvironmentMaskData>           EnvironmentMaskDataList;                           // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BGWDataAsset_EnvironmentMaskConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BGWDataAsset_EnvironmentMaskConfig")
	}
	static class UBGWDataAsset_EnvironmentMaskConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBGWDataAsset_EnvironmentMaskConfig>();
	}
};
DUMPER7_ASSERTS_UBGWDataAsset_EnvironmentMaskConfig;

// SharpClass b1-Managed.GSDispLib_PostProcessActor
// 0x0060 (0x02E8 - 0x0288)
class AGSDispLib_PostProcessActor : public AActor
{
public:
	class UMaterialInstance*                      MaterialPrototype;                                 // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               MaterialInstDynamic;                               // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGSDispLib_PostProcessContext*          PPContext;                                         // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUDispLib_PostPorcessCommonConf        PPConf;                                            // 0x02A0(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Progress;                                          // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         IsAutoPlay : 1;                                    // 0x02D4(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_2D5[0x3];                                      // 0x02D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UDispLib_PPEffectParameters*            Parameters;                                        // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EffectID;                                          // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void OnAlreadyFinish(class UGSDispLib_PostProcessContext* Context);
	void OnAlreadyBegin(class UGSDispLib_PostProcessContext* Context);
	void OnEnterFinish(class UGSDispLib_PostProcessContext* Context);
	void OnEnterBegin(class UGSDispLib_PostProcessContext* Context);
	void OnEffectTick(float DeltaTime, float Progress_0, class UGSDispLib_PostProcessContext* Context);
	void OnEndFinish(class UGSDispLib_PostProcessContext* Context);
	void OnEndBegin(class UGSDispLib_PostProcessContext* Context);
	void OnInit(class UGSDispLib_PostProcessContext* Context, const struct FUDispLib_PostPorcessCommonConf& Conf);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSDispLib_PostProcessActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSDispLib_PostProcessActor")
	}
	static class AGSDispLib_PostProcessActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGSDispLib_PostProcessActor>();
	}
};
DUMPER7_ASSERTS_AGSDispLib_PostProcessActor;

// SharpClass b1-Managed.GSDispLib_PP_VaFogOfWar
// 0x0070 (0x0358 - 0x02E8)
class AGSDispLib_PP_VaFogOfWar final : public AGSDispLib_PostProcessActor
{
public:
	class UTextureRenderTarget2D*                 FoWTex1;                                           // 0x02E8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextureRenderTarget2D*                 FoWTex2;                                           // 0x02F0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextureRenderTarget2D*                 FoWTex3;                                           // 0x02F8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           FoWOpaqueColor;                                    // 0x0300(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           FoWTranslucentColor;                               // 0x0310(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   FoWTexName;                                        // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   FoWTex2Name;                                       // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   FoWOpaqueColorName;                                // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   FoWTranslucentColorName;                           // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   FoWVolumePosSizeName;                              // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   FoWIsDebug;                                        // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   FoWCombineTexName;                                 // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnAlreadyBegin(class UGSDispLib_PostProcessContext* Context);
	void OnEnterFinish(class UGSDispLib_PostProcessContext* Context);
	void OnEnterBegin(class UGSDispLib_PostProcessContext* Context);
	void OnEffectTick(float DeltaTime, float Progress_0, class UGSDispLib_PostProcessContext* Context);
	void OnEndFinish(class UGSDispLib_PostProcessContext* Context);
	void OnEndBegin(class UGSDispLib_PostProcessContext* Context);
	void OnInit(class UGSDispLib_PostProcessContext* Context, const struct FUDispLib_PostPorcessCommonConf& Conf);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSDispLib_PP_VaFogOfWar")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSDispLib_PP_VaFogOfWar")
	}
	static class AGSDispLib_PP_VaFogOfWar* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGSDispLib_PP_VaFogOfWar>();
	}
};
DUMPER7_ASSERTS_AGSDispLib_PP_VaFogOfWar;

// SharpClass b1-Managed.HelloUFromUSharp
// 0x0058 (0x02E0 - 0x0288)
class AHelloUFromUSharp final : public AActor
{
public:
	int32                                         Value123;                                          // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Value456;                                          // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(uint8 Param1, const class FString& Param2, int32 param3)> DelegateTest; // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	class UHelloUTestComp*                        TestComp;                                          // 0x02B0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 TestArr2;                                          // 0x02B8(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class UClass*                                 ActorClass;                                        // 0x02C8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 ActorClass4;                                       // 0x02D0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHelloUStructTest                      Struct;                                            // 0x02D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void ReceiveBeginPlay();
	void CallMe(const class FString& Arg1);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HelloUFromUSharp")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HelloUFromUSharp")
	}
	static class AHelloUFromUSharp* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHelloUFromUSharp>();
	}
};
DUMPER7_ASSERTS_AHelloUFromUSharp;

// SharpClass b1-Managed.BED_ProcessStateNode
// 0x0000 (0x02A0 - 0x02A0)
class UBED_ProcessStateNode : public UBED_ProcessNode
{
public:
	uint8 IsBranchGraphNode() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BED_ProcessStateNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BED_ProcessStateNode")
	}
	static class UBED_ProcessStateNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBED_ProcessStateNode>();
	}
};
DUMPER7_ASSERTS_UBED_ProcessStateNode;

// SharpClass b1-Managed.BED_ProcessStateNode_UpdateInteractGroup
// 0x0008 (0x02A8 - 0x02A0)
class UBED_ProcessStateNode_UpdateInteractGroup final : public UBED_ProcessStateNode
{
public:
	int32                                         InteractGroupID;                                   // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BED_ProcessStateNode_UpdateInteractGroup")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BED_ProcessStateNode_UpdateInteractGroup")
	}
	static class UBED_ProcessStateNode_UpdateInteractGroup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBED_ProcessStateNode_UpdateInteractGroup>();
	}
};
DUMPER7_ASSERTS_UBED_ProcessStateNode_UpdateInteractGroup;

// SharpClass b1-Managed.OldMKSpawnTest
// 0x0000 (0x0288 - 0x0288)
class AOldMKSpawnTest final : public AActor
{
public:
	class AActor* SpawnActorCS(class UClass* ActorClass);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OldMKSpawnTest")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OldMKSpawnTest")
	}
	static class AOldMKSpawnTest* GetDefaultObj()
	{
		return GetDefaultObjImpl<AOldMKSpawnTest>();
	}
};
DUMPER7_ASSERTS_AOldMKSpawnTest;

// SharpClass b1-Managed.BED_FSMNode_Condition_GI_Loading_IsInStartUpLevel
// 0x0000 (0x02A0 - 0x02A0)
class UBED_FSMNode_Condition_GI_Loading_IsInStartUpLevel final : public UBED_FSMNode_ConditionBase
{
public:
	class FString GetNodeDescriptionInCS() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BED_FSMNode_Condition_GI_Loading_IsInStartUpLevel")
	}
	static const class FName& StaticName()
	{
