#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: b1

#include "Basic.hpp"

#include "b1_structs.hpp"
#include "ProceduralMeshComponent_structs.hpp"
#include "NetCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Calliope_structs.hpp"
#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "UnrealExtent_structs.hpp"
#include "AkAudio_structs.hpp"
#include "AsyncLoadingScreen_structs.hpp"


namespace SDK::Params
{

// Function b1.ActorDataContainer.AddDataObjInCS
// 0x0008 (0x0008 - 0x0000)
struct ActorDataContainer_AddDataObjInCS final
{
public:
	class UObject*                                Obj;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorDataContainer_AddDataObjInCS;

// Function b1.ActorCompContainer.FillDataContainer
// 0x0008 (0x0008 - 0x0000)
struct ActorCompContainer_FillDataContainer final
{
public:
	class UActorDataContainer*                    DataObj;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorCompContainer_FillDataContainer;

// Function b1.ActorCompContainer.FillEventCollection
// 0x0008 (0x0008 - 0x0000)
struct ActorCompContainer_FillEventCollection final
{
public:
	class UObject*                                DataObj;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorCompContainer_FillEventCollection;

// Function b1.ActorCompContainer.SetTeamID
// 0x0004 (0x0004 - 0x0000)
struct ActorCompContainer_SetTeamID final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorCompContainer_SetTeamID;

// Function b1.BGUCrowdFollowingComponent.SetCrowdFollowingEnabled
// 0x0002 (0x0002 - 0x0000)
struct BGUCrowdFollowingComponent_SetCrowdFollowingEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsObstacle;                                       // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BGUCrowdFollowingComponent_SetCrowdFollowingEnabled;

// Function b1.BGUCrowdFollowingComponent.SetCrowdFollowingParam
// 0x0010 (0x0010 - 0x0000)
struct BGUCrowdFollowingComponent_SetCrowdFollowingParam final
{
public:
	float                                         fSeparationWeight;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         fCollisionQueryRange;                              // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         fPathOptimizationRange;                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         iAvoidanceQualityLevel;                            // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BGUCrowdFollowingComponent_SetCrowdFollowingParam;

// Function b1.AnimNotifyFuncLibrary.ActorTryAnimNotifyDelayExecute
// 0x0010 (0x0010 - 0x0000)
struct AnimNotifyFuncLibrary_ActorTryAnimNotifyDelayExecute final
{
public:
	class AActor*                                 NotifyOwner;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AnimNotifyFuncLibrary_ActorTryAnimNotifyDelayExecute;

// Function b1.AnimNotifyFuncLibrary.CanAnimNotifyDelayExecute
// 0x0010 (0x0010 - 0x0000)
struct AnimNotifyFuncLibrary_CanAnimNotifyDelayExecute final
{
public:
	class AActor*                                 NotifyOwner;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AnimNotifyFuncLibrary_CanAnimNotifyDelayExecute;

// Function b1.AnimNotifyFuncLibrary.DeleteAnimNotifyAndAnimNotifyState
// 0x0028 (0x0028 - 0x0000)
struct AnimNotifyFuncLibrary_DeleteAnimNotifyAndAnimNotifyState final
{
public:
	class UAnimMontage*                           AnimMontage;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<EGsEnAnimN>                            NotifyTypeList;                                    // 0x0008(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<EGsEnAnimNS>                           NotifyStateTypeList;                               // 0x0018(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AnimNotifyFuncLibrary_DeleteAnimNotifyAndAnimNotifyState;

// Function b1.AnimNotifyFuncLibrary.GetAllAnimNotifySoftAsset
// 0x00A8 (0x00A8 - 0x0000)
struct AnimNotifyFuncLibrary_GetAllAnimNotifySoftAsset final
{
public:
	class UAnimSequenceBase*                      AnimBase;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class UAnimNotify_GSBase*, struct FNotifySoftRefs> outNotifyRefs;                           // 0x0008(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	TMap<class UAnimNotifyState_GSBase*, struct FNotifySoftRefs> outNotifyStateRefs;                 // 0x0058(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AnimNotifyFuncLibrary_GetAllAnimNotifySoftAsset;

// Function b1.AnimNotifyFuncLibrary.PrepareAnimationsNotifySoftAsset
// 0x00B0 (0x00B0 - 0x0000)
struct AnimNotifyFuncLibrary_PrepareAnimationsNotifySoftAsset final
{
public:
	TArray<class UAnimSequenceBase*>              AnimBases;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class UAnimNotify_GSBase*, struct FNotifySoftRefs> outNotifyRefs;                           // 0x0010(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	TMap<class UAnimNotifyState_GSBase*, struct FNotifySoftRefs> outNotifyStateRefs;                 // 0x0060(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AnimNotifyFuncLibrary_PrepareAnimationsNotifySoftAsset;

// Function b1.AnimNotifyFuncLibrary.PrepareAnimNotifySoftAsset
// 0x00A8 (0x00A8 - 0x0000)
struct AnimNotifyFuncLibrary_PrepareAnimNotifySoftAsset final
{
public:
	class UAnimSequenceBase*                      AnimBase;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class UAnimNotify_GSBase*, struct FNotifySoftRefs> outNotifyRefs;                           // 0x0008(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	TMap<class UAnimNotifyState_GSBase*, struct FNotifySoftRefs> outNotifyStateRefs;                 // 0x0058(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AnimNotifyFuncLibrary_PrepareAnimNotifySoftAsset;

// Function b1.BGUDataComp.InitWithAIController
// 0x0008 (0x0008 - 0x0000)
struct BGUDataComp_InitWithAIController final
{
public:
	class ABGUAIController*                       AIController;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BGUDataComp_InitWithAIController;

// Function b1.BGUDataComp.InitWithCharacter
// 0x0008 (0x0008 - 0x0000)
struct BGUDataComp_InitWithCharacter final
{
public:
	class ABGUCharacter*                          Character;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BGUDataComp_InitWithCharacter;

// Function b1.AnimNotifyState_GSBase.AddPreloadedAsset
// 0x0008 (0x0008 - 0x0000)
struct AnimNotifyState_GSBase_AddPreloadedAsset final
{
public:
	class UObject*                                Obj;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AnimNotifyState_GSBase_AddPreloadedAsset;

// Function b1.AnimNotifyState_GSBase.GetAnimNSType
// 0x0001 (0x0001 - 0x0000)
struct AnimNotifyState_GSBase_GetAnimNSType final
{
public:
	EGsEnAnimNS                                   ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AnimNotifyState_GSBase_GetAnimNSType;

// Function b1.AnimNotifyState_GSBase.GetJumpableSectionPrefix
// 0x0010 (0x0010 - 0x0000)
struct AnimNotifyState_GSBase_GetJumpableSectionPrefix final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AnimNotifyState_GSBase_GetJumpableSectionPrefix;

// Function b1.AnimNotifyState_GSBase.GetModifySpeedRate
// 0x0004 (0x0004 - 0x0000)
struct AnimNotifyState_GSBase_GetModifySpeedRate final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AnimNotifyState_GSBase_GetModifySpeedRate;

// Function b1.AnimNotifyState_GSBase.GetPreloadedAssets
// 0x0010 (0x0010 - 0x0000)
struct AnimNotifyState_GSBase_GetPreloadedAssets final
{
public:
	TArray<class UObject*>                        ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AnimNotifyState_GSBase_GetPreloadedAssets;

// Function b1.AnimNotifyState_GSBase.GetSoftReferences
// 0x0010 (0x0010 - 0x0000)
struct AnimNotifyState_GSBase_GetSoftReferences final
{
public:
	TArray<struct FSoftObjectPath>                ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AnimNotifyState_GSBase_GetSoftReferences;

// Function b1.AnimNotifyState_GSBase.GSAllowCrossSection
// 0x0001 (0x0001 - 0x0000)
struct AnimNotifyState_GSBase_GSAllowCrossSection final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AnimNotifyState_GSBase_GSAllowCrossSection;

// Function b1.AnimNotifyState_GSBase.GSNotifyBegin_Delay
// 0x0050 (0x0050 - 0x0000)
struct AnimNotifyState_GSBase_GSNotifyBegin_Delay final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0048)(Parm, OutParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	float                                         TotalDuration;                                     // 0x0048(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AnimNotifyState_GSBase_GSNotifyBegin_Delay;

// Function b1.AnimNotifyState_GSBase.GSNotifyBeginCS
// 0x0050 (0x0050 - 0x0000)
struct AnimNotifyState_GSBase_GSNotifyBeginCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0048)(Parm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	float                                         TotalDuration;                                     // 0x0048(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AnimNotifyState_GSBase_GSNotifyBeginCS;

// Function b1.AnimNotifyState_GSBase.GSNotifyDebugPostBeginCS
// 0x0050 (0x0050 - 0x0000)
struct AnimNotifyState_GSBase_GSNotifyDebugPostBeginCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0048)(Parm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0048(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AnimNotifyState_GSBase_GSNotifyDebugPostBeginCS;

// Function b1.AnimNotifyState_GSBase.GSNotifyDebugPostEndCS
// 0x0050 (0x0050 - 0x0000)
struct AnimNotifyState_GSBase_GSNotifyDebugPostEndCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0048)(Parm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0048(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AnimNotifyState_GSBase_GSNotifyDebugPostEndCS;

// Function b1.AnimNotifyState_GSBase.GSNotifyDebugPostTickCS
// 0x0050 (0x0050 - 0x0000)
struct AnimNotifyState_GSBase_GSNotifyDebugPostTickCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0048)(Parm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0048(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AnimNotifyState_GSBase_GSNotifyDebugPostTickCS;

// Function b1.AnimNotifyState_GSBase.GSNotifyDebugPreBeginCS
// 0x0050 (0x0050 - 0x0000)
struct AnimNotifyState_GSBase_GSNotifyDebugPreBeginCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0048)(Parm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0048(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AnimNotifyState_GSBase_GSNotifyDebugPreBeginCS;

// Function b1.AnimNotifyState_GSBase.GSNotifyDebugPreEndCS
// 0x0050 (0x0050 - 0x0000)
struct AnimNotifyState_GSBase_GSNotifyDebugPreEndCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0048)(Parm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0048(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AnimNotifyState_GSBase_GSNotifyDebugPreEndCS;

// Function b1.AnimNotifyState_GSBase.GSNotifyDebugPreTickCS
// 0x0050 (0x0050 - 0x0000)
struct AnimNotifyState_GSBase_GSNotifyDebugPreTickCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0048)(Parm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0048(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AnimNotifyState_GSBase_GSNotifyDebugPreTickCS;

// Function b1.AnimNotifyState_GSBase.GSNotifyEnd_Delay
// 0x0048 (0x0048 - 0x0000)
struct AnimNotifyState_GSBase_GSNotifyEnd_Delay final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0048)(Parm, OutParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AnimNotifyState_GSBase_GSNotifyEnd_Delay;

// Function b1.AnimNotifyState_GSBase.GSNotifyEndCS
// 0x0048 (0x0048 - 0x0000)
struct AnimNotifyState_GSBase_GSNotifyEndCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0048)(Parm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AnimNotifyState_GSBase_GSNotifyEndCS;

// Function b1.AnimNotifyState_GSBase.GSNotifyTick_Delay
// 0x0050 (0x0050 - 0x0000)
struct AnimNotifyState_GSBase_GSNotifyTick_Delay final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0048)(Parm, OutParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	float                                         FrameDeltaTime;                                    // 0x0048(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AnimNotifyState_GSBase_GSNotifyTick_Delay;

// Function b1.AnimNotifyState_GSBase.GSNotifyTickCS
// 0x0050 (0x0050 - 0x0000)
struct AnimNotifyState_GSBase_GSNotifyTickCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0048)(Parm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	float                                         FrameDeltaTime;                                    // 0x0048(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AnimNotifyState_GSBase_GSNotifyTickCS;

// Function b1.AnimNotifyState_GSBase.GSOnSectionManuallyChanged
// 0x0010 (0x0010 - 0x0000)
struct AnimNotifyState_GSBase_GSOnSectionManuallyChanged final
{
public:
	class ABGUCharacter*                          OwnerChar;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RemainingDuration;                                 // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AnimNotifyState_GSBase_GSOnSectionManuallyChanged;

// Function b1.AnimNotifyState_GSBase.GSValidateInputCS
// 0x0008 (0x0008 - 0x0000)
struct AnimNotifyState_GSBase_GSValidateInputCS final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AnimNotifyState_GSBase_GSValidateInputCS;

// Function b1.AnimNotifyState_GSBase.UpdateDataOnNotifyStateReplace
// 0x0008 (0x0008 - 0x0000)
struct AnimNotifyState_GSBase_UpdateDataOnNotifyStateReplace final
{
public:
	const class UAnimNotifyState*                 NewNotifyState;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AnimNotifyState_GSBase_UpdateDataOnNotifyStateReplace;

// Function b1.EnvironmentSurfaceEffectMgr.GetEnvironmentSurfaceVolumeByLocation
// 0x0020 (0x0020 - 0x0000)
struct EnvironmentSurfaceEffectMgr_GetEnvironmentSurfaceVolumeByLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ABGWEnvironmentSurfaceVolume*           ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnvironmentSurfaceEffectMgr_GetEnvironmentSurfaceVolumeByLocation;

// Function b1.EnvironmentSurfaceEffectMgr.RegisterVolume
// 0x0028 (0x0028 - 0x0000)
struct EnvironmentSurfaceEffectMgr_RegisterVolume final
{
public:
	TSoftObjectPtr<class ABGWEnvironmentSurfaceVolume> InVolume;                                     // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnvironmentSurfaceEffectMgr_RegisterVolume;

// Function b1.EnvironmentSurfaceEffectMgr.UnregisterVolume
// 0x0030 (0x0030 - 0x0000)
struct EnvironmentSurfaceEffectMgr_UnregisterVolume final
{
public:
	TSoftObjectPtr<class ABGWEnvironmentSurfaceVolume> InVolume;                                     // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsDisableVolume;                                   // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EnvironmentSurfaceEffectMgr_UnregisterVolume;

// Function b1.BGUDebugCircleComponent.SetCircleRadius
// 0x0004 (0x0004 - 0x0000)
struct BGUDebugCircleComponent_SetCircleRadius final
{
public:
	float                                         InCircleRadius;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BGUDebugCircleComponent_SetCircleRadius;

// Function b1.BGUDebugCircleComponent.GetScaledCircleRadius
// 0x0004 (0x0004 - 0x0000)
struct BGUDebugCircleComponent_GetScaledCircleRadius final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BGUDebugCircleComponent_GetScaledCircleRadius;

// Function b1.BGUDebugCircleComponent.GetShapeScale
// 0x0004 (0x0004 - 0x0000)
struct BGUDebugCircleComponent_GetShapeScale final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BGUDebugCircleComponent_GetShapeScale;

// Function b1.BGUDebugCircleComponent.GetUnscaledCircleRadius
// 0x0004 (0x0004 - 0x0000)
struct BGUDebugCircleComponent_GetUnscaledCircleRadius final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BGUDebugCircleComponent_GetUnscaledCircleRadius;

// Function b1.BGUDebugSectorComponent.SetSectorMaxAngle
// 0x0004 (0x0004 - 0x0000)
struct BGUDebugSectorComponent_SetSectorMaxAngle final
{
public:
	float                                         InMaxAngle;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BGUDebugSectorComponent_SetSectorMaxAngle;

// Function b1.BGUDebugSectorComponent.SetSectorMinAngle
// 0x0004 (0x0004 - 0x0000)
struct BGUDebugSectorComponent_SetSectorMinAngle final
{
public:
	float                                         InMinAngle;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BGUDebugSectorComponent_SetSectorMinAngle;

// Function b1.BGUDebugSectorComponent.SetSectorRadius
// 0x0004 (0x0004 - 0x0000)
struct BGUDebugSectorComponent_SetSectorRadius final
{
public:
	float                                         InSectorRadius;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BGUDebugSectorComponent_SetSectorRadius;

// Function b1.BGUDebugSectorComponent.GetScaledSectorRadius
// 0x0004 (0x0004 - 0x0000)
struct BGUDebugSectorComponent_GetScaledSectorRadius final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BGUDebugSectorComponent_GetScaledSectorRadius;

// Function b1.BGUDebugSectorComponent.GetShapeScale
// 0x0004 (0x0004 - 0x0000)
struct BGUDebugSectorComponent_GetShapeScale final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BGUDebugSectorComponent_GetShapeScale;

// Function b1.BGUDebugSectorComponent.GetUnscaledSectorRadius
// 0x0004 (0x0004 - 0x0000)
struct BGUDebugSectorComponent_GetUnscaledSectorRadius final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BGUDebugSectorComponent_GetUnscaledSectorRadius;

// Function b1.BGUEditorTickableActor.GetViewportCameraLocation
// 0x0018 (0x0018 - 0x0000)
struct BGUEditorTickableActor_GetViewportCameraLocation final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BGUEditorTickableActor_GetViewportCameraLocation;

// Function b1.BGUEQSObject.EQSObjRun
// 0x0028 (0x0028 - 0x0000)
struct BGUEQSObject_EQSObjRun final
{
public:
	const class UEnvQuery*                        EnvQueryObj;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Querier;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBGURunEQSObjReason                           Reason;                                            // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGSEQSExParam                          _ExParam;                                          // 0x0014(0x000C)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BGUEQSObject_EQSObjRun;

// Function b1.BGUEQSObject.EQSObjRunInstant
// 0x0030 (0x0030 - 0x0000)
struct BGUEQSObject_EQSObjRunInstant final
{
public:
	const class UEnvQuery*                        EnvQueryObj;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Querier;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        Locations;                                         // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 Scores;                                            // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BGUEQSObject_EQSObjRunInstant;

// Function b1.BGUEQSObject.EQSObjRunInstantWithCustomParams
// 0x0040 (0x0040 - 0x0000)
struct BGUEQSObject_EQSObjRunInstantWithCustomParams final
{
public:
	const class UEnvQuery*                        EnvQueryObj;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Querier;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGSEnvNamedValue>               NamedParams;                                       // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        Locations;                                         // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 Scores;                                            // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BGUEQSObject_EQSObjRunInstantWithCustomParams;

// Function b1.BGUEQSObject.EQSObjRunWithCustomParams
// 0x0030 (0x0030 - 0x0000)
struct BGUEQSObject_EQSObjRunWithCustomParams final
{
public:
	const class UEnvQuery*                        EnvQueryObj;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Querier;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBGURunEQSObjReason                           Reason;                                            // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGSEnvNamedValue>               NamedParams;                                       // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BGUEQSObject_EQSObjRunWithCustomParams;

// Function b1.BGUEQSObject.EQSRun
// 0x0030 (0x0030 - 0x0000)
struct BGUEQSObject_EQSRun final
{
public:
	class FString                                 EQSPath;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Querier;                                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBGURunEQSObjReason                           Reason;                                            // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGSEQSExParam                          _ExParam;                                          // 0x001C(0x000C)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BGUEQSObject_EQSRun;

// Function b1.BGUFluid2DComponent.GetPressureDivergenceTexture
// 0x0008 (0x0008 - 0x0000)
struct BGUFluid2DComponent_GetPressureDivergenceTexture final
{
public:
	class UTextureRenderTarget2D*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BGUFluid2DComponent_GetPressureDivergenceTexture;

// Function b1.BGUFluid2DComponent.GetVeloDensityTexture
// 0x0008 (0x0008 - 0x0000)
struct BGUFluid2DComponent_GetVeloDensityTexture final
{
public:
	class UTextureRenderTarget2D*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BGUFluid2DComponent_GetVeloDensityTexture;

// Function b1.BGU_AIMover.GetRequestID
// 0x0004 (0x0004 - 0x0000)
struct BGU_AIMover_GetRequestID final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BGU_AIMover_GetRequestID;

// Function b1.BGU_AIMover.Init
// 0x0008 (0x0008 - 0x0000)
struct BGU_AIMover_Init final
{
public:
	class AController*                            OwnerAICtrl;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BGU_AIMover_Init;

// Function b1.BGU_AIMover.IsOutOfRange
// 0x0001 (0x0001 - 0x0000)
struct BGU_AIMover_IsOutOfRange final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BGU_AIMover_IsOutOfRange;

// Function b1.BGU_AIMover.IsRequestValid
// 0x0001 (0x0001 - 0x0000)
struct BGU_AIMover_IsRequestValid final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BGU_AIMover_IsRequestValid;

// Function b1.BGU_AIMover.MoveTo
// 0x0030 (0x0030 - 0x0000)
struct BGU_AIMover_MoveTo final
{
public:
	struct FBGU_AIMoverRequest                    request;                                           // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BGU_AIMover_MoveTo;

// Function b1.BGU_AIMover.GetMoveStatus
// 0x0001 (0x0001 - 0x0000)
struct BGU_AIMover_GetMoveStatus final
{
public:
	EPathFollowingStatus                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BGU_AIMover_GetMoveStatus;

// Function b1.BGU_AIMover.GetPathFollowingComponent
// 0x0008 (0x0008 - 0x0000)
struct BGU_AIMover_GetPathFollowingComponent final
{
public:
	class UPathFollowingComponent*                ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BGU_AIMover_GetPathFollowingComponent;

// Function b1.BGUFuncLibData.BGUGetTagEnum
// 0x0018 (0x0018 - 0x0000)
struct BGUFuncLibData_BGUGetTagEnum final
{
public:
	class AActor*                                 Unit;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Tag;                                               // 0x0008(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsValid;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Out;                                               // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BGUFuncLibData_BGUGetTagEnum;

// Function b1.BGUFuncLibData.BGUGetTagFloat
// 0x0018 (0x0018 - 0x0000)
struct BGUFuncLibData_BGUGetTagFloat final
{
public:
	class AActor*                                 Unit;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Tag;                                               // 0x0008(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsValid;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Out;                                               // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BGUFuncLibData_BGUGetTagFloat;

// Function b1.BGUFuncLibData.BGUGetTagFloatByName
// 0x0018 (0x0018 - 0x0000)
struct BGUFuncLibData_BGUGetTagFloatByName final
{
public:
	class AActor*                                 Unit;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TagName;                                           // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsValid;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Out;                                               // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BGUFuncLibData_BGUGetTagFloatByName;

// Function b1.BGUFuncLibData.BGUGetTagInt
// 0x0018 (0x0018 - 0x0000)
struct BGUFuncLibData_BGUGetTagInt final
{
public:
	class AActor*                                 Unit;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Tag;                                               // 0x0008(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsValid;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Out;                                               // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BGUFuncLibData_BGUGetTagInt;

// Function b1.BGUFuncLibData.BGUGetTagIntByName
// 0x0018 (0x0018 - 0x0000)
struct BGUFuncLibData_BGUGetTagIntByName final
{
public:
	class AActor*                                 Unit;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TagName;                                           // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsValid;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Out;                                               // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BGUFuncLibData_BGUGetTagIntByName;

// Function b1.BGUFuncLibData.BGUGetTagName
// 0x0020 (0x0020 - 0x0000)
struct BGUFuncLibData_BGUGetTagName final
{
public:
	class AActor*                                 Unit;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Tag;                                               // 0x0008(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsValid;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Out;                                               // 0x0014(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BGUFuncLibData_BGUGetTagName;

// Function b1.BGUFuncLibData.BGUGetTagObject
// 0x0018 (0x0018 - 0x0000)
struct BGUFuncLibData_BGUGetTagObject final
{
public:
	class AActor*                                 Unit;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Tag;                                               // 0x0008(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BGUFuncLibData_BGUGetTagObject;

// Function b1.BGUFuncLibData.BGUGetTagVector
// 0x0030 (0x0030 - 0x0000)
struct BGUFuncLibData_BGUGetTagVector final
{
public:
	class AActor*                                 Unit;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Tag;                                               // 0x0008(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsValid;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Out;                                               // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BGUFuncLibData_BGUGetTagVector;

// Function b1.BGUFuncLibData.BGUSetTagEnum
// 0x0018 (0x0018 - 0x0000)
struct BGUFuncLibData_BGUSetTagEnum final
{
public:
	class AActor*                                 Unit;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Tag;                                               // 0x0008(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Val;                                               // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BGUFuncLibData_BGUSetTagEnum;

// Function b1.BGUFuncLibData.BGUSetTagFloat
// 0x0018 (0x0018 - 0x0000)
struct BGUFuncLibData_BGUSetTagFloat final
{
public:
	class AActor*                                 Unit;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Tag;                                               // 0x0008(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Val;                                               // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BGUFuncLibData_BGUSetTagFloat;

// Function b1.BGUFuncLibData.BGUSetTagFloatByName
// 0x0018 (0x0018 - 0x0000)
struct BGUFuncLibData_BGUSetTagFloatByName final
{
public:
	class AActor*                                 Unit;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TagName;                                           // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Val;                                               // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BGUFuncLibData_BGUSetTagFloatByName;

// Function b1.BGUFuncLibData.BGUSetTagInt
// 0x0018 (0x0018 - 0x0000)
struct BGUFuncLibData_BGUSetTagInt final
{
public:
	class AActor*                                 Unit;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Tag;                                               // 0x0008(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Val;                                               // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BGUFuncLibData_BGUSetTagInt;

// Function b1.BGUFuncLibData.BGUSetTagIntByName
// 0x0018 (0x0018 - 0x0000)
struct BGUFuncLibData_BGUSetTagIntByName final
{
public:
	class AActor*                                 Unit;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TagName;                                           // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Val;                                               // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BGUFuncLibData_BGUSetTagIntByName;

// Function b1.BGUFuncLibData.BGUSetTagName
// 0x0018 (0x0018 - 0x0000)
struct BGUFuncLibData_BGUSetTagName final
{
public:
	class AActor*                                 Unit;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Tag;                                               // 0x0008(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Val;                                               // 0x0010(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BGUFuncLibData_BGUSetTagName;

// Function b1.BGUFuncLibData.BGUSetTagNameWithGameplayTag
// 0x0018 (0x0018 - 0x0000)
struct BGUFuncLibData_BGUSetTagNameWithGameplayTag final
{
public:
	class AActor*                                 Unit;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Tag;                                               // 0x0008(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Val;                                               // 0x0010(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BGUFuncLibData_BGUSetTagNameWithGameplayTag;

// Function b1.BGUFuncLibData.BGUSetTagObject
// 0x0018 (0x0018 - 0x0000)
struct BGUFuncLibData_BGUSetTagObject final
{
public:
	class AActor*                                 Unit;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Tag;                                               // 0x0008(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                Val;                                               // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BGUFuncLibData_BGUSetTagObject;

// Function b1.BGUFuncLibData.BGUSetTagVector
// 0x0028 (0x0028 - 0x0000)
struct BGUFuncLibData_BGUSetTagVector final
{
public:
	class AActor*                                 Unit;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Tag;                                               // 0x0008(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Val;                                               // 0x0010(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BGUFuncLibData_BGUSetTagVector;

// Function b1.GSEQGBase_ProjectedPoint.AddGeneratedActor
// 0x0008 (0x0008 - 0x0000)
struct GSEQGBase_ProjectedPoint_AddGeneratedActor final
{
public:
	class AActor*                                 GeneratedActor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSEQGBase_ProjectedPoint_AddGeneratedActor;

// Function b1.GSEQGBase_ProjectedPoint.AddGeneratedVector
// 0x0018 (0x0018 - 0x0000)
struct GSEQGBase_ProjectedPoint_AddGeneratedVector final
{
public:
