#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: b1

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "AIModule_structs.hpp"
#include "UnrealExtent_structs.hpp"


namespace SDK
{

// Enum b1.EBGUFSMEventName
// NumValues: 0x000E
enum class EBGUFSMEventName : uint8
{
	FSM_EVENT_LIFE_HASTARGET                 = 0,
	FSM_EVENT_LIFE_GOHOME                    = 10,
	FSM_EVENT_LIFE_ARRIVEHOME                = 11,
	FSM_EVENT_LIFE_GAZEANDSURROUND           = 12,
	FSM_EVENT_LIFE_DIE                       = 1,
	FSM_EVENT_LIFE_REVIVE                    = 2,
	FSM_EVENT_LIFE_STANDBY                   = 3,
	FSM_EVENT_NONCOMBAT_WARNNING             = 4,
	FSM_EVENT_NONCOMBAT_IDLE                 = 5,
	FSM_EVENT_BATTLE_BEHIT                   = 6,
	FSM_EVENT_BATTLE_ATTACK                  = 7,
	FSM_EVENT_BATTLE_WANDER                  = 8,
	FSM_EVENT_BATTLE_STALEMATE               = 9,
	FSM_EVENT_MAX                            = 13,
};

// Enum b1.EBGURunEQSObjReason
// NumValues: 0x0006
enum class EBGURunEQSObjReason : uint8
{
	None                                     = 0,
	Teleport                                 = 1,
	Summon                                   = 2,
	RandomPatrol                             = 3,
	GenPointSet                              = 4,
	EBGURunEQSObjReason_MAX                  = 5,
};

// Enum b1.EGsEnAnimNS
// NumValues: 0x001D
enum class EGsEnAnimNS : uint8
{
	None                                     = 0,
	AttackState                              = 1,
	AttackRotation                           = 2,
	SweepCheck                               = 3,
	ComboWindow                              = 4,
	EditorHelper                             = 5,
	DevLineHit                               = 6,
	AddState                                 = 7,
	AddBuff                                  = 8,
	SlowTime                                 = 9,
	CalcAMScale                              = 10,
	CastDingShen                             = 11,
	SetCurveValueToMesh                      = 12,
	HeadLock                                 = 13,
	HandAndFootLock                          = 14,
	ChangeMoveMode                           = 15,
	ZatoiSPScore                             = 16,
	AMSpeedRate                              = 17,
	AMCurveMove                              = 18,
	Aiming                                   = 19,
	Shooting                                 = 20,
	Casting                                  = 21,
	MoveAttackState                          = 22,
	AISkillFeature                           = 23,
	MontageJumpToSection                     = 24,
	AbortWindow                              = 25,
	SetCurveValueToHair                      = 26,
	SyncAnimation                            = 27,
	Max                                      = 28,
};

// Enum b1.EGsAnimNotifyEventType
// NumValues: 0x000A
enum class EGsAnimNotifyEventType : uint8
{
	Invalid                                  = 0,
	Notify                                   = 1,
	NotifyState_Begin                        = 2,
	NotifyState_Tick                         = 3,
	NotifyState_End                          = 4,
	Notify_Recieved                          = 5,
	NotifyState_Begin_Recieved               = 6,
	NotifyState_Tick_Recieved                = 7,
	NotifyState_End_Recieved                 = 8,
	EGsAnimNotifyEventType_MAX               = 9,
};

// Enum b1.EGsEnAnimN
// NumValues: 0x0004
enum class EGsEnAnimN : uint8
{
	None                                     = 0,
	MontageJumpToSection                     = 1,
	PlayerNiagaraFX                          = 2,
	Max                                      = 3,
};

// Enum b1.EBGDrawDebugType
// NumValues: 0x0004
enum class EBGDrawDebugType : uint8
{
	None                                     = 0,
	Movement                                 = 1,
	QTE                                      = 2,
	MAX                                      = 3,
};

// Enum b1.EGSNetCloseResult
// NumValues: 0x0004
enum class EGSNetCloseResult : uint8
{
	Test                                     = 0,
	Unknown                                  = 1,
	Success                                  = 2,
	EGSNetCloseResult_MAX                    = 3,
};

// Enum b1.ESweepCheckType
// NumValues: 0x0003
enum class ESweepCheckType : uint8
{
	SweepCheck                               = 0,
	AttackWarning                            = 1,
	Max                                      = 2,
};

// Enum b1.ETamerType
// NumValues: 0x0005
enum class ETamerType : uint32
{
	None                                     = 0,
	LevelLoaded                              = 1,
	Spawned                                  = 2,
	Summoned                                 = 3,
	ETamerType_MAX                           = 4,
};

// Enum b1.ECustomTickGroup
// NumValues: 0x0007
enum class ECustomTickGroup : uint8
{
	ECustomTickGroup_None                    = 0,
	PreAnimation                             = 101,
	ParallelMovement                         = 102,
	BeforeStartPhysics                       = 111,
	BeforePostPhysics                        = 141,
	BeforePostUpdateWork                     = 151,
	ECustomTickGroup_MAX                     = 152,
};

// Enum b1.EStartGameInstanceTypeForCS
// NumValues: 0x0008
enum class EStartGameInstanceTypeForCS : uint8
{
	StartCS_UnKnow                           = 0,
	StartCS_StandAlone                       = 1,
	StartCS_DedicateServer                   = 2,
	StartCS_PIE_Standalone                   = 3,
	StartCS_PIE_ListenServer                 = 4,
	StartCS_PIE_Client                       = 5,
	StartCS_PIE_DedicateServer               = 6,
	StartCS_MAX                              = 7,
};

// Enum b1.ESortType
// NumValues: 0x0004
enum class ESortType : uint8
{
	none                                     = 0,
	big_to_small                             = 1,
	small_to_big                             = 2,
	ESortType_MAX                            = 3,
};

// Enum b1.EGSStatType
// NumValues: 0x0005
enum class EGSStatType : uint8
{
	NONE                                     = 0,
	CYCLE                                    = 1,
	MEMORY                                   = 2,
	NUM                                      = 3,
	EGSStatType_MAX                          = 4,
};

// Enum b1.EVolumeStreamingMethod
// NumValues: 0x0004
enum class EVolumeStreamingMethod : uint8
{
	StreamingLevel                           = 0,
	WorldCompositionGroup                    = 1,
	WorldPartition                           = 2,
	EVolumeStreamingMethod_MAX               = 3,
};

// Enum b1.EOnlineActivityOutcomeType
// NumValues: 0x0004
enum class EOnlineActivityOutcomeType : uint8
{
	Completed                                = 0,
	Failed                                   = 1,
	Cancelled                                = 2,
	EOnlineActivityOutcomeType_MAX           = 3,
};

// Enum b1.EFriendsListsType
// NumValues: 0x0005
enum class EFriendsListsType : uint8
{
	Default                                  = 0,
	OnlinePlayers                            = 1,
	InGamePlayers                            = 2,
	InGameAndSessionPlayers                  = 3,
	EFriendsListsType_MAX                    = 4,
};

// Enum b1.EFriendsStateType
// NumValues: 0x0007
enum class EFriendsStateType : uint8
{
	Online                                   = 0,
	Offline                                  = 1,
	Away                                     = 2,
	ExtendedAway                             = 3,
	DoNotDisturb                             = 4,
	Chat                                     = 5,
	EFriendsStateType_MAX                    = 6,
};

// Enum b1.EBGWLoginStatus
// NumValues: 0x0004
enum class EBGWLoginStatus : uint8
{
	NotLoggedIn                              = 0,
	UsingLocalProfile                        = 1,
	LoggedIn                                 = 2,
	EBGWLoginStatus_MAX                      = 3,
};

// Enum b1.EBGWUserPrivileges
// NumValues: 0x0006
enum class EBGWUserPrivileges : uint8
{
	CanPlay                                  = 0,
	CanPlayOnline                            = 1,
	CanCommunicateOnline                     = 2,
	CanUseUserGeneratedContent               = 3,
	CanUserCrossPlay                         = 4,
	EBGWUserPrivileges_MAX                   = 5,
};

// Enum b1.EBGWPrivilegeResult
// NumValues: 0x000B
enum class EBGWPrivilegeResult : uint8
{
	Unknown                                  = 0,
	Available                                = 1,
	UserNotLoggedIn                          = 2,
	LicenseInvalid                           = 3,
	VersionOutdated                          = 4,
	NetworkConnectionUnavailable             = 5,
	AgeRestricted                            = 6,
	AccountTypeRestricted                    = 7,
	AccountUseRestricted                     = 8,
	PlatformFailure                          = 9,
	EBGWPrivilegeResult_MAX                  = 10,
};

// Enum b1.EOnlinePresenceStateType
// NumValues: 0x0007
enum class EOnlinePresenceStateType : uint8
{
	Online                                   = 0,
	Offline                                  = 1,
	Away                                     = 2,
	ExtendedAway                             = 3,
	DoNotDisturb                             = 4,
	Chat                                     = 5,
	EOnlinePresenceStateType_MAX             = 6,
};

// Enum b1.EBGWOnlineSessionState
// NumValues: 0x0009
enum class EBGWOnlineSessionState : uint8
{
	NoSession                                = 0,
	Creating                                 = 1,
	Pending                                  = 2,
	Starting                                 = 3,
	InProgress                               = 4,
	Ending                                   = 5,
	Ended                                    = 6,
	Destroying                               = 7,
	EBGWOnlineSessionState_MAX               = 8,
};

// Enum b1.EBGWOnlineSessionType
// NumValues: 0x0005
enum class EBGWOnlineSessionType : uint8
{
	InvalidSession                           = 0,
	GameSession                              = 1,
	PlayerSession                            = 2,
	PartySession                             = 3,
	EBGWOnlineSessionType_MAX                = 4,
};

// Enum b1.EBGWJoinSessionResult
// NumValues: 0x0007
enum class EBGWJoinSessionResult : uint8
{
	Success                                  = 0,
	SessionIsFull                            = 1,
	SessionDoesNotExist                      = 2,
	CouldNotRetrieveAddress                  = 3,
	AlreadyInSession                         = 4,
	UnknownError                             = 5,
	EBGWJoinSessionResult_MAX                = 6,
};

// Enum b1.EBGWSubsystemType
// NumValues: 0x0008
enum class EBGWSubsystemType : uint8
{
	Unknown                                  = 0,
	NULLL                                    = 1,
	Steam                                    = 2,
	Epic                                     = 3,
	TENCENT                                  = 4,
	GDK                                      = 5,
	PS5                                      = 6,
	EBGWSubsystemType_MAX                    = 7,
};

// Enum b1.ECameraBlendType
// NumValues: 0x0004
enum class ECameraBlendType : uint8
{
	None                                     = 0,
	BlendBySpeed                             = 1,
	BlendByTime                              = 2,
	MAX                                      = 255,
};

// Enum b1.ERefRotatorType
// NumValues: 0x0005
enum class ERefRotatorType : uint8
{
	Zero                                     = 0,
	RefByController                          = 1,
	RefByPlayer                              = 2,
	RefByPlayerQTE                           = 3,
	MAX                                      = 255,
};

// Enum b1.EBGUEQCQueryType
// NumValues: 0x0006
enum class EBGUEQCQueryType : uint8
{
	None                                     = 0,
	SingleActor                              = 1,
	SingleLocation                           = 2,
	ActorSet                                 = 3,
	LocationSet                              = 4,
	EBGUEQCQueryType_MAX                     = 5,
};

// Enum b1.EBUHandFootType
// NumValues: 0x0006
enum class EBUHandFootType : uint8
{
	None                                     = 0,
	LeftHand                                 = 1,
	RightHand                                = 2,
	LeftFoot                                 = 3,
	RightFoot                                = 4,
	EBUHandFootType_MAX                      = 5,
};

// Enum b1.EBUTargetFilter
// NumValues: 0x0005
enum class EBUTargetFilter : uint8
{
	Default                                  = 0,
	MySelf                                   = 1,
	TeamMate                                 = 2,
	Enemy                                    = 4,
	EBUTargetFilter_MAX                      = 5,
};

// Enum b1.EBGUFSMStateName
// NumValues: 0x0010
enum class EBGUFSMStateName : uint8
{
	FSM_STATE_LIFE                           = 0,
	FSM_STATE_LIFE_RETURNHOME                = 9,
	FSM_STATE_LIFE_DEAD                      = 1,
	FSM_STATE_BATTLE                         = 2,
	FSM_STATE_BATTLE_ATTACK                  = 3,
	FSM_STATE_BATTLE_WANDER                  = 4,
	FSM_STATE_BATTLE_STALEMATE               = 5,
	FSM_STATE_NONCOMBAT                      = 6,
	FSM_STATE_NONCOMBAT_WARNNING             = 7,
	FSM_STATE_NONCOMBAT_IDLE                 = 8,
	FSM_STATE_REVOLVEAROUND                  = 11,
	FSM_STATE_NEUTRALANIMAL_PATROL           = 12,
	FSM_STATE_NEUTRALANIMAL_BATTLE           = 13,
	FSM_STATE_NEUTRALANIMAL_ESCAPE           = 14,
	FSM_STATE_INVALID                        = 20,
	FSM_STATE_MAX                            = 21,
};

// Enum b1.ESweepCheckHitFilterType
// NumValues: 0x0004
enum class ESweepCheckHitFilterType : uint8
{
	Zero                                     = 0,
	NotInSameTeam                            = 1,
	FilterMaster                             = 2,
	MAX                                      = 255,
};

// Enum b1.EBeamFXTargetActorType
// NumValues: 0x0004
enum class EBeamFXTargetActorType : uint8
{
	Zero                                     = 0,
	Self                                     = 1,
	CameraLockActor                          = 2,
	MAX                                      = 255,
};

// Enum b1.EGSBlendTypeG
// NumValues: 0x0006
enum class EGSBlendTypeG : uint8
{
	GSNone                                   = 0,
	GSLinear                                 = 1,
	GSEaseIn                                 = 2,
	GSEaseOut                                = 3,
	GSEaseInOut                              = 4,
	MAX                                      = 255,
};

// Enum b1.EGSSweepCheckShapeType
// NumValues: 0x0005
enum class EGSSweepCheckShapeType : uint8
{
	Zero                                     = 0,
	BoxShape                                 = 1,
	SphereShape                              = 2,
	CapsuleShape                             = 3,
	MAX                                      = 255,
};

// Enum b1.EBBKeyType
// NumValues: 0x000C
enum class EBBKeyType : uint8
{
	BOOL_TYPE                                = 0,
	CLASS_TYPE                               = 1,
	ENUM_TYPE                                = 2,
	FLOAT_TYPE                               = 3,
	INT_TYPE                                 = 4,
	NAME_TYPE                                = 5,
	NATIVE_ENUM_TYPE                         = 6,
	OBJECT_TYPE                              = 7,
	ROTATOR_TYPE                             = 8,
	STRING_TYPE                              = 9,
	VECTOR_TYPE                              = 10,
	EBBKeyType_MAX                           = 11,
};

// Enum b1.EBGWStreamingVolumeUsage
// NumValues: 0x0006
enum class EBGWStreamingVolumeUsage : uint8
{
	Loading                                  = 0,
	LoadingAndVisibility                     = 1,
	VisibilityBlockingOnLoad                 = 2,
	BlockingOnLoad                           = 3,
	LoadingNotVisible                        = 4,
	MAX                                      = 5,
};

// Enum b1.ETargetLevelStreamingState
// NumValues: 0x0004
enum class ETargetLevelStreamingState : uint8
{
	RemainCurrent                            = 0,
	HideOnly                                 = 1,
	Unloaded                                 = 2,
	ETargetLevelStreamingState_MAX           = 3,
};

// Enum b1.EGSLevelState
// NumValues: 0x0005
enum class EGSLevelState : uint8
{
	Auto                                     = 0,
	LoadedVisible                            = 1,
	LoadedInvisible                          = 2,
	Unloaded                                 = 3,
	EGSLevelState_MAX                        = 4,
};

// Enum b1.EGSLevelSetResult
// NumValues: 0x0009
enum class EGSLevelSetResult : uint8
{
	Success                                  = 0,
	RefusedByVolume                          = 1,
	LevelNotFound                            = 2,
	NullPtrParam                             = 3,
	WorldTypeError                           = 4,
	UnnecessaryUnload                        = 5,
	BlockedByHotLevelStreaming               = 6,
	UnknownError                             = 7,
	EGSLevelSetResult_MAX                    = 8,
};

// Enum b1.EHitMoveDir
// NumValues: 0x0004
enum class EHitMoveDir : uint8
{
	Default                                  = 0,
	XAxisHitMove                             = 1,
	YAxisHitMove                             = 2,
	EHitMoveDir_MAX                          = 3,
};

// Enum b1.EBGU_PathFindingResult
// NumValues: 0x0004
enum class EBGU_PathFindingResult : uint8
{
	FirstFindingSuccess                      = 0,
	SecondFindingSussess                     = 1,
	Fail                                     = 2,
	EBGU_MAX                                 = 3,
};

// Enum b1.EWeatherType
// NumValues: 0x0004
enum class EWeatherType : uint8
{
	None                                     = 0,
	Snowy                                    = 1,
	Rainy                                    = 2,
	EWeatherType_MAX                         = 3,
};

// Enum b1.EGSPointOnCircleSpacingMethod
// NumValues: 0x0003
enum class EGSPointOnCircleSpacingMethod : uint8
{
	BySpaceBetween                           = 0,
	ByNumberOfPoints                         = 1,
	EGSPointOnCircleSpacingMethod_MAX        = 2,
};

// Enum b1.EGSAngleCenterDirection
// NumValues: 0x0005
enum class EGSAngleCenterDirection : uint8
{
	Forward                                  = 0,
	Back                                     = 1,
	Left                                     = 2,
	Right                                    = 3,
	EGSAngleCenterDirection_MAX              = 4,
};

// Enum b1.EGSEnvTraceMode
// NumValues: 0x0004
enum class EGSEnvTraceMode : uint8
{
	None                                     = 0,
	Navigation                               = 1,
	CapsuleTraceByPawn                       = 2,
	EGSEnvTraceMode_MAX                      = 3,
};

// Enum b1.EGSEnvContextBase
// NumValues: 0x0007
enum class EGSEnvContextBase : uint8
{
	Querier                                  = 0,
	Player                                   = 1,
	PlayerCamera                             = 2,
	SceneItemByTag                           = 3,
	Target                                   = 4,
	CustomActor                              = 5,
	EGSEnvContextBase_MAX                    = 6,
};

// Enum b1.EBGW_DispLibEnvWeather
// NumValues: 0x0009
enum class EBGW_DispLibEnvWeather : uint8
{
	Sunny                                    = 0,
	Mist                                     = 1,
	Rain                                     = 2,
	Fog                                      = 3,
	Snow                                     = 4,
	SandStorm                                = 5,
	Narrative                                = 6,
	Night                                    = 7,
	EBGW_MAX                                 = 8,
};

// ScriptStruct b1.UStCheckShape
// 0x0050 (0x0050 - 0x0000)
struct FUStCheckShape final
{
public:
	bool                                          IsCapsuleShape;                                    // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Rotation;                                          // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Scale;                                             // 0x0020(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SocketName;                                        // 0x003C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 SKComp;                                            // 0x0048(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FUStCheckShape;

// ScriptStruct b1.BGUReplicatedAcceleration
// 0x0003 (0x0003 - 0x0000)
struct FBGUReplicatedAcceleration final
{
public:
	uint8                                         AccelXYRadians;                                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         AccelXYMagnitude;                                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          AccelZ;                                            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBGUReplicatedAcceleration;

// ScriptStruct b1.UStGSHitResult
// 0x0078 (0x0078 - 0x0000)
struct FUStGSHitResult final
{
public:
	struct FVector                                PreCheckLocation;                                  // 0x0000(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                CurCheckLocation;                                  // 0x0018(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Actor;                                             // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ImpactPoint;                                       // 0x0038(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0050(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0058(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Normal;                                            // 0x0060(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FUStGSHitResult;

// ScriptStruct b1.BWC_DispLibEnvSettings
// 0x01E0 (0x01E0 - 0x0000)
struct FBWC_DispLibEnvSettings final
{
public:
	uint8                                         bOverride_SunLightIntensity : 1;                   // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_SunLightColor : 1;                       // 0x0000(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_SunAngle : 1;                            // 0x0000(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_SunInclination : 1;                      // 0x0000(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_SunExtentDawnAndDusk : 1;                // 0x0000(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_SunVolumetricScattering : 1;             // 0x0000(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_SunColorCurve : 1;                       // 0x0000(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MoonLightIntensity : 1;                  // 0x0000(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MoonLightColor : 1;                      // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MoonInclination : 1;                     // 0x0001(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MoonOrbitOffset : 1;                     // 0x0001(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MoonAngle : 1;                           // 0x0001(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MoonVolumetricScattering : 1;            // 0x0001(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_MoonColorCurve : 1;                      // 0x0001(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_SkyLightIntensity : 1;                   // 0x0001(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_SkyLightCubeArray : 1;                   // 0x0001(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_SkyLightColor : 1;                       // 0x0002(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_SkyLightVolumetricScattering : 1;        // 0x0002(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_SkyLightCubeMap : 1;                     // 0x0002(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_FogDensity : 1;                          // 0x0002(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_FogDensityCurve : 1;                     // 0x0002(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_FogHeightFalloff : 1;                    // 0x0002(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_FogScatteringDistribution : 1;           // 0x0002(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_FogExtinctionScale : 1;                  // 0x0002(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_FogStartDistance : 1;                    // 0x0003(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_FogViewDistance : 1;                     // 0x0003(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_FogAlbedoCurve : 1;                      // 0x0003(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_FogEmissiveCurve : 1;                    // 0x0003(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_LocalFogWeatherTexMask : 1;              // 0x0003(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_FogAlbedo : 1;                           // 0x0003(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_FogEmissive : 1;                         // 0x0003(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_FogScatteringColor : 1;                  // 0x0003(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_LocalFogDensityMinMax : 1;               // 0x0004(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_LocalFogAlbedo : 1;                      // 0x0004(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_LocalFogEmissive : 1;                    // 0x0004(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_LocalFogDensityTex : 1;                  // 0x0004(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_LocalFogHeightFalloff : 1;               // 0x0004(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_LocalFogWeatherTexTilingAndFlowDir : 1;  // 0x0004(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_LocalFogDensityTilingScale : 1;          // 0x0004(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_LocalFogStartDistance : 1;               // 0x0004(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_WindStrengthScale : 1;                   // 0x0005(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_WindStrengthCurve : 1;                   // 0x0005(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	EBGW_DispLibEnvWeather                        Weather;                                           // 0x0006(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WeatherProbability;                                // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SunLightIntensity;                                 // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           SunLightColor;                                     // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SunAngle;                                          // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SunInclination;                                    // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SunExtentDawnAndDusk;                              // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SunVolumetricScattering;                           // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           SunColorCurveValue;                                // 0x0030(0x0010)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveLinearColor*                      SunColorCurve;                                     // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MoonLightIntensity;                                // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           MoonLightColor;                                    // 0x004C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MoonInclination;                                   // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MoonOrbitOffset;                                   // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MoonAngle;                                         // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MoonVolumetricScattering;                          // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           MoonColorCurveValue;                               // 0x006C(0x0010)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveLinearColor*                      MoonColorCurve;                                    // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SkyLightIntensity;                                 // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           SkyLightColor;                                     // 0x008C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SkyLightVolumetricScattering;                      // 0x009C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextureCube*                           SkyLightCubeMap;                                   // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SkyLightCubeArrayValue;                            // 0x00A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FogDensity;                                        // 0x00AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FogDensityCurveValue;                              // 0x00B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FogHeightFalloff;                                  // 0x00B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FogScatteringDistribution;                         // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FogExtinctionScale;                                // 0x00BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FogStartDistance;                                  // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FogViewDistance;                                   // 0x00C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           FogAlbedoCurveValue;                               // 0x00C8(0x0010)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           FogEmissiveCurveValue;                             // 0x00D8(0x0010)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           FogScatteringColor;                                // 0x00E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           FogAlbedo;                                         // 0x00F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           FogEmissive;                                       // 0x0108(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            FogDensityCurve;                                   // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveLinearColor*                      FogAlbedoCurve;                                    // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveLinearColor*                      FogEmissiveCurve;                                  // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LocalFogWeatherTexMask;                            // 0x0130(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              LocalFogDensityMinMax;                             // 0x0138(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LocalFogHeightFalloff;                             // 0x0148(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           LocalFogAlbedo;                                    // 0x014C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           LocalFogEmissive;                                  // 0x015C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               LocalFogWeatherTexTilingAndFlowDir;                // 0x0170(0x0020)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UVolumeTexture*                         LocalFogDensityTex;                                // 0x0190(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LocalFogDensityTilingScale;                        // 0x0198(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LocalFogStartDistance;                             // 0x01B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WindStrengthScale;                                 // 0x01B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WindStrengthCurveValue;                            // 0x01B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            WindStrengthCurve;                                 // 0x01C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraSystem*                         WeatherFX;                                         // 0x01C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 WeatherFXActor;                                    // 0x01D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D8[0x8];                                      // 0x01D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FBWC_DispLibEnvSettings;

// ScriptStruct b1.GSEQSExParam
// 0x000C (0x000C - 0x0000)
struct FGSEQSExParam final
{
public:
	EBGURunEQSObjReason                           RunEQSObjReason;                                   // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ExParam_Bool;                                      // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ExParam_Int;                                       // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ExParam_Int2;                                      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGSEQSExParam;

// ScriptStruct b1.GSEnvQueryTestItem
// 0x0040 (0x0040 - 0x0000)
struct FGSEnvQueryTestItem final
{
public:
	struct FVector                                ItemLocation;                                      // 0x0000(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         ContextActors;                                     // 0x0018(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        ContextLocations;                                  // 0x0028(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bContextPerItem;                                   // 0x0038(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGSEnvQueryTestItem;

// ScriptStruct b1.ActorEventReg
// 0x0010 (0x0010 - 0x0000)
struct FActorEventReg final
{
public:
	int32                                         EventID;                                           // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBaseActorComp*                         Comp;                                              // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FActorEventReg;

// ScriptStruct b1.ProjectionData
// 0x000C (0x000C - 0x0000)
struct FProjectionData final
{
public:
	float                                         ExtentX;                                           // 0x0000(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ProjectDown;                                       // 0x0004(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ProjectUp;                                         // 0x0008(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FProjectionData;

// ScriptStruct b1.NotifySoftRefs
// 0x0050 (0x0050 - 0x0000)
struct FNotifySoftRefs final
{
public:
	TSet<struct FSoftObjectPath>                  SoftPaths;                                         // 0x0000(0x0050)(BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNotifySoftRefs;

// ScriptStruct b1.UnorderedObjDict
// 0x0078 (0x0078 - 0x0000)
struct FUnorderedObjDict final
{
public:
	int32                                         mItrIdx;                                           // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         mSize;                                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<int32, int32>                            mKey2Idx;                                          // 0x0008(0x0050)(NativeAccessSpecifierPrivate)
	TArray<int32>                                 mIdx2Key;                                          // 0x0058(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class UObject*>                        mLoopArr;                                          // 0x0068(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FUnorderedObjDict;

// ScriptStruct b1.UStCheckTransformArray
// 0x0010 (0x0010 - 0x0000)
struct FUStCheckTransformArray final
{
public:
	TArray<struct FTransform>                     TransformList;                                     // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FUStCheckTransformArray;

// ScriptStruct b1.CppTestStructInnerInner
// 0x000C (0x000C - 0x0000)
struct FCppTestStructInnerInner final
{
public:
	float                                         FloatVal;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           GameTag;                                           // 0x0004(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCppTestStructInnerInner;

// ScriptStruct b1.UStGSNotifyParam
// 0x0048 (0x0048 - 0x0000)
struct FUStGSNotifyParam final
{
public:
	class UWorld*                                 World;                                             // 0x0000(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Owner;                                             // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurInstanceID;                                     // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FromInstanceID;                                    // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UniqueId;                                          // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0020(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      Animation;                                         // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnimNotifyEvent_LinkValue;                         // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NotifyBeginTime;                                   // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NotifyEndTime;                                     // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   FromSectionName;                                   // 0x003C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FUStGSNotifyParam;

// ScriptStruct b1.UStGSNotifyDelayExecuteContext
// 0x00A8 (0x00A8 - 0x0000)
struct FUStGSNotifyDelayExecuteContext final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0048)(BlueprintVisible, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	EGsAnimNotifyEventType                        NotifyEventType;                                   // 0x0048(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimNotify_GSBase*                     GSNotify;                                          // 0x0050(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimNotifyState_GSBase*                GSNotifyState;                                     // 0x0058(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScaledNotifyStateTotalTime;                        // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FrameDeltaTime;                                    // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAnimNotifyEventReference              EventReference;                                    // 0x0068(0x0028)(BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_90[0x18];                                      // 0x0090(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FUStGSNotifyDelayExecuteContext;

// ScriptStruct b1.UStGSNotifyStateCache
// 0x0020 (0x0020 - 0x0000)
struct FUStGSNotifyStateCache final
{
public:
	TArray<struct FUStGSNotifyParam>              NotifyParams;                                      // 0x0000(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
