#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_AbnormalProgYY

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "b1_Managed_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BI_AbnormalProgYY.BI_AbnormalProgYY_C
// 0x0460 (0x0840 - 0x03E0)
class UBI_AbnormalProgYY_C final : public UBI_AbnormalStateAccBarCS
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AccBar_ClearAnim;                                  // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AccBar_FullAnim;                                   // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AccBar_ShowAnim;                                   // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBI_ProgBar_C*                          BI_ProgBar;                                        // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgDebuffType;                                     // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UIFX_Debuff_Flow;                                  // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UIFXDebuffType;                                    // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   UINS_Debuff_Core_Yang;                             // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   UINS_Debuff_Core_Yin;                              // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateBrush                            BrushProg;                                         // 0x0430(0x00D0)(Edit, BlueprintVisible)
	struct FSlateBrush                            BrushProgBar;                                      // 0x0500(0x00D0)(Edit, BlueprintVisible)
	struct FSlateBrush                            BrushDebuffType;                                   // 0x05D0(0x00D0)(Edit, BlueprintVisible)
	struct FSlateBrush                            BrushUIFXDebuffType;                               // 0x06A0(0x00D0)(Edit, BlueprintVisible)
	struct FSlateBrush                            BrushUIFXDebuffFlow;                               // 0x0770(0x00D0)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BI_AbnormalProgYY(int32 EntryPoint);
	void InitValue();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BI_AbnormalProgYY_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BI_AbnormalProgYY_C")
	}
	static class UBI_AbnormalProgYY_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBI_AbnormalProgYY_C>();
	}
};
DUMPER7_ASSERTS_UBI_AbnormalProgYY_C;

}

