#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_DropExpProg_V2

#include "Basic.hpp"


namespace SDK::Params
{

// Function BI_DropExpProg_V2.BI_DropExpProg_V2_C.ExecuteUbergraph_BI_DropExpProg_V2
// 0x0030 (0x0030 - 0x0000)
struct BI_DropExpProg_V2_C_ExecuteUbergraph_BI_DropExpProg_V2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_EventName_1;                    // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_EventName;                      // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_DropExpProg_V2_C_ExecuteUbergraph_BI_DropExpProg_V2;

// Function BI_DropExpProg_V2.BI_DropExpProg_V2_C.SeqEvent_SpChange
// 0x0010 (0x0010 - 0x0000)
struct BI_DropExpProg_V2_C_SeqEvent_SpChange final
{
public:
	class FString                                 EventName;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_DropExpProg_V2_C_SeqEvent_SpChange;

// Function BI_DropExpProg_V2.BI_DropExpProg_V2_C.SeqEvent_Upgrade
// 0x0010 (0x0010 - 0x0000)
struct BI_DropExpProg_V2_C_SeqEvent_Upgrade final
{
public:
	class FString                                 EventName;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_DropExpProg_V2_C_SeqEvent_Upgrade;

}

