#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_DropItem_Money_V2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "b1_Managed_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BI_DropItem_Money_V2.BI_DropItem_Money_V2_C
// 0x0040 (0x0418 - 0x03D8)
class UBI_DropItem_Money_V2_C final : public UBI_DropSpiritCS
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AnimIncrease;                                      // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimShowHide;                                      // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           BarCon;                                            // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgBar;                                            // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgIcon;                                           // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgIncreBar;                                       // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ResizeCon;                                         // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BI_DropItem_Money_V2(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SeqEvent_Increase(const class FString& EventName);
	void SeqEvent_ShowHide(const class FString& EventName);
	void SequenceEvent__ENTRYPOINTBI_DropItem_Money_V2_0();
	void SequenceEvent__ENTRYPOINTBI_DropItem_Money_V2_1();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BI_DropItem_Money_V2_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BI_DropItem_Money_V2_C")
	}
	static class UBI_DropItem_Money_V2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBI_DropItem_Money_V2_C>();
	}
};
DUMPER7_ASSERTS_UBI_DropItem_Money_V2_C;

}

