#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_EnemyState_DebuffIcon_Poison

#include "Basic.hpp"


namespace SDK::Params
{

// Function BI_EnemyState_DebuffIcon_Poison.BI_EnemyState_DebuffIcon_Poison_C.ExecuteUbergraph_BI_EnemyState_DebuffIcon_Poison
// 0x0018 (0x0018 - 0x0000)
struct BI_EnemyState_DebuffIcon_Poison_C_ExecuteUbergraph_BI_EnemyState_DebuffIcon_Poison final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystemWidget*                   K2Node_CustomEvent_UINS_Effect;                    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   K2Node_CustomEvent_UINS_Effect_1;                  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_EnemyState_DebuffIcon_Poison_C_ExecuteUbergraph_BI_EnemyState_DebuffIcon_Poison;

// Function BI_EnemyState_DebuffIcon_Poison.BI_EnemyState_DebuffIcon_Poison_C.SeqFX_Play
// 0x0008 (0x0008 - 0x0000)
struct BI_EnemyState_DebuffIcon_Poison_C_SeqFX_Play final
{
public:
	class UNiagaraSystemWidget*                   UINS_Effect_0;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_EnemyState_DebuffIcon_Poison_C_SeqFX_Play;

// Function BI_EnemyState_DebuffIcon_Poison.BI_EnemyState_DebuffIcon_Poison_C.SeqFX_Stop
// 0x0008 (0x0008 - 0x0000)
struct BI_EnemyState_DebuffIcon_Poison_C_SeqFX_Stop final
{
public:
	class UNiagaraSystemWidget*                   UINS_Effect_0;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_EnemyState_DebuffIcon_Poison_C_SeqFX_Stop;

// Function BI_EnemyState_DebuffIcon_Poison.BI_EnemyState_DebuffIcon_Poison_C.SequenceEvent__ENTRYPOINTBI_EnemyState_DebuffIcon_Poison_0
// 0x0008 (0x0008 - 0x0000)
struct BI_EnemyState_DebuffIcon_Poison_C_SequenceEvent__ENTRYPOINTBI_EnemyState_DebuffIcon_Poison_0 final
{
public:
	class UNiagaraSystemWidget*                   UINS_Effect_0;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_EnemyState_DebuffIcon_Poison_C_SequenceEvent__ENTRYPOINTBI_EnemyState_DebuffIcon_Poison_0;

// Function BI_EnemyState_DebuffIcon_Poison.BI_EnemyState_DebuffIcon_Poison_C.SequenceEvent__ENTRYPOINTBI_EnemyState_DebuffIcon_Poison_1
// 0x0008 (0x0008 - 0x0000)
struct BI_EnemyState_DebuffIcon_Poison_C_SequenceEvent__ENTRYPOINTBI_EnemyState_DebuffIcon_Poison_1 final
{
public:
	class UNiagaraSystemWidget*                   UINS_Effect_0;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_EnemyState_DebuffIcon_Poison_C_SequenceEvent__ENTRYPOINTBI_EnemyState_DebuffIcon_Poison_1;

}

