#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_EnemyState_DebuffIcon_Burn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "b1_Managed_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BI_EnemyState_DebuffIcon_Burn.BI_EnemyState_DebuffIcon_Burn_C
// 0x0040 (0x0420 - 0x03E0)
class UBI_EnemyState_DebuffIcon_Burn_C final : public UBI_AbnormalStateItemCS
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AnimRefreshState;                                  // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       _____________;                                     // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AKBTriggerFinalEffect;                             // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AKBShowHide;                                       // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ImgIcon;                                           // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UIFX_HighLight;                                    // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   UINS_Effect;                                       // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BI_EnemyState_DebuffIcon_Burn(int32 EntryPoint);
	void SeqFX_Play(class UNiagaraSystemWidget* UINS_Effect_0);
	void SeqFX_Stop(class UNiagaraSystemWidget* UINS_Effect_0);
	void SequenceEvent__ENTRYPOINTBI_EnemyState_DebuffIcon_Burn_0(class UNiagaraSystemWidget* UINS_Effect_0);
	void SequenceEvent__ENTRYPOINTBI_EnemyState_DebuffIcon_Burn_1(class UNiagaraSystemWidget* UINS_Effect_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BI_EnemyState_DebuffIcon_Burn_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BI_EnemyState_DebuffIcon_Burn_C")
	}
	static class UBI_EnemyState_DebuffIcon_Burn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBI_EnemyState_DebuffIcon_Burn_C>();
	}
};
DUMPER7_ASSERTS_UBI_EnemyState_DebuffIcon_Burn_C;

}

