#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_ProgBarHpNew

#include "Basic.hpp"


namespace SDK::Params
{

// Function BI_ProgBarHpNew.BI_ProgBarHpNew_C.ExecuteUbergraph_BI_ProgBarHpNew
// 0x0030 (0x0030 - 0x0000)
struct BI_ProgBarHpNew_C_ExecuteUbergraph_BI_ProgBarHpNew final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystemWidget*                   K2Node_CustomEvent_UINS_Spark_1;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   K2Node_CustomEvent_UINS_SockIn_1;                  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   K2Node_CustomEvent_UINS_SockIn;                    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   K2Node_CustomEvent_UINS_Spark;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_ProgBarHpNew_C_ExecuteUbergraph_BI_ProgBarHpNew;

// Function BI_ProgBarHpNew.BI_ProgBarHpNew_C.FXSpark_Spawn
// 0x0008 (0x0008 - 0x0000)
struct BI_ProgBarHpNew_C_FXSpark_Spawn final
{
public:
	class UNiagaraSystemWidget*                   UINS_Spark_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_ProgBarHpNew_C_FXSpark_Spawn;

// Function BI_ProgBarHpNew.BI_ProgBarHpNew_C.FXSpark_Stop
// 0x0008 (0x0008 - 0x0000)
struct BI_ProgBarHpNew_C_FXSpark_Stop final
{
public:
	class UNiagaraSystemWidget*                   UINS_Spark_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_ProgBarHpNew_C_FXSpark_Stop;

// Function BI_ProgBarHpNew.BI_ProgBarHpNew_C.FXSuckin_Spawn
// 0x0008 (0x0008 - 0x0000)
struct BI_ProgBarHpNew_C_FXSuckin_Spawn final
{
public:
	class UNiagaraSystemWidget*                   UINS_SockIn;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_ProgBarHpNew_C_FXSuckin_Spawn;

// Function BI_ProgBarHpNew.BI_ProgBarHpNew_C.FXSuckin_Stop
// 0x0008 (0x0008 - 0x0000)
struct BI_ProgBarHpNew_C_FXSuckin_Stop final
{
public:
	class UNiagaraSystemWidget*                   UINS_SockIn;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_ProgBarHpNew_C_FXSuckin_Stop;

// Function BI_ProgBarHpNew.BI_ProgBarHpNew_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BI_ProgBarHpNew_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_ProgBarHpNew_C_PreConstruct;

// Function BI_ProgBarHpNew.BI_ProgBarHpNew_C.SequenceEvent__ENTRYPOINTBI_ProgBarHpNew_0
// 0x0008 (0x0008 - 0x0000)
struct BI_ProgBarHpNew_C_SequenceEvent__ENTRYPOINTBI_ProgBarHpNew_0 final
{
public:
	class UNiagaraSystemWidget*                   UINS_Spark_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_ProgBarHpNew_C_SequenceEvent__ENTRYPOINTBI_ProgBarHpNew_0;

// Function BI_ProgBarHpNew.BI_ProgBarHpNew_C.SequenceEvent__ENTRYPOINTBI_ProgBarHpNew_1
// 0x0008 (0x0008 - 0x0000)
struct BI_ProgBarHpNew_C_SequenceEvent__ENTRYPOINTBI_ProgBarHpNew_1 final
{
public:
	class UNiagaraSystemWidget*                   UINS_Spark_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_ProgBarHpNew_C_SequenceEvent__ENTRYPOINTBI_ProgBarHpNew_1;

// Function BI_ProgBarHpNew.BI_ProgBarHpNew_C.SequenceEvent__ENTRYPOINTBI_ProgBarHpNew_2
// 0x0008 (0x0008 - 0x0000)
struct BI_ProgBarHpNew_C_SequenceEvent__ENTRYPOINTBI_ProgBarHpNew_2 final
{
public:
	class UNiagaraSystemWidget*                   UINS_SockIn;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_ProgBarHpNew_C_SequenceEvent__ENTRYPOINTBI_ProgBarHpNew_2;

// Function BI_ProgBarHpNew.BI_ProgBarHpNew_C.SequenceEvent__ENTRYPOINTBI_ProgBarHpNew_3
// 0x0008 (0x0008 - 0x0000)
struct BI_ProgBarHpNew_C_SequenceEvent__ENTRYPOINTBI_ProgBarHpNew_3 final
{
public:
	class UNiagaraSystemWidget*                   UINS_SockIn;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_ProgBarHpNew_C_SequenceEvent__ENTRYPOINTBI_ProgBarHpNew_3;

// Function BI_ProgBarHpNew.BI_ProgBarHpNew_C.SequenceEvent__ENTRYPOINTBI_ProgBarHpNew_4
// 0x0008 (0x0008 - 0x0000)
struct BI_ProgBarHpNew_C_SequenceEvent__ENTRYPOINTBI_ProgBarHpNew_4 final
{
public:
	class UNiagaraSystemWidget*                   UINS_SockIn;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_ProgBarHpNew_C_SequenceEvent__ENTRYPOINTBI_ProgBarHpNew_4;

// Function BI_ProgBarHpNew.BI_ProgBarHpNew_C.SequenceEvent__ENTRYPOINTBI_ProgBarHpNew_5
// 0x0008 (0x0008 - 0x0000)
struct BI_ProgBarHpNew_C_SequenceEvent__ENTRYPOINTBI_ProgBarHpNew_5 final
{
public:
	class UNiagaraSystemWidget*                   UINS_Spark_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_ProgBarHpNew_C_SequenceEvent__ENTRYPOINTBI_ProgBarHpNew_5;

// Function BI_ProgBarHpNew.BI_ProgBarHpNew_C.SequenceEvent__ENTRYPOINTBI_ProgBarHpNew_6
// 0x0008 (0x0008 - 0x0000)
struct BI_ProgBarHpNew_C_SequenceEvent__ENTRYPOINTBI_ProgBarHpNew_6 final
{
public:
	class UNiagaraSystemWidget*                   UINS_Spark_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_ProgBarHpNew_C_SequenceEvent__ENTRYPOINTBI_ProgBarHpNew_6;

}

