#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_ProgBarEnergyNew

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "b1_Managed_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BI_ProgBarEnergyNew.BI_ProgBarEnergyNew_C
// 0x0040 (0x0418 - 0x03D8)
class UBI_ProgBarEnergyNew_C final : public UBI_ProgBarCS
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AKBBarState;                                       // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       _______________;                                   // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimWarnOnceSafe;                                  // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimWarnOnceDanger;                                // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGSProcBar*                             ProgBar;                                           // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProgBG;                                            // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Root;                                              // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BI_ProgBarEnergyNew(int32 EntryPoint);
	void FXSpark_Spawn(class UNiagaraSystemWidget* UINS_Spark);
	void FXSpark_Stop(class UNiagaraSystemWidget* UINS_Spark);
	void FXSuckin_Spawn(class UNiagaraSystemWidget* UINS_SockIn);
	void FXSuckin_Stop(class UNiagaraSystemWidget* UINS_SockIn);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BI_ProgBarEnergyNew_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BI_ProgBarEnergyNew_C")
	}
	static class UBI_ProgBarEnergyNew_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBI_ProgBarEnergyNew_C>();
	}
};
DUMPER7_ASSERTS_UBI_ProgBarEnergyNew_C;

}

