#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_ProgBarMpNew

#include "Basic.hpp"


namespace SDK::Params
{

// Function BI_ProgBarMpNew.BI_ProgBarMpNew_C.ExecuteUbergraph_BI_ProgBarMpNew
// 0x0028 (0x0028 - 0x0000)
struct BI_ProgBarMpNew_C_ExecuteUbergraph_BI_ProgBarMpNew final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystemWidget*                   K2Node_CustomEvent_UINS_Spark_1;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   K2Node_CustomEvent_UINS_SockIn_1;                  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   K2Node_CustomEvent_UINS_SockIn;                    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   K2Node_CustomEvent_UINS_Spark;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_ProgBarMpNew_C_ExecuteUbergraph_BI_ProgBarMpNew;

// Function BI_ProgBarMpNew.BI_ProgBarMpNew_C.FXSpark_Spawn
// 0x0008 (0x0008 - 0x0000)
struct BI_ProgBarMpNew_C_FXSpark_Spawn final
{
public:
	class UNiagaraSystemWidget*                   UINS_Spark_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_ProgBarMpNew_C_FXSpark_Spawn;

// Function BI_ProgBarMpNew.BI_ProgBarMpNew_C.FXSpark_Stop
// 0x0008 (0x0008 - 0x0000)
struct BI_ProgBarMpNew_C_FXSpark_Stop final
{
public:
	class UNiagaraSystemWidget*                   UINS_Spark_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_ProgBarMpNew_C_FXSpark_Stop;

// Function BI_ProgBarMpNew.BI_ProgBarMpNew_C.FXSuckin_Spawn
// 0x0008 (0x0008 - 0x0000)
struct BI_ProgBarMpNew_C_FXSuckin_Spawn final
{
public:
	class UNiagaraSystemWidget*                   UINS_SockIn;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_ProgBarMpNew_C_FXSuckin_Spawn;

// Function BI_ProgBarMpNew.BI_ProgBarMpNew_C.FXSuckin_Stop
// 0x0008 (0x0008 - 0x0000)
struct BI_ProgBarMpNew_C_FXSuckin_Stop final
{
public:
	class UNiagaraSystemWidget*                   UINS_SockIn;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_ProgBarMpNew_C_FXSuckin_Stop;

// Function BI_ProgBarMpNew.BI_ProgBarMpNew_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BI_ProgBarMpNew_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_ProgBarMpNew_C_PreConstruct;

// Function BI_ProgBarMpNew.BI_ProgBarMpNew_C.SequenceEvent__ENTRYPOINTBI_ProgBarMpNew_0
// 0x0008 (0x0008 - 0x0000)
struct BI_ProgBarMpNew_C_SequenceEvent__ENTRYPOINTBI_ProgBarMpNew_0 final
{
public:
	class UNiagaraSystemWidget*                   UINS_Spark_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_ProgBarMpNew_C_SequenceEvent__ENTRYPOINTBI_ProgBarMpNew_0;

// Function BI_ProgBarMpNew.BI_ProgBarMpNew_C.SequenceEvent__ENTRYPOINTBI_ProgBarMpNew_1
// 0x0008 (0x0008 - 0x0000)
struct BI_ProgBarMpNew_C_SequenceEvent__ENTRYPOINTBI_ProgBarMpNew_1 final
{
public:
	class UNiagaraSystemWidget*                   UINS_Spark_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_ProgBarMpNew_C_SequenceEvent__ENTRYPOINTBI_ProgBarMpNew_1;

// Function BI_ProgBarMpNew.BI_ProgBarMpNew_C.SequenceEvent__ENTRYPOINTBI_ProgBarMpNew_2
// 0x0008 (0x0008 - 0x0000)
struct BI_ProgBarMpNew_C_SequenceEvent__ENTRYPOINTBI_ProgBarMpNew_2 final
{
public:
	class UNiagaraSystemWidget*                   UINS_SockIn;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_ProgBarMpNew_C_SequenceEvent__ENTRYPOINTBI_ProgBarMpNew_2;

// Function BI_ProgBarMpNew.BI_ProgBarMpNew_C.SequenceEvent__ENTRYPOINTBI_ProgBarMpNew_3
// 0x0008 (0x0008 - 0x0000)
struct BI_ProgBarMpNew_C_SequenceEvent__ENTRYPOINTBI_ProgBarMpNew_3 final
{
public:
	class UNiagaraSystemWidget*                   UINS_SockIn;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_ProgBarMpNew_C_SequenceEvent__ENTRYPOINTBI_ProgBarMpNew_3;

// Function BI_ProgBarMpNew.BI_ProgBarMpNew_C.SequenceEvent__ENTRYPOINTBI_ProgBarMpNew_4
// 0x0008 (0x0008 - 0x0000)
struct BI_ProgBarMpNew_C_SequenceEvent__ENTRYPOINTBI_ProgBarMpNew_4 final
{
public:
	class UNiagaraSystemWidget*                   UINS_SockIn;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_ProgBarMpNew_C_SequenceEvent__ENTRYPOINTBI_ProgBarMpNew_4;

// Function BI_ProgBarMpNew.BI_ProgBarMpNew_C.SequenceEvent__ENTRYPOINTBI_ProgBarMpNew_5
// 0x0008 (0x0008 - 0x0000)
struct BI_ProgBarMpNew_C_SequenceEvent__ENTRYPOINTBI_ProgBarMpNew_5 final
{
public:
	class UNiagaraSystemWidget*                   UINS_Spark_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_ProgBarMpNew_C_SequenceEvent__ENTRYPOINTBI_ProgBarMpNew_5;

// Function BI_ProgBarMpNew.BI_ProgBarMpNew_C.SequenceEvent__ENTRYPOINTBI_ProgBarMpNew_6
// 0x0008 (0x0008 - 0x0000)
struct BI_ProgBarMpNew_C_SequenceEvent__ENTRYPOINTBI_ProgBarMpNew_6 final
{
public:
	class UNiagaraSystemWidget*                   UINS_Spark_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_ProgBarMpNew_C_SequenceEvent__ENTRYPOINTBI_ProgBarMpNew_6;

}

