#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_PlayerStickLevel_V2

#include "Basic.hpp"


namespace SDK::Params
{

// Function BI_PlayerStickLevel_V2.BI_PlayerStickLevel_V2_C.ExecuteUbergraph_BI_PlayerStickLevel_V2
// 0x0038 (0x0038 - 0x0000)
struct BI_PlayerStickLevel_V2_C_ExecuteUbergraph_BI_PlayerStickLevel_V2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystemWidget*                   K2Node_CustomEvent_UINS_Spark_2;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   K2Node_CustomEvent_UINS_Spark_1;                   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   K2Node_CustomEvent_UINS_Spark;                     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_LightStrength;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   K2Node_CustomEvent_UINS_Sparkle;                   // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_PlayerStickLevel_V2_C_ExecuteUbergraph_BI_PlayerStickLevel_V2;

// Function BI_PlayerStickLevel_V2.BI_PlayerStickLevel_V2_C.getPoseMatValue
// 0x0070 (0x0070 - 0x0000)
struct BI_PlayerStickLevel_V2_C_getPoseMatValue final
{
public:
	class UMaterialInstanceDynamic*               MIDynamic;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ChangeImg;                                         // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ChangeIndex;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ChangeRow;                                         // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LightStrength;                                     // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LightStr_Toggle;                                   // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue;   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue_1; // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue_2; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue_3; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue_4; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_FunctionResult_ChangeImg_WideningCast;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_FunctionResult_ChangeIndex_WideningCast;    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_FunctionResult_ChangeRow_WideningCast;      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_FunctionResult_LightStrength_WideningCast;  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_FunctionResult_LightStr_Toggle_WideningCast; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_PlayerStickLevel_V2_C_getPoseMatValue;

// Function BI_PlayerStickLevel_V2.BI_PlayerStickLevel_V2_C.getProgMatValue
// 0x0048 (0x0048 - 0x0000)
struct BI_PlayerStickLevel_V2_C_getProgMatValue final
{
public:
	class UMaterialInstanceDynamic*               MIDynamic;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Percent;                                           // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ProgBaseTexSize;                                   // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ProgValueMax;                                      // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue;   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue_1; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue_2; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_FunctionResult_Percent_WideningCast;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_FunctionResult_ProgBaseTexSize_WideningCast; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_FunctionResult_ProgValueMax_WideningCast;   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_PlayerStickLevel_V2_C_getProgMatValue;

// Function BI_PlayerStickLevel_V2.BI_PlayerStickLevel_V2_C.NS_SparkActive
// 0x0008 (0x0008 - 0x0000)
struct BI_PlayerStickLevel_V2_C_NS_SparkActive final
{
public:
	class UNiagaraSystemWidget*                   UINS_Spark_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_PlayerStickLevel_V2_C_NS_SparkActive;

// Function BI_PlayerStickLevel_V2.BI_PlayerStickLevel_V2_C.NS_SparkleActive
// 0x0008 (0x0008 - 0x0000)
struct BI_PlayerStickLevel_V2_C_NS_SparkleActive final
{
public:
	class UNiagaraSystemWidget*                   UINS_Sparkle_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_PlayerStickLevel_V2_C_NS_SparkleActive;

// Function BI_PlayerStickLevel_V2.BI_PlayerStickLevel_V2_C.NS_SparkPlay
// 0x0008 (0x0008 - 0x0000)
struct BI_PlayerStickLevel_V2_C_NS_SparkPlay final
{
public:
	class UNiagaraSystemWidget*                   UINS_Spark_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_PlayerStickLevel_V2_C_NS_SparkPlay;

// Function BI_PlayerStickLevel_V2.BI_PlayerStickLevel_V2_C.NS_SparkStop
// 0x0008 (0x0008 - 0x0000)
struct BI_PlayerStickLevel_V2_C_NS_SparkStop final
{
public:
	class UNiagaraSystemWidget*                   UINS_Spark_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_PlayerStickLevel_V2_C_NS_SparkStop;

// Function BI_PlayerStickLevel_V2.BI_PlayerStickLevel_V2_C.PoseLight
// 0x0008 (0x0008 - 0x0000)
struct BI_PlayerStickLevel_V2_C_PoseLight final
{
public:
	double                                        LightStrength;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_PlayerStickLevel_V2_C_PoseLight;

// Function BI_PlayerStickLevel_V2.BI_PlayerStickLevel_V2_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BI_PlayerStickLevel_V2_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_PlayerStickLevel_V2_C_PreConstruct;

// Function BI_PlayerStickLevel_V2.BI_PlayerStickLevel_V2_C.SequenceEvent__ENTRYPOINTBI_PlayerStickLevel_V2_0
// 0x0008 (0x0008 - 0x0000)
struct BI_PlayerStickLevel_V2_C_SequenceEvent__ENTRYPOINTBI_PlayerStickLevel_V2_0 final
{
public:
	class UNiagaraSystemWidget*                   UINS_Spark_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_PlayerStickLevel_V2_C_SequenceEvent__ENTRYPOINTBI_PlayerStickLevel_V2_0;

// Function BI_PlayerStickLevel_V2.BI_PlayerStickLevel_V2_C.SequenceEvent__ENTRYPOINTBI_PlayerStickLevel_V2_1
// 0x0008 (0x0008 - 0x0000)
struct BI_PlayerStickLevel_V2_C_SequenceEvent__ENTRYPOINTBI_PlayerStickLevel_V2_1 final
{
public:
	class UNiagaraSystemWidget*                   UINS_Spark_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_PlayerStickLevel_V2_C_SequenceEvent__ENTRYPOINTBI_PlayerStickLevel_V2_1;

// Function BI_PlayerStickLevel_V2.BI_PlayerStickLevel_V2_C.SequenceEvent__ENTRYPOINTBI_PlayerStickLevel_V2_2
// 0x0008 (0x0008 - 0x0000)
struct BI_PlayerStickLevel_V2_C_SequenceEvent__ENTRYPOINTBI_PlayerStickLevel_V2_2 final
{
public:
	class UNiagaraSystemWidget*                   UINS_Spark_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_PlayerStickLevel_V2_C_SequenceEvent__ENTRYPOINTBI_PlayerStickLevel_V2_2;

// Function BI_PlayerStickLevel_V2.BI_PlayerStickLevel_V2_C.SequenceEvent__ENTRYPOINTBI_PlayerStickLevel_V2_7
// 0x0008 (0x0008 - 0x0000)
struct BI_PlayerStickLevel_V2_C_SequenceEvent__ENTRYPOINTBI_PlayerStickLevel_V2_7 final
{
public:
	class UNiagaraSystemWidget*                   UINS_Spark_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_PlayerStickLevel_V2_C_SequenceEvent__ENTRYPOINTBI_PlayerStickLevel_V2_7;

// Function BI_PlayerStickLevel_V2.BI_PlayerStickLevel_V2_C.SequenceEvent__ENTRYPOINTBI_PlayerStickLevel_V2_8
// 0x0008 (0x0008 - 0x0000)
struct BI_PlayerStickLevel_V2_C_SequenceEvent__ENTRYPOINTBI_PlayerStickLevel_V2_8 final
{
public:
	class UNiagaraSystemWidget*                   UINS_Sparkle_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_PlayerStickLevel_V2_C_SequenceEvent__ENTRYPOINTBI_PlayerStickLevel_V2_8;

}

