#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_PlayerStickLevel_Dot

#include "Basic.hpp"


namespace SDK::Params
{

// Function BI_PlayerStickLevel_Dot.BI_PlayerStickLevel_Dot_C.ExecuteUbergraph_BI_PlayerStickLevel_Dot
// 0x0020 (0x0020 - 0x0000)
struct BI_PlayerStickLevel_Dot_C_ExecuteUbergraph_BI_PlayerStickLevel_Dot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystemWidget*                   K2Node_CustomEvent_UINS_SparkShow_1;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystemWidget*                   K2Node_CustomEvent_UINS_SparkShow;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_PlayerStickLevel_Dot_C_ExecuteUbergraph_BI_PlayerStickLevel_Dot;

// Function BI_PlayerStickLevel_Dot.BI_PlayerStickLevel_Dot_C.PlayFX_SparkShow
// 0x0008 (0x0008 - 0x0000)
struct BI_PlayerStickLevel_Dot_C_PlayFX_SparkShow final
{
public:
	class UNiagaraSystemWidget*                   UINS_SparkShow_0;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_PlayerStickLevel_Dot_C_PlayFX_SparkShow;

// Function BI_PlayerStickLevel_Dot.BI_PlayerStickLevel_Dot_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BI_PlayerStickLevel_Dot_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_PlayerStickLevel_Dot_C_PreConstruct;

// Function BI_PlayerStickLevel_Dot.BI_PlayerStickLevel_Dot_C.SequenceEvent__ENTRYPOINTBI_PlayerStickLevel_Dot_0
// 0x0008 (0x0008 - 0x0000)
struct BI_PlayerStickLevel_Dot_C_SequenceEvent__ENTRYPOINTBI_PlayerStickLevel_Dot_0 final
{
public:
	class UNiagaraSystemWidget*                   UINS_SparkShow_0;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_PlayerStickLevel_Dot_C_SequenceEvent__ENTRYPOINTBI_PlayerStickLevel_Dot_0;

// Function BI_PlayerStickLevel_Dot.BI_PlayerStickLevel_Dot_C.SequenceEvent__ENTRYPOINTBI_PlayerStickLevel_Dot_1
// 0x0008 (0x0008 - 0x0000)
struct BI_PlayerStickLevel_Dot_C_SequenceEvent__ENTRYPOINTBI_PlayerStickLevel_Dot_1 final
{
public:
	class UNiagaraSystemWidget*                   UINS_SparkShow_0;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_PlayerStickLevel_Dot_C_SequenceEvent__ENTRYPOINTBI_PlayerStickLevel_Dot_1;

// Function BI_PlayerStickLevel_Dot.BI_PlayerStickLevel_Dot_C.SequenceEvent__ENTRYPOINTBI_PlayerStickLevel_Dot_2
// 0x0008 (0x0008 - 0x0000)
struct BI_PlayerStickLevel_Dot_C_SequenceEvent__ENTRYPOINTBI_PlayerStickLevel_Dot_2 final
{
public:
	class UNiagaraSystemWidget*                   UINS_SparkShow_0;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_PlayerStickLevel_Dot_C_SequenceEvent__ENTRYPOINTBI_PlayerStickLevel_Dot_2;

// Function BI_PlayerStickLevel_Dot.BI_PlayerStickLevel_Dot_C.SequenceEvent__ENTRYPOINTBI_PlayerStickLevel_Dot_3
// 0x0008 (0x0008 - 0x0000)
struct BI_PlayerStickLevel_Dot_C_SequenceEvent__ENTRYPOINTBI_PlayerStickLevel_Dot_3 final
{
public:
	class UNiagaraSystemWidget*                   UINS_SparkShow_0;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_PlayerStickLevel_Dot_C_SequenceEvent__ENTRYPOINTBI_PlayerStickLevel_Dot_3;

// Function BI_PlayerStickLevel_Dot.BI_PlayerStickLevel_Dot_C.SequenceEvent__ENTRYPOINTBI_PlayerStickLevel_Dot_4
// 0x0008 (0x0008 - 0x0000)
struct BI_PlayerStickLevel_Dot_C_SequenceEvent__ENTRYPOINTBI_PlayerStickLevel_Dot_4 final
{
public:
	class UNiagaraSystemWidget*                   UINS_SparkShow_0;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_PlayerStickLevel_Dot_C_SequenceEvent__ENTRYPOINTBI_PlayerStickLevel_Dot_4;

// Function BI_PlayerStickLevel_Dot.BI_PlayerStickLevel_Dot_C.SequenceEvent__ENTRYPOINTBI_PlayerStickLevel_Dot_5
// 0x0008 (0x0008 - 0x0000)
struct BI_PlayerStickLevel_Dot_C_SequenceEvent__ENTRYPOINTBI_PlayerStickLevel_Dot_5 final
{
public:
	class UNiagaraSystemWidget*                   UINS_SparkShow_0;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_PlayerStickLevel_Dot_C_SequenceEvent__ENTRYPOINTBI_PlayerStickLevel_Dot_5;

// Function BI_PlayerStickLevel_Dot.BI_PlayerStickLevel_Dot_C.SequenceEvent__ENTRYPOINTBI_PlayerStickLevel_Dot_6
// 0x0008 (0x0008 - 0x0000)
struct BI_PlayerStickLevel_Dot_C_SequenceEvent__ENTRYPOINTBI_PlayerStickLevel_Dot_6 final
{
public:
	class UNiagaraSystemWidget*                   UINS_SparkShow_0;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_PlayerStickLevel_Dot_C_SequenceEvent__ENTRYPOINTBI_PlayerStickLevel_Dot_6;

// Function BI_PlayerStickLevel_Dot.BI_PlayerStickLevel_Dot_C.SequenceEvent__ENTRYPOINTBI_PlayerStickLevel_Dot_7
// 0x0008 (0x0008 - 0x0000)
struct BI_PlayerStickLevel_Dot_C_SequenceEvent__ENTRYPOINTBI_PlayerStickLevel_Dot_7 final
{
public:
	class UNiagaraSystemWidget*                   UINS_SparkShow_0;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_PlayerStickLevel_Dot_C_SequenceEvent__ENTRYPOINTBI_PlayerStickLevel_Dot_7;

// Function BI_PlayerStickLevel_Dot.BI_PlayerStickLevel_Dot_C.SequenceEvent__ENTRYPOINTBI_PlayerStickLevel_Dot_8
// 0x0008 (0x0008 - 0x0000)
struct BI_PlayerStickLevel_Dot_C_SequenceEvent__ENTRYPOINTBI_PlayerStickLevel_Dot_8 final
{
public:
	class UNiagaraSystemWidget*                   UINS_SparkShow_0;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_PlayerStickLevel_Dot_C_SequenceEvent__ENTRYPOINTBI_PlayerStickLevel_Dot_8;

// Function BI_PlayerStickLevel_Dot.BI_PlayerStickLevel_Dot_C.StopFX_SparkShow
// 0x0008 (0x0008 - 0x0000)
struct BI_PlayerStickLevel_Dot_C_StopFX_SparkShow final
{
public:
	class UNiagaraSystemWidget*                   UINS_SparkShow_0;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_PlayerStickLevel_Dot_C_StopFX_SparkShow;

}

