#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_PlayerState_DebuffIcon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "b1_Managed_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BI_PlayerState_DebuffIcon.BI_PlayerState_DebuffIcon_C
// 0x0050 (0x0430 - 0x03E0)
class UBI_PlayerState_DebuffIcon_C final : public UBI_PlayerStateItemCS
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AnimRefreshState;                                  // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimLoopTimelimit;                                 // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       _____________;                                     // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimHide;                                          // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimShow;                                          // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AKBShowHide;                                       // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ImgIcon;                                           // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UIFX_Shine;                                        // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   UING_Effect;                                       // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BI_PlayerState_DebuffIcon(int32 EntryPoint);
	void SeqEvent_Hide();
	void SeqEvent_Show();
	void SequenceEvent__ENTRYPOINTBI_PlayerState_DebuffIcon_0();
	void SequenceEvent__ENTRYPOINTBI_PlayerState_DebuffIcon_1();
	void SequenceEvent__ENTRYPOINTBI_PlayerState_DebuffIcon_2();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BI_PlayerState_DebuffIcon_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BI_PlayerState_DebuffIcon_C")
	}
	static class UBI_PlayerState_DebuffIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBI_PlayerState_DebuffIcon_C>();
	}
};
DUMPER7_ASSERTS_UBI_PlayerState_DebuffIcon_C;

}

