#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_ProgBar

#include "Basic.hpp"


namespace SDK::Params
{

// Function BI_ProgBar.BI_ProgBar_C.ExecuteUbergraph_BI_ProgBar
// 0x0008 (0x0008 - 0x0000)
struct BI_ProgBar_C_ExecuteUbergraph_BI_ProgBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_ProgBar_C_ExecuteUbergraph_BI_ProgBar;

// Function BI_ProgBar.BI_ProgBar_C.InitValue
// 0x0018 (0x0018 - 0x0000)
struct BI_ProgBar_C_InitValue final
{
public:
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_2;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_ProgBar_C_InitValue;

// Function BI_ProgBar.BI_ProgBar_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BI_ProgBar_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_ProgBar_C_PreConstruct;

}

