#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_ProgBarMpNew

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "b1_Managed_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BI_ProgBarMpNew.BI_ProgBarMpNew_C
// 0x0060 (0x0438 - 0x03D8)
class UBI_ProgBarMpNew_C final : public UBI_ProgBarCS
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AnimMaxIncShort;                                   // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimMaxInc;                                        // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       __________;                                        // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimWarnOnceSafe;                                  // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimWarnOnceDanger;                                // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Edge;                                              // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGSProcBar*                             ProgBar;                                           // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProgBG;                                            // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Root;                                              // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   UINS_Spark;                                        // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   UINS_SuckIn;                                       // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BI_ProgBarMpNew(int32 EntryPoint);
	void FXSpark_Spawn(class UNiagaraSystemWidget* UINS_Spark_0);
	void FXSpark_Stop(class UNiagaraSystemWidget* UINS_Spark_0);
	void FXSuckin_Spawn(class UNiagaraSystemWidget* UINS_SockIn);
	void FXSuckin_Stop(class UNiagaraSystemWidget* UINS_SockIn);
	void PreConstruct(bool IsDesignTime);
	void SequenceEvent__ENTRYPOINTBI_ProgBarMpNew_0(class UNiagaraSystemWidget* UINS_Spark_0);
	void SequenceEvent__ENTRYPOINTBI_ProgBarMpNew_1(class UNiagaraSystemWidget* UINS_Spark_0);
	void SequenceEvent__ENTRYPOINTBI_ProgBarMpNew_2(class UNiagaraSystemWidget* UINS_SockIn);
	void SequenceEvent__ENTRYPOINTBI_ProgBarMpNew_3(class UNiagaraSystemWidget* UINS_SockIn);
	void SequenceEvent__ENTRYPOINTBI_ProgBarMpNew_4(class UNiagaraSystemWidget* UINS_SockIn);
	void SequenceEvent__ENTRYPOINTBI_ProgBarMpNew_5(class UNiagaraSystemWidget* UINS_Spark_0);
	void SequenceEvent__ENTRYPOINTBI_ProgBarMpNew_6(class UNiagaraSystemWidget* UINS_Spark_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BI_ProgBarMpNew_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BI_ProgBarMpNew_C")
	}
	static class UBI_ProgBarMpNew_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBI_ProgBarMpNew_C>();
	}
};
DUMPER7_ASSERTS_UBI_ProgBarMpNew_C;

}

