#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_SCBase_Item

#include "Basic.hpp"


namespace SDK::Params
{

// Function BI_SCBase_Item.BI_SCBase_Item_C.ExecuteUbergraph_BI_SCBase_Item
// 0x0010 (0x0010 - 0x0000)
struct BI_SCBase_Item_C_ExecuteUbergraph_BI_SCBase_Item final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystemWidget*                   K2Node_CustomEvent_UINS_ItemHide;                  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_SCBase_Item_C_ExecuteUbergraph_BI_SCBase_Item;

// Function BI_SCBase_Item.BI_SCBase_Item_C.PlayFX_ItemHide
// 0x0008 (0x0008 - 0x0000)
struct BI_SCBase_Item_C_PlayFX_ItemHide final
{
public:
	class UNiagaraSystemWidget*                   UINS_ItemHide_0;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_SCBase_Item_C_PlayFX_ItemHide;

// Function BI_SCBase_Item.BI_SCBase_Item_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BI_SCBase_Item_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_SCBase_Item_C_PreConstruct;

// Function BI_SCBase_Item.BI_SCBase_Item_C.SequenceEvent__ENTRYPOINTBI_SCBase_Item_0
// 0x0008 (0x0008 - 0x0000)
struct BI_SCBase_Item_C_SequenceEvent__ENTRYPOINTBI_SCBase_Item_0 final
{
public:
	class UNiagaraSystemWidget*                   UINS_ItemHide_0;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_SCBase_Item_C_SequenceEvent__ENTRYPOINTBI_SCBase_Item_0;

}

