#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_SCBase_Skill_Normal

#include "Basic.hpp"


namespace SDK::Params
{

// Function BI_SCBase_Skill_Normal.BI_SCBase_Skill_Normal_C.ExecuteUbergraph_BI_SCBase_Skill_Normal
// 0x0020 (0x0020 - 0x0000)
struct BI_SCBase_Skill_Normal_C_ExecuteUbergraph_BI_SCBase_Skill_Normal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystemWidget*                   K2Node_CustomEvent_UINS_ItemHide;                  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   K2Node_CustomEvent_UINS_SkillHide;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   K2Node_CustomEvent_UINS_AWeaponHide_5001;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_SCBase_Skill_Normal_C_ExecuteUbergraph_BI_SCBase_Skill_Normal;

// Function BI_SCBase_Skill_Normal.BI_SCBase_Skill_Normal_C.PlayFX_AWeapon
// 0x0008 (0x0008 - 0x0000)
struct BI_SCBase_Skill_Normal_C_PlayFX_AWeapon final
{
public:
	class UNiagaraSystemWidget*                   UINS_AWeaponHide_5001_0;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_SCBase_Skill_Normal_C_PlayFX_AWeapon;

// Function BI_SCBase_Skill_Normal.BI_SCBase_Skill_Normal_C.PlayFX_ItemHide
// 0x0008 (0x0008 - 0x0000)
struct BI_SCBase_Skill_Normal_C_PlayFX_ItemHide final
{
public:
	class UNiagaraSystemWidget*                   UINS_ItemHide;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_SCBase_Skill_Normal_C_PlayFX_ItemHide;

// Function BI_SCBase_Skill_Normal.BI_SCBase_Skill_Normal_C.PlayFX_SkillHide
// 0x0008 (0x0008 - 0x0000)
struct BI_SCBase_Skill_Normal_C_PlayFX_SkillHide final
{
public:
	class UNiagaraSystemWidget*                   UINS_SkillHide_0;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_SCBase_Skill_Normal_C_PlayFX_SkillHide;

// Function BI_SCBase_Skill_Normal.BI_SCBase_Skill_Normal_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BI_SCBase_Skill_Normal_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_SCBase_Skill_Normal_C_PreConstruct;

// Function BI_SCBase_Skill_Normal.BI_SCBase_Skill_Normal_C.SequenceEvent__ENTRYPOINTBI_SCBase_Skill_Normal_0
// 0x0008 (0x0008 - 0x0000)
struct BI_SCBase_Skill_Normal_C_SequenceEvent__ENTRYPOINTBI_SCBase_Skill_Normal_0 final
{
public:
	class UNiagaraSystemWidget*                   UINS_SkillHide_0;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_SCBase_Skill_Normal_C_SequenceEvent__ENTRYPOINTBI_SCBase_Skill_Normal_0;

// Function BI_SCBase_Skill_Normal.BI_SCBase_Skill_Normal_C.SequenceEvent__ENTRYPOINTBI_SCBase_Skill_Normal_1
// 0x0008 (0x0008 - 0x0000)
struct BI_SCBase_Skill_Normal_C_SequenceEvent__ENTRYPOINTBI_SCBase_Skill_Normal_1 final
{
public:
	class UNiagaraSystemWidget*                   UINS_AWeaponHide_5001_0;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_SCBase_Skill_Normal_C_SequenceEvent__ENTRYPOINTBI_SCBase_Skill_Normal_1;

}

