#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_Treasure

#include "Basic.hpp"


namespace SDK::Params
{

// Function BI_Treasure.BI_Treasure_C.ExecuteUbergraph_BI_Treasure
// 0x0030 (0x0030 - 0x0000)
struct BI_Treasure_C_ExecuteUbergraph_BI_Treasure final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystemWidget*                   K2Node_CustomEvent_UINS_Grow;                      // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   K2Node_CustomEvent_UINS_TreasureReady_1;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   K2Node_CustomEvent_UINS_TreasureReady;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   K2Node_CustomEvent_UINS_TreasureHide;              // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_Treasure_C_ExecuteUbergraph_BI_Treasure;

// Function BI_Treasure.BI_Treasure_C.PlayFX_Active
// 0x0008 (0x0008 - 0x0000)
struct BI_Treasure_C_PlayFX_Active final
{
public:
	class UNiagaraSystemWidget*                   UINS_TreasureReady_0;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_Treasure_C_PlayFX_Active;

// Function BI_Treasure.BI_Treasure_C.PlayFX_CDReady
// 0x0008 (0x0008 - 0x0000)
struct BI_Treasure_C_PlayFX_CDReady final
{
public:
	class UNiagaraSystemWidget*                   UINS_Grow;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_Treasure_C_PlayFX_CDReady;

// Function BI_Treasure.BI_Treasure_C.PlayFX_TreasureHide
// 0x0008 (0x0008 - 0x0000)
struct BI_Treasure_C_PlayFX_TreasureHide final
{
public:
	class UNiagaraSystemWidget*                   UINS_TreasureHide_0;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_Treasure_C_PlayFX_TreasureHide;

// Function BI_Treasure.BI_Treasure_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BI_Treasure_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_Treasure_C_PreConstruct;

// Function BI_Treasure.BI_Treasure_C.SequenceEvent__ENTRYPOINTBI_Treasure_0
// 0x0008 (0x0008 - 0x0000)
struct BI_Treasure_C_SequenceEvent__ENTRYPOINTBI_Treasure_0 final
{
public:
	class UNiagaraSystemWidget*                   UINS_TreasureHide_0;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_Treasure_C_SequenceEvent__ENTRYPOINTBI_Treasure_0;

// Function BI_Treasure.BI_Treasure_C.SequenceEvent__ENTRYPOINTBI_Treasure_1
// 0x0008 (0x0008 - 0x0000)
struct BI_Treasure_C_SequenceEvent__ENTRYPOINTBI_Treasure_1 final
{
public:
	class UNiagaraSystemWidget*                   UINS_TreasureReady_0;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_Treasure_C_SequenceEvent__ENTRYPOINTBI_Treasure_1;

// Function BI_Treasure.BI_Treasure_C.SequenceEvent__ENTRYPOINTBI_Treasure_10
// 0x0008 (0x0008 - 0x0000)
struct BI_Treasure_C_SequenceEvent__ENTRYPOINTBI_Treasure_10 final
{
public:
	class UNiagaraSystemWidget*                   UINS_TreasureReady_0;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_Treasure_C_SequenceEvent__ENTRYPOINTBI_Treasure_10;

// Function BI_Treasure.BI_Treasure_C.SequenceEvent__ENTRYPOINTBI_Treasure_2
// 0x0008 (0x0008 - 0x0000)
struct BI_Treasure_C_SequenceEvent__ENTRYPOINTBI_Treasure_2 final
{
public:
	class UNiagaraSystemWidget*                   UINS_TreasureReady_0;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_Treasure_C_SequenceEvent__ENTRYPOINTBI_Treasure_2;

// Function BI_Treasure.BI_Treasure_C.SequenceEvent__ENTRYPOINTBI_Treasure_3
// 0x0008 (0x0008 - 0x0000)
struct BI_Treasure_C_SequenceEvent__ENTRYPOINTBI_Treasure_3 final
{
public:
	class UNiagaraSystemWidget*                   UINS_TreasureReady_0;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_Treasure_C_SequenceEvent__ENTRYPOINTBI_Treasure_3;

// Function BI_Treasure.BI_Treasure_C.SequenceEvent__ENTRYPOINTBI_Treasure_4
// 0x0008 (0x0008 - 0x0000)
struct BI_Treasure_C_SequenceEvent__ENTRYPOINTBI_Treasure_4 final
{
public:
	class UNiagaraSystemWidget*                   UINS_TreasureReady_0;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_Treasure_C_SequenceEvent__ENTRYPOINTBI_Treasure_4;

// Function BI_Treasure.BI_Treasure_C.SequenceEvent__ENTRYPOINTBI_Treasure_5
// 0x0008 (0x0008 - 0x0000)
struct BI_Treasure_C_SequenceEvent__ENTRYPOINTBI_Treasure_5 final
{
public:
	class UNiagaraSystemWidget*                   UINS_TreasureReady_0;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_Treasure_C_SequenceEvent__ENTRYPOINTBI_Treasure_5;

// Function BI_Treasure.BI_Treasure_C.SequenceEvent__ENTRYPOINTBI_Treasure_6
// 0x0008 (0x0008 - 0x0000)
struct BI_Treasure_C_SequenceEvent__ENTRYPOINTBI_Treasure_6 final
{
public:
	class UNiagaraSystemWidget*                   UINS_Grow;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_Treasure_C_SequenceEvent__ENTRYPOINTBI_Treasure_6;

// Function BI_Treasure.BI_Treasure_C.SequenceEvent__ENTRYPOINTBI_Treasure_7
// 0x0008 (0x0008 - 0x0000)
struct BI_Treasure_C_SequenceEvent__ENTRYPOINTBI_Treasure_7 final
{
public:
	class UNiagaraSystemWidget*                   UINS_TreasureReady_0;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_Treasure_C_SequenceEvent__ENTRYPOINTBI_Treasure_7;

// Function BI_Treasure.BI_Treasure_C.SequenceEvent__ENTRYPOINTBI_Treasure_8
// 0x0008 (0x0008 - 0x0000)
struct BI_Treasure_C_SequenceEvent__ENTRYPOINTBI_Treasure_8 final
{
public:
	class UNiagaraSystemWidget*                   UINS_TreasureReady_0;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_Treasure_C_SequenceEvent__ENTRYPOINTBI_Treasure_8;

// Function BI_Treasure.BI_Treasure_C.SequenceEvent__ENTRYPOINTBI_Treasure_9
// 0x0008 (0x0008 - 0x0000)
struct BI_Treasure_C_SequenceEvent__ENTRYPOINTBI_Treasure_9 final
{
public:
	class UNiagaraSystemWidget*                   UINS_TreasureReady_0;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_Treasure_C_SequenceEvent__ENTRYPOINTBI_Treasure_9;

// Function BI_Treasure.BI_Treasure_C.StopFX_Active
// 0x0008 (0x0008 - 0x0000)
struct BI_Treasure_C_StopFX_Active final
{
public:
	class UNiagaraSystemWidget*                   UINS_TreasureReady_0;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_Treasure_C_StopFX_Active;

}

