#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_TransStyleBase_24

#include "Basic.hpp"


namespace SDK::Params
{

// Function BI_TransStyleBase_24.BI_TransStyleBase_24_C.ExecuteUbergraph_BI_TransStyleBase_24
// 0x0020 (0x0020 - 0x0000)
struct BI_TransStyleBase_24_C_ExecuteUbergraph_BI_TransStyleBase_24 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystemWidget*                   K2Node_CustomEvent_UINS_Spark_2;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   K2Node_CustomEvent_UINS_Spark_1;                   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   K2Node_CustomEvent_UINS_Spark;                     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_TransStyleBase_24_C_ExecuteUbergraph_BI_TransStyleBase_24;

// Function BI_TransStyleBase_24.BI_TransStyleBase_24_C.NS_SparkActive
// 0x0008 (0x0008 - 0x0000)
struct BI_TransStyleBase_24_C_NS_SparkActive final
{
public:
	class UNiagaraSystemWidget*                   UINS_Spark_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_TransStyleBase_24_C_NS_SparkActive;

// Function BI_TransStyleBase_24.BI_TransStyleBase_24_C.NS_SparkPlay
// 0x0008 (0x0008 - 0x0000)
struct BI_TransStyleBase_24_C_NS_SparkPlay final
{
public:
	class UNiagaraSystemWidget*                   UINS_Spark_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_TransStyleBase_24_C_NS_SparkPlay;

// Function BI_TransStyleBase_24.BI_TransStyleBase_24_C.NS_SparkStop
// 0x0008 (0x0008 - 0x0000)
struct BI_TransStyleBase_24_C_NS_SparkStop final
{
public:
	class UNiagaraSystemWidget*                   UINS_Spark_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_TransStyleBase_24_C_NS_SparkStop;

// Function BI_TransStyleBase_24.BI_TransStyleBase_24_C.SequenceEvent__ENTRYPOINTBI_TransStyleBase_24_0
// 0x0008 (0x0008 - 0x0000)
struct BI_TransStyleBase_24_C_SequenceEvent__ENTRYPOINTBI_TransStyleBase_24_0 final
{
public:
	class UNiagaraSystemWidget*                   UINS_Spark_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_TransStyleBase_24_C_SequenceEvent__ENTRYPOINTBI_TransStyleBase_24_0;

// Function BI_TransStyleBase_24.BI_TransStyleBase_24_C.SequenceEvent__ENTRYPOINTBI_TransStyleBase_24_1
// 0x0008 (0x0008 - 0x0000)
struct BI_TransStyleBase_24_C_SequenceEvent__ENTRYPOINTBI_TransStyleBase_24_1 final
{
public:
	class UNiagaraSystemWidget*                   UINS_Spark_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_TransStyleBase_24_C_SequenceEvent__ENTRYPOINTBI_TransStyleBase_24_1;

// Function BI_TransStyleBase_24.BI_TransStyleBase_24_C.SequenceEvent__ENTRYPOINTBI_TransStyleBase_24_2
// 0x0008 (0x0008 - 0x0000)
struct BI_TransStyleBase_24_C_SequenceEvent__ENTRYPOINTBI_TransStyleBase_24_2 final
{
public:
	class UNiagaraSystemWidget*                   UINS_Spark_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_TransStyleBase_24_C_SequenceEvent__ENTRYPOINTBI_TransStyleBase_24_2;

}

