#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BotBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "b1_Managed_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BotBase.BP_BotBase_C
// 0x00E0 (0x09E0 - 0x0900)
#pragma pack(push, 0x1)
class alignas(0x10) ABP_BotBase_C : public ABGU_CharacterAI
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0900(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPhysicalAnimationComponent*            PhysicalAnimation;                                 // 0x0908(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        GSInteractSock;                                    // 0x0910(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        GSTopBarSock;                                      // 0x0918(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        DelayTimeToClearArmor;                             // 0x0920(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFlying;                                          // 0x0928(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_929[0x7];                                      // 0x0929(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveVector*                           FlyCurveSetting;                                   // 0x0930(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FlyingTime;                                        // 0x0938(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CfgMinFlyingTime;                                  // 0x0940(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CfgStopCheckVelocity;                              // 0x0948(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CfgBaseBoneName;                                   // 0x0950(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BloodBarRef;                                       // 0x0958(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUseBossBar;                                      // 0x0959(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95A[0x6];                                      // 0x095A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DestroyDelayTimeAfterDead;                         // 0x0960(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsNoUseBar;                                        // 0x0968(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UsePhysicAsset;                                    // 0x0969(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_96A[0x6];                                      // 0x096A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        PhysicBlendAlpha;                                  // 0x0970(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           BoneChainHeadNames;                                // 0x0978(0x0010)(Edit, BlueprintVisible)
	TMap<class FName, double>                     BoneCustomAlpha;                                   // 0x0988(0x0050)(Edit, BlueprintVisible)

public:
	void CalcImpulse(const struct FVector& TargetPoint, const struct FVector& RefPoint, double BaseStrength, double LengthCell, struct FVector* OutImpulse);
	void DemoTickFly(double DeltaTime);
	void DetachWeapon(class AActor* Weapon, class UBoxComponent** WeaponComp);
	void DoPhysicAsset();
	void ExecuteUbergraph_BP_BotBase(int32 EntryPoint);
	void GetBloodBar();
	void InitAnims();
	void InitScoreFilters();
	void ReceiveBeginPlay();
	void SetDefaultInteractInfo();
	void Switch_Debug_Widget_State();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_BotBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_BotBase_C")
	}
	static class ABP_BotBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BotBase_C>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_ABP_BotBase_C;

}

