#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DropItem_Longdage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_DropItemActorBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DropItem_Longdage.BP_DropItem_Longdage_C
// 0x0048 (0x0390 - 0x0348)
class ABP_DropItem_Longdage_C final : public ABP_DropItemActorBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCapsuleComponent*                      BlockCollision;                                    // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 DummySK;                                           // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Dao;                                               // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            TurnOffLightCurve;                                 // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              NewEventDispatcher_0;                              // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_BP_DropItem_Longdage(int32 EntryPoint);
	void DropItemBPFunc(float FloatParam);
	void OnPlayDropEffect();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_DropItem_Longdage_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_DropItem_Longdage_C")
	}
	static class ABP_DropItem_Longdage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DropItem_Longdage_C>();
	}
};
DUMPER7_ASSERTS_ABP_DropItem_Longdage_C;

}

