#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_gs_rt_quality

#include "Basic.hpp"

#include "RT_Parameters_structs.hpp"
#include "Enum_RT_Quality_Preset_structs.hpp"


namespace SDK::Params
{

// Function BP_gs_rt_quality.BP_gs_rt_quality_C.ExecuteUbergraph_BP_gs_rt_quality
// 0x0010 (0x0010 - 0x0000)
struct BP_gs_rt_quality_C_ExecuteUbergraph_BP_gs_rt_quality final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_RT_Quality_Preset                        Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_RT_Quality_Preset                        Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_Event_Quality;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInEnable;                            // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnable;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_RT_Quality_Preset                        K2Node_Select_Default;                             // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_gs_rt_quality_C_ExecuteUbergraph_BP_gs_rt_quality;

// Function BP_gs_rt_quality.BP_gs_rt_quality_C.ForceUpdateRTX
// 0xF690 (0xF690 - 0x0000)
struct BP_gs_rt_quality_C_ForceUpdateRTX final
{
public:
	struct FRT_Parameters                         K2Node_MakeStruct_RT_Parameters;                   // 0x0000(0x1ED0)(HasGetValueTypeHash)
	struct FRT_Parameters                         K2Node_MakeStruct_RT_Parameters_1;                 // 0x1ED0(0x1ED0)(HasGetValueTypeHash)
	struct FRT_Parameters                         K2Node_MakeStruct_RT_Parameters_2;                 // 0x3DA0(0x1ED0)(HasGetValueTypeHash)
	struct FRT_Parameters                         K2Node_MakeStruct_RT_Parameters_3;                 // 0x5C70(0x1ED0)(HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x7B40(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B41[0xF];                                     // 0x7B41(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRT_Parameters                         K2Node_MakeStruct_RT_Parameters_4;                 // 0x7B50(0x1ED0)(HasGetValueTypeHash)
	struct FRT_Parameters                         K2Node_MakeStruct_RT_Parameters_5;                 // 0x9A20(0x1ED0)(HasGetValueTypeHash)
	struct FRT_Parameters                         K2Node_MakeStruct_RT_Parameters_6;                 // 0xB8F0(0x1ED0)(HasGetValueTypeHash)
	struct FRT_Parameters                         K2Node_MakeStruct_RT_Parameters_7;                 // 0xD7C0(0x1ED0)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_gs_rt_quality_C_ForceUpdateRTX;

// Function BP_gs_rt_quality.BP_gs_rt_quality_C.GetRTXQuality
// 0x0001 (0x0001 - 0x0000)
struct BP_gs_rt_quality_C_GetRTXQuality final
{
public:
	uint8                                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_gs_rt_quality_C_GetRTXQuality;

// Function BP_gs_rt_quality.BP_gs_rt_quality_C.IsDLSSRREnabled
// 0x0002 (0x0002 - 0x0000)
struct BP_gs_rt_quality_C_IsDLSSRREnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDLSSRREnabled_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_gs_rt_quality_C_IsDLSSRREnabled;

// Function BP_gs_rt_quality.BP_gs_rt_quality_C.IsRTXEnabled
// 0x0002 (0x0002 - 0x0000)
struct BP_gs_rt_quality_C_IsRTXEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_gs_rt_quality_C_IsRTXEnabled;

// Function BP_gs_rt_quality.BP_gs_rt_quality_C.SetDlssRREnable
// 0x0001 (0x0001 - 0x0000)
struct BP_gs_rt_quality_C_SetDlssRREnable final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_gs_rt_quality_C_SetDlssRREnable;

// Function BP_gs_rt_quality.BP_gs_rt_quality_C.SetRTXEnabled
// 0x0001 (0x0001 - 0x0000)
struct BP_gs_rt_quality_C_SetRTXEnabled final
{
public:
	bool                                          bInEnable;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_gs_rt_quality_C_SetRTXEnabled;

// Function BP_gs_rt_quality.BP_gs_rt_quality_C.SetRTXQuality
// 0x0001 (0x0001 - 0x0000)
struct BP_gs_rt_quality_C_SetRTXQuality final
{
public:
	uint8                                         Quality;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_gs_rt_quality_C_SetRTXQuality;

}

