#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_hys_icedoorinteract

#include "Basic.hpp"

#include "BP_TriggerObjBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_hys_icedoorinteract.BP_hys_icedoorinteract_C
// 0x0028 (0x0368 - 0x0340)
class ABP_hys_icedoorinteract_C final : public ABP_TriggerObjBase_C
{
public:
	class UCineCameraComponent*                   CineCamera;                                        // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBGUAnimationSyncComponent*             BGUAnimationSync;                                  // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        GSInteractSock;                                    // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        InteractTransformF1;                               // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_hys_icedoorinteract_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_hys_icedoorinteract_C")
	}
	static class ABP_hys_icedoorinteract_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_hys_icedoorinteract_C>();
	}
};
DUMPER7_ASSERTS_ABP_hys_icedoorinteract_C;

}

