#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LevelBasedCVars

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LevelBasedCVars.BP_LevelBasedCVars_C
// 0x0060 (0x02E8 - 0x0288)
class ABP_LevelBasedCVars_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         IntCVars;                                          // 0x0298(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         FloatCVars;                                        // 0x02A8(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         BoolCVars;                                         // 0x02B8(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         BeginPlay_CVars;                                   // 0x02C8(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         EndPlay_CVars;                                     // 0x02D8(0x0010)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BP_LevelBasedCVars(int32 EntryPoint);
	void GetConsoleValue();
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_LevelBasedCVars_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_LevelBasedCVars_C")
	}
	static class ABP_LevelBasedCVars_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LevelBasedCVars_C>();
	}
};
DUMPER7_ASSERTS_ABP_LevelBasedCVars_C;

}

