#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Player_Wukong_AnShenShu_01_DISP_MF

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Player_Wukong_AnShenShu_01_DISP_MF.BP_Player_Wukong_AnShenShu_01_DISP_MF_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Player_Wukong_AnShenShu_01_DISP_MF_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Player_Wukong_AnShenShu_01_DISP_MF_C_ReceiveTick;

// Function BP_Player_Wukong_AnShenShu_01_DISP_MF.BP_Player_Wukong_AnShenShu_01_DISP_MF_C.ExecuteUbergraph_BP_Player_Wukong_AnShenShu_01_DISP_MF
// 0x000C (0x000C - 0x0000)
struct BP_Player_Wukong_AnShenShu_01_DISP_MF_C_ExecuteUbergraph_BP_Player_Wukong_AnShenShu_01_DISP_MF final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BGUHasBuffByID_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Player_Wukong_AnShenShu_01_DISP_MF_C_ExecuteUbergraph_BP_Player_Wukong_AnShenShu_01_DISP_MF;

// Function BP_Player_Wukong_AnShenShu_01_DISP_MF.BP_Player_Wukong_AnShenShu_01_DISP_MF_C.CheckDrawSignCondition
// 0x0010 (0x0010 - 0x0000)
struct BP_Player_Wukong_AnShenShu_01_DISP_MF_C_CheckDrawSignCondition final
{
public:
	class AActor*                                 HitActor;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Player_Wukong_AnShenShu_01_DISP_MF_C_CheckDrawSignCondition;

}

