#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RebirthPointZhaoHunFanBase

#include "Basic.hpp"

#include "BP_RebirthPointBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RebirthPointZhaoHunFanBase.BP_RebirthPointZhaoHunFanBase_C
// 0x0048 (0x03F8 - 0x03B0)
class ABP_RebirthPointZhaoHunFanBase_C final : public ABP_RebirthPointBase_C
{
public:
	class UStaticMeshComponent*                   S_Limestone_Rocks_ubordbyda_high_debug;            // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_hgs_jingfan_02a5_debug;                         // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_hgs_jingfan_02a4_debug;                         // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_hgs_jingfan_02a3_debug;                         // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_mesh_empty_debug;                               // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_Limestone_Rocks_ubordbyda_high;                  // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_hgs_jingfan_02a2;                               // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_hgs_jingfan_02a1;                               // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_hgs_jingfan_02a;                                // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_RebirthPointZhaoHunFanBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_RebirthPointZhaoHunFanBase_C")
	}
	static class ABP_RebirthPointZhaoHunFanBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_RebirthPointZhaoHunFanBase_C>();
	}
};
DUMPER7_ASSERTS_ABP_RebirthPointZhaoHunFanBase_C;

}

