#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UI_OP_Check

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_UI_OP_Check.BP_UI_OP_Check_C
// 0x0048 (0x02E0 - 0x0298)
class UBP_UI_OP_Check_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCheckBox*                              OPCheck;                                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_0;                                       // 0x02A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          isCheck;                                           // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CheckName;                                         // 0x02B8(0x0018)(Edit, BlueprintVisible)
	TMulticastInlineDelegate<void()>              OnChildCheckStateChangedEDisp;                     // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnChildCheckStateChanged(bool bIsChecked);
	void ExecuteUbergraph_BP_UI_OP_Check(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_UI_OP_Check_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_UI_OP_Check_C")
	}
	static class UBP_UI_OP_Check_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_UI_OP_Check_C>();
	}
};
DUMPER7_ASSERTS_UBP_UI_OP_Check_C;

}

