#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BUI_SaveTips

#include "Basic.hpp"

#include "b1_Managed_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BUI_SaveTips.BUI_SaveTips_C
// 0x0028 (0x0400 - 0x03D8)
class UBUI_SaveTips_C final : public UBUI_Widget
{
public:
	class UWidgetAnimation*                       AnimShowHide;                                      // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AKBDisplayState;                                   // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimSaveLooping;                                   // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ImgAutoSave;                                       // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgDarkBg;                                         // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BUI_SaveTips_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BUI_SaveTips_C")
	}
	static class UBUI_SaveTips_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBUI_SaveTips_C>();
	}
};
DUMPER7_ASSERTS_UBUI_SaveTips_C;

}

