#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Calliope

#include "Basic.hpp"

#include "Calliope_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "MovieScene_structs.hpp"
#include "LevelSequence_structs.hpp"


namespace SDK::Params
{

// Function Calliope.CalliopeAsset.CreateInstance
// 0x0028 (0x0028 - 0x0000)
struct CalliopeAsset_CreateInstance final
{
public:
	class UObject*                                Owner;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCalliopeAsset*                         CalliopeAsset;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InstancePrefixName;                                // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCalliopeAsset*                         ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeAsset_CreateInstance;

// Function Calliope.CalliopeAsset.AddBranchGraph
// 0x0008 (0x0008 - 0x0000)
struct CalliopeAsset_AddBranchGraph final
{
public:
	class FName                                   GraphName;                                         // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeAsset_AddBranchGraph;

// Function Calliope.CalliopeAsset.AddParameter
// 0x0048 (0x0048 - 0x0000)
struct CalliopeAsset_AddParameter final
{
public:
	EGsManagedParamType                           ParamType;                                         // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ObjectPath;                                        // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ActorGuid;                                         // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AliasName;                                         // 0x0028(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         State;                                             // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCalliopeGuid                          OutConfigGuid;                                     // 0x0034(0x0010)(Parm, OutParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0044(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CalliopeAsset_AddParameter;

// Function Calliope.CalliopeAsset.AssignParameterUnitTamerReference
// 0x0020 (0x0020 - 0x0000)
struct CalliopeAsset_AssignParameterUnitTamerReference final
{
public:
	struct FCalliopeGuid                          InConfigGuid;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ObjectPath;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeAsset_AssignParameterUnitTamerReference;

// Function Calliope.CalliopeAsset.DeactivateNode
// 0x0010 (0x0010 - 0x0000)
struct CalliopeAsset_DeactivateNode final
{
public:
	struct FCalliopeGuid                          InGuid;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeAsset_DeactivateNode;

// Function Calliope.CalliopeAsset.ExportToData
// 0x0001 (0x0001 - 0x0000)
struct CalliopeAsset_ExportToData final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeAsset_ExportToData;

// Function Calliope.CalliopeAsset.GetParamDisplayNameCS
// 0x0038 (0x0038 - 0x0000)
struct CalliopeAsset_GetParamDisplayNameCS final
{
public:
	class FString                                 PropertyName;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCalliopeGuid                          InConfigGuid;                                      // 0x0010(0x0010)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutDisplayName;                                    // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CalliopeAsset_GetParamDisplayNameCS;

// Function Calliope.CalliopeAsset.GetParameterActorGuidByConfigGuid
// 0x0028 (0x0028 - 0x0000)
struct CalliopeAsset_GetParameterActorGuidByConfigGuid final
{
public:
	struct FCalliopeGuid                          InConfigGuid;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutActorGuid;                                      // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CalliopeAsset_GetParameterActorGuidByConfigGuid;

// Function Calliope.CalliopeAsset.GetParameterBuffIDByConfigGuid
// 0x0018 (0x0018 - 0x0000)
struct CalliopeAsset_GetParameterBuffIDByConfigGuid final
{
public:
	struct FCalliopeGuid                          InConfigGuid;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutBuffID;                                         // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CalliopeAsset_GetParameterBuffIDByConfigGuid;

// Function Calliope.CalliopeAsset.GetParameterConfigGuidByActorGuid
// 0x0038 (0x0038 - 0x0000)
struct CalliopeAsset_GetParameterConfigGuidByActorGuid final
{
public:
	EGsManagedParamType                           ParamType;                                         // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ParamValueString;                                  // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ParamValueInt;                                     // 0x0018(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ParamValueName;                                    // 0x001C(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCalliopeGuid                          OutGuid;                                           // 0x0024(0x0010)(Parm, OutParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0034(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CalliopeAsset_GetParameterConfigGuidByActorGuid;

// Function Calliope.CalliopeAsset.GetParameterDisplayNameByConfigGuid
// 0x0038 (0x0038 - 0x0000)
struct CalliopeAsset_GetParameterDisplayNameByConfigGuid final
{
public:
	struct FCalliopeGuid                          InConfigGuid;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InPropertyName;                                    // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutDisplayName;                                    // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CalliopeAsset_GetParameterDisplayNameByConfigGuid;

// Function Calliope.CalliopeAsset.GetParameterSequenceIDByConfigGuid
// 0x0018 (0x0018 - 0x0000)
struct CalliopeAsset_GetParameterSequenceIDByConfigGuid final
{
public:
	struct FCalliopeGuid                          InConfigGuid;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutSequenceID;                                     // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CalliopeAsset_GetParameterSequenceIDByConfigGuid;

// Function Calliope.CalliopeAsset.GetParameterTaskStateIDByConfigGuid
// 0x0018 (0x0018 - 0x0000)
struct CalliopeAsset_GetParameterTaskStateIDByConfigGuid final
{
public:
	struct FCalliopeGuid                          InConfigGuid;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutTaskStageID;                                    // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CalliopeAsset_GetParameterTaskStateIDByConfigGuid;

// Function Calliope.CalliopeAsset.IsAutoClearRecodes
// 0x0001 (0x0001 - 0x0000)
struct CalliopeAsset_IsAutoClearRecodes final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeAsset_IsAutoClearRecodes;

// Function Calliope.CalliopeAsset.OnNodeActivate
// 0x0008 (0x0008 - 0x0000)
struct CalliopeAsset_OnNodeActivate final
{
public:
	const class UCalliopeNode*                    Node;                                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeAsset_OnNodeActivate;

// Function Calliope.CalliopeAsset.OnNodeDeactivate
// 0x0008 (0x0008 - 0x0000)
struct CalliopeAsset_OnNodeDeactivate final
{
public:
	const class UCalliopeNode*                    Node;                                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeAsset_OnNodeDeactivate;

// Function Calliope.CalliopeAsset.OnPropertyChanged
// 0x0020 (0x0020 - 0x0000)
struct CalliopeAsset_OnPropertyChanged final
{
public:
	class FString                                 MemberName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PropertyName;                                      // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeAsset_OnPropertyChanged;

// Function Calliope.CalliopeAsset.PostDuplicateInCS
// 0x0001 (0x0001 - 0x0000)
struct CalliopeAsset_PostDuplicateInCS final
{
public:
	bool                                          bDuplicateForPIE;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeAsset_PostDuplicateInCS;

// Function Calliope.CalliopeAsset.RecordInput
// 0x0018 (0x0018 - 0x0000)
struct CalliopeAsset_RecordInput final
{
public:
	struct FCalliopeGuid                          InGuid;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InPinName;                                         // 0x0010(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeAsset_RecordInput;

// Function Calliope.CalliopeAsset.RecordOnlyNode
// 0x0010 (0x0010 - 0x0000)
struct CalliopeAsset_RecordOnlyNode final
{
public:
	struct FCalliopeGuid                          InGuid;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeAsset_RecordOnlyNode;

// Function Calliope.CalliopeAsset.RecordOutput
// 0x0018 (0x0018 - 0x0000)
struct CalliopeAsset_RecordOutput final
{
public:
	struct FCalliopeGuid                          InGuid;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InPinName;                                         // 0x0010(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeAsset_RecordOutput;

// Function Calliope.CalliopeAsset.RegisterNode
// 0x0018 (0x0018 - 0x0000)
struct CalliopeAsset_RegisterNode final
{
public:
	struct FCalliopeGuid                          NewGuid;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCalliopeNode*                          NewNode;                                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeAsset_RegisterNode;

// Function Calliope.CalliopeAsset.RemoveBranchGraph
// 0x0008 (0x0008 - 0x0000)
struct CalliopeAsset_RemoveBranchGraph final
{
public:
	class FName                                   GraphName;                                         // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeAsset_RemoveBranchGraph;

// Function Calliope.CalliopeAsset.SetSubGraphAssetInPIE
// 0x0018 (0x0018 - 0x0000)
struct CalliopeAsset_SetSubGraphAssetInPIE final
{
public:
	struct FCalliopeGuid                          InGuid;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCalliopeAsset*                         CalliopeAsset;                                     // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeAsset_SetSubGraphAssetInPIE;

// Function Calliope.CalliopeAsset.StartAsSubInstance
// 0x0018 (0x0018 - 0x0000)
struct CalliopeAsset_StartAsSubInstance final
{
public:
	class UCalliopeAsset*                         ParentInstance;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCalliopeGuid                          InSubNodeGuid;                                     // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeAsset_StartAsSubInstance;

// Function Calliope.CalliopeAsset.UnregisterNode
// 0x0010 (0x0010 - 0x0000)
struct CalliopeAsset_UnregisterNode final
{
public:
	struct FCalliopeGuid                          NodeGuid;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeAsset_UnregisterNode;

// Function Calliope.CalliopeAsset.UpdateParameterActorReferenceAndAliasName
// 0x0028 (0x0028 - 0x0000)
struct CalliopeAsset_UpdateParameterActorReferenceAndAliasName final
{
public:
	class FString                                 ObjectPath;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ActorGuid;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AliasName;                                         // 0x0020(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeAsset_UpdateParameterActorReferenceAndAliasName;

// Function Calliope.CalliopeAsset.Focus2Node
// 0x0008 (0x0008 - 0x0000)
struct CalliopeAsset_Focus2Node final
{
public:
	class UCalliopeNode*                          Focus2Node_0;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeAsset_Focus2Node;

// Function Calliope.CalliopeAsset.GetCustomInputs
// 0x0010 (0x0010 - 0x0000)
struct CalliopeAsset_GetCustomInputs final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeAsset_GetCustomInputs;

// Function Calliope.CalliopeAsset.GetCustomOutputs
// 0x0010 (0x0010 - 0x0000)
struct CalliopeAsset_GetCustomOutputs final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeAsset_GetCustomOutputs;

// Function Calliope.CalliopeAsset.GetExtraDefaultInputNodes
// 0x0018 (0x0018 - 0x0000)
struct CalliopeAsset_GetExtraDefaultInputNodes final
{
public:
	TArray<class UClass*>                         OutClasses;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CalliopeAsset_GetExtraDefaultInputNodes;

// Function Calliope.CalliopeAsset.GetExtraDefaultInputNodesInBranchGraph
// 0x0018 (0x0018 - 0x0000)
struct CalliopeAsset_GetExtraDefaultInputNodesInBranchGraph final
{
public:
	TArray<class UClass*>                         OutClasses;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CalliopeAsset_GetExtraDefaultInputNodesInBranchGraph;

// Function Calliope.CalliopeAsset.GetExtraDefaultOutputNodes
// 0x0018 (0x0018 - 0x0000)
struct CalliopeAsset_GetExtraDefaultOutputNodes final
{
public:
	TArray<class UClass*>                         OutClasses;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CalliopeAsset_GetExtraDefaultOutputNodes;

// Function Calliope.CalliopeAsset.GetExtraDefaultOutputNodesInBranchGraph
// 0x0018 (0x0018 - 0x0000)
struct CalliopeAsset_GetExtraDefaultOutputNodesInBranchGraph final
{
public:
	TArray<class UClass*>                         OutClasses;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CalliopeAsset_GetExtraDefaultOutputNodesInBranchGraph;

// Function Calliope.CalliopeAsset.GetNode
// 0x0018 (0x0018 - 0x0000)
struct CalliopeAsset_GetNode final
{
public:
	struct FCalliopeGuid                          InGuid;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCalliopeNode*                          ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeAsset_GetNode;

// Function Calliope.CalliopeAsset.GetNodes
// 0x0050 (0x0050 - 0x0000)
struct CalliopeAsset_GetNodes final
{
public:
	TMap<struct FCalliopeGuid, class UCalliopeNode*> ReturnValue;                                    // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeAsset_GetNodes;

// Function Calliope.CalliopeAsset.GetPossibleParamsCS
// 0x0038 (0x0038 - 0x0000)
struct CalliopeAsset_GetPossibleParamsCS final
{
public:
	class FString                                 ParentPropertyName;                                // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PropertyName;                                      // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCalliopeGuid>                  OutParamArray;                                     // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CalliopeAsset_GetPossibleParamsCS;

// Function Calliope.CalliopeAsset.GetPossibleParamTypeCS
// 0x0038 (0x0038 - 0x0000)
struct CalliopeAsset_GetPossibleParamTypeCS final
{
public:
	class FString                                 ParentPropertyName;                                // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PropertyName;                                      // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<EGsManagedParamType>                   OutParamTypeArray;                                 // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bHasEmptyMatch;                                    // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0034(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeAsset_GetPossibleParamTypeCS;

// Function Calliope.CalliopeAsset.GetRerouteNodeClass
// 0x0008 (0x0008 - 0x0000)
struct CalliopeAsset_GetRerouteNodeClass final
{
public:
	class UClass*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeAsset_GetRerouteNodeClass;

// Function Calliope.CalliopeAsset.GetRerouteNodeClassInBranchGraph
// 0x0008 (0x0008 - 0x0000)
struct CalliopeAsset_GetRerouteNodeClassInBranchGraph final
{
public:
	class UClass*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeAsset_GetRerouteNodeClassInBranchGraph;

// Function Calliope.CalliopeAsset.GetStartNodeClass
// 0x0008 (0x0008 - 0x0000)
struct CalliopeAsset_GetStartNodeClass final
{
public:
	class UClass*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeAsset_GetStartNodeClass;

// Function Calliope.CalliopeAsset.GetStartNodeClassInBranchGraph
// 0x0008 (0x0008 - 0x0000)
struct CalliopeAsset_GetStartNodeClassInBranchGraph final
{
public:
	class UClass*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeAsset_GetStartNodeClassInBranchGraph;

// Function Calliope.CalliopeAsset.GetViewType
// 0x0001 (0x0001 - 0x0000)
struct CalliopeAsset_GetViewType final
{
public:
	ECalliopeViewType                             ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeAsset_GetViewType;

// Function Calliope.CalliopeAsset.IsEditorOnlyCS
// 0x0001 (0x0001 - 0x0000)
struct CalliopeAsset_IsEditorOnlyCS final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeAsset_IsEditorOnlyCS;

// Function Calliope.CalliopeLevelSequenceActor.BindActorByName
// 0x0010 (0x0010 - 0x0000)
struct CalliopeLevelSequenceActor_BindActorByName final
{
public:
	class FName                                   BindingName;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 BindingActor;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeLevelSequenceActor_BindActorByName;

// Function Calliope.CalliopeLevelSequenceActor.BindActorsByTag
// 0x0050 (0x0050 - 0x0000)
struct CalliopeLevelSequenceActor_BindActorsByTag final
{
public:
	TMap<class FName, class AActor*>              TagActors;                                         // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeLevelSequenceActor_BindActorsByTag;

// Function Calliope.CalliopeLevelSequenceActor.MeshPrestreamTextures
// 0x0010 (0x0010 - 0x0000)
struct CalliopeLevelSequenceActor_MeshPrestreamTextures final
{
public:
	class UMeshComponent*                         Mesh;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DurationTimeSeconds;                               // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnable;                                           // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CalliopeLevelSequenceActor_MeshPrestreamTextures;

// Function Calliope.CalliopeLevelSequenceActor.MeshSetClothLocalSpaceSimulation
// 0x0010 (0x0010 - 0x0000)
struct CalliopeLevelSequenceActor_MeshSetClothLocalSpaceSimulation final
{
public:
	class UMeshComponent*                         Mesh;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnable;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CalliopeLevelSequenceActor_MeshSetClothLocalSpaceSimulation;

// Function Calliope.CalliopeLevelSequenceActor.ReSetSequence
// 0x0008 (0x0008 - 0x0000)
struct CalliopeLevelSequenceActor_ReSetSequence final
{
public:
	class ULevelSequence*                         InSequence;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeLevelSequenceActor_ReSetSequence;

// Function Calliope.CalliopeLevelSequenceActor.SetAllMeshPropertyInSequence
// 0x0001 (0x0001 - 0x0000)
struct CalliopeLevelSequenceActor_SetAllMeshPropertyInSequence final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeLevelSequenceActor_SetAllMeshPropertyInSequence;

// Function Calliope.CalliopeLevelSequenceActor.SetAllPerformerTickEnabled
// 0x0058 (0x0058 - 0x0000)
struct CalliopeLevelSequenceActor_SetAllPerformerTickEnabled final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class AActor*>                           OutPerformers;                                     // 0x0008(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeLevelSequenceActor_SetAllPerformerTickEnabled;

// Function Calliope.CalliopeLevelSequenceActor.SetPaused
// 0x0001 (0x0001 - 0x0000)
struct CalliopeLevelSequenceActor_SetPaused final
{
public:
	bool                                          bInPaused;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeLevelSequenceActor_SetPaused;

// Function Calliope.CalliopeLevelSequenceActor.GetBindingTags
// 0x0058 (0x0058 - 0x0000)
struct CalliopeLevelSequenceActor_GetBindingTags final
{
public:
	TSet<class FName>                             OutBindingTags;                                    // 0x0000(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0050(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CalliopeLevelSequenceActor_GetBindingTags;

// Function Calliope.CalliopeFunctionLibrary.MarkDirtyAllCalliopeTrack
// 0x0008 (0x0008 - 0x0000)
struct CalliopeFunctionLibrary_MarkDirtyAllCalliopeTrack final
{
public:
	class UMovieScene*                            InSequence;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeFunctionLibrary_MarkDirtyAllCalliopeTrack;

// Function Calliope.CalliopeGameplayTagLibrary.AddGamePlayTagToINI
// 0x0030 (0x0030 - 0x0000)
struct CalliopeGameplayTagLibrary_AddGamePlayTagToINI final
{
public:
	class FString                                 NewTag;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Comment;                                           // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TagSourceName;                                     // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsRestrictedTag;                                  // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowNonRestrictedChildren;                       // 0x0029(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x002A(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CalliopeGameplayTagLibrary_AddGamePlayTagToINI;

// Function Calliope.CalliopeGameplayTagLibrary.FilterTag
// 0x0050 (0x0050 - 0x0000)
struct CalliopeGameplayTagLibrary_FilterTag final
{
public:
	struct FGameplayTagContainer                  Container;                                         // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Tag;                                               // 0x0020(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExactMatch;                                       // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  ReturnValue;                                       // 0x0030(0x0020)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeGameplayTagLibrary_FilterTag;

// Function Calliope.CalliopeGameplayTagLibrary.FilterTags
// 0x0068 (0x0068 - 0x0000)
struct CalliopeGameplayTagLibrary_FilterTags final
{
public:
	struct FGameplayTagContainer                  Container;                                         // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  OtherContainer;                                    // 0x0020(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bExactMatch;                                       // 0x0040(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  ReturnValue;                                       // 0x0048(0x0020)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeGameplayTagLibrary_FilterTags;

// Function Calliope.CalliopeGameplayTagLibrary.HasTagName
// 0x0030 (0x0030 - 0x0000)
struct CalliopeGameplayTagLibrary_HasTagName final
{
public:
	struct FGameplayTagContainer                  TagContainer;                                      // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   TagName;                                           // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExactMatch;                                       // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0029(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CalliopeGameplayTagLibrary_HasTagName;

// Function Calliope.CalliopeGameplayTagLibrary.MakeGameplayTagContainer
// 0x0020 (0x0020 - 0x0000)
struct CalliopeGameplayTagLibrary_MakeGameplayTagContainer final
{
public:
	struct FGameplayTagContainer                  ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeGameplayTagLibrary_MakeGameplayTagContainer;

// Function Calliope.CalliopeGameplayTagLibrary.MakeGameplayTagFromName
// 0x0010 (0x0010 - 0x0000)
struct CalliopeGameplayTagLibrary_MakeGameplayTagFromName final
{
public:
	class FName                                   TagName;                                           // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeGameplayTagLibrary_MakeGameplayTagFromName;

// Function Calliope.CalliopeGameplayTagLibrary.MakeGameplayTagFromString
// 0x0018 (0x0018 - 0x0000)
struct CalliopeGameplayTagLibrary_MakeGameplayTagFromString final
{
public:
	class FString                                 TagStr;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeGameplayTagLibrary_MakeGameplayTagFromString;

// Function Calliope.CalliopeInteractor.ConvertCalliopeGuidToGuid
// 0x0020 (0x0020 - 0x0000)
struct CalliopeInteractor_ConvertCalliopeGuidToGuid final
{
public:
	struct FCalliopeGuid                          InCalliopeGuid;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeInteractor_ConvertCalliopeGuidToGuid;

// Function Calliope.CalliopeInteractor.GetInstanceChecked
// 0x0008 (0x0008 - 0x0000)
struct CalliopeInteractor_GetInstanceChecked final
{
public:
	class UCalliopeInteractor*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeInteractor_GetInstanceChecked;

// Function Calliope.CalliopeInteractor.RegisterInstance
// 0x0008 (0x0008 - 0x0000)
struct CalliopeInteractor_RegisterInstance final
{
public:
	class UCalliopeInteractor*                    Instance;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeInteractor_RegisterInstance;

// Function Calliope.CalliopeInteractor.GetAssetClass
// 0x0010 (0x0010 - 0x0000)
struct CalliopeInteractor_GetAssetClass final
{
public:
	ECalliopeViewType                             InViewType;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeInteractor_GetAssetClass;

// Function Calliope.CalliopeInteractor.SetCustomInputNodeEventName
// 0x0018 (0x0018 - 0x0000)
struct CalliopeInteractor_SetCustomInputNodeEventName final
{
public:
	class UCalliopeNode*                          Node;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InEventName;                                       // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CalliopeInteractor_SetCustomInputNodeEventName;

// Function Calliope.CalliopeInteractor.SetCustomOutputNodeEventName
// 0x0018 (0x0018 - 0x0000)
struct CalliopeInteractor_SetCustomOutputNodeEventName final
{
public:
	class UCalliopeNode*                          Node;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InEventName;                                       // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CalliopeInteractor_SetCustomOutputNodeEventName;

// Function Calliope.CalliopeInteractor.GetComponentObserverNodeClasses
// 0x0018 (0x0018 - 0x0000)
struct CalliopeInteractor_GetComponentObserverNodeClasses final
{
public:
	TArray<class UClass*>                         OutClasses;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CalliopeInteractor_GetComponentObserverNodeClasses;

// Function Calliope.CalliopeInteractor.GetCustomInputNodeClasses
// 0x0018 (0x0018 - 0x0000)
struct CalliopeInteractor_GetCustomInputNodeClasses final
{
public:
	TArray<class UClass*>                         OutClasses;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CalliopeInteractor_GetCustomInputNodeClasses;

// Function Calliope.CalliopeInteractor.GetCustomInputNodeEventName
// 0x0018 (0x0018 - 0x0000)
struct CalliopeInteractor_GetCustomInputNodeEventName final
{
public:
	class UCalliopeNode*                          Node;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   OutEventName;                                      // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CalliopeInteractor_GetCustomInputNodeEventName;

// Function Calliope.CalliopeInteractor.GetCustomOutputNodeClasses
// 0x0018 (0x0018 - 0x0000)
struct CalliopeInteractor_GetCustomOutputNodeClasses final
{
public:
	TArray<class UClass*>                         OutClasses;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CalliopeInteractor_GetCustomOutputNodeClasses;

// Function Calliope.CalliopeInteractor.GetCustomOutputNodeEventName
// 0x0018 (0x0018 - 0x0000)
struct CalliopeInteractor_GetCustomOutputNodeEventName final
{
public:
	class UCalliopeNode*                          Node;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   OutEventName;                                      // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CalliopeInteractor_GetCustomOutputNodeEventName;

// Function Calliope.CalliopeInteractor.GetExecutionMultiGateNodeClasses
// 0x0018 (0x0018 - 0x0000)
struct CalliopeInteractor_GetExecutionMultiGateNodeClasses final
{
public:
	TArray<class UClass*>                         OutClasses;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CalliopeInteractor_GetExecutionMultiGateNodeClasses;

// Function Calliope.CalliopeInteractor.GetExecutionSequenceNodeClasses
// 0x0018 (0x0018 - 0x0000)
struct CalliopeInteractor_GetExecutionSequenceNodeClasses final
{
public:
	TArray<class UClass*>                         OutClasses;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CalliopeInteractor_GetExecutionSequenceNodeClasses;

// Function Calliope.CalliopeInteractor.GetFinishNodeClasses
// 0x0018 (0x0018 - 0x0000)
struct CalliopeInteractor_GetFinishNodeClasses final
{
public:
	TArray<class UClass*>                         OutClasses;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CalliopeInteractor_GetFinishNodeClasses;

// Function Calliope.CalliopeInteractor.GetRerouteNodeClasses
// 0x0018 (0x0018 - 0x0000)
struct CalliopeInteractor_GetRerouteNodeClasses final
{
public:
	TArray<class UClass*>                         OutClasses;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CalliopeInteractor_GetRerouteNodeClasses;

// Function Calliope.CalliopeInteractor.GetStartNodeClasses
// 0x0018 (0x0018 - 0x0000)
struct CalliopeInteractor_GetStartNodeClasses final
{
public:
	TArray<class UClass*>                         OutClasses;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CalliopeInteractor_GetStartNodeClasses;

// Function Calliope.CalliopeInteractor.GetSubGraphNodeClasses
// 0x0018 (0x0018 - 0x0000)
struct CalliopeInteractor_GetSubGraphNodeClasses final
{
public:
	TArray<class UClass*>                         OutClasses;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CalliopeInteractor_GetSubGraphNodeClasses;

// Function Calliope.CalliopeLevelSequencePlayer.CreateCalliopeLevelSequencePlayer
// 0x0038 (0x0038 - 0x0000)
struct CalliopeLevelSequencePlayer_CreateCalliopeLevelSequencePlayer final
{
public:
