#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CalliopeWin64

#include "Basic.hpp"


namespace SDK::Params
{

// Function CalliopeWin64.CalliopeMoviePipelineSetting.AfterLevelSequenceActorInitializedCS
// 0x0008 (0x0008 - 0x0000)
struct CalliopeMoviePipelineSetting_AfterLevelSequenceActorInitializedCS final
{
public:
	class UMoviePipeline*                         InPipeline;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeMoviePipelineSetting_AfterLevelSequenceActorInitializedCS;

// Function CalliopeWin64.CalliopeMoviePipelineSetting.SequenceBindActorsByTag
// 0x0058 (0x0058 - 0x0000)
struct CalliopeMoviePipelineSetting_SequenceBindActorsByTag final
{
public:
	class UMoviePipeline*                         InPipeline;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, class AActor*>              TagActors;                                         // 0x0008(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeMoviePipelineSetting_SequenceBindActorsByTag;

// Function CalliopeWin64.CalliopeMoviePipelineSetting.SetupForPipelineCS
// 0x0008 (0x0008 - 0x0000)
struct CalliopeMoviePipelineSetting_SetupForPipelineCS final
{
public:
	class UMoviePipeline*                         InPipeline;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeMoviePipelineSetting_SetupForPipelineCS;

// Function CalliopeWin64.CalliopeMoviePipelineSetting.TeardownForPipelineCS
// 0x0008 (0x0008 - 0x0000)
struct CalliopeMoviePipelineSetting_TeardownForPipelineCS final
{
public:
	class UMoviePipeline*                         InPipeline;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeMoviePipelineSetting_TeardownForPipelineCS;

// Function CalliopeWin64.CalliopeMoviePipelineSetting.GetSequenceBindingTags
// 0x0060 (0x0060 - 0x0000)
struct CalliopeMoviePipelineSetting_GetSequenceBindingTags final
{
public:
	class UMoviePipeline*                         InPipeline;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             OutBindingTags;                                    // 0x0008(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0058(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CalliopeMoviePipelineSetting_GetSequenceBindingTags;

// Function CalliopeWin64.CalliopeMoviePipelineSetting.IgnoreTransientFiltersCS
// 0x0001 (0x0001 - 0x0000)
struct CalliopeMoviePipelineSetting_IgnoreTransientFiltersCS final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CalliopeMoviePipelineSetting_IgnoreTransientFiltersCS;

}

