#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Calliope

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "MovieScene_structs.hpp"


namespace SDK
{

// Enum Calliope.ECalliopeViewType
// NumValues: 0x0010
enum class ECalliopeViewType : uint8
{
	None                                     = 0,
	Quest                                    = 1,
	Combo                                    = 2,
	State                                    = 3,
	Behavior                                 = 4,
	Skill                                    = 5,
	Movie                                    = 6,
	Process                                  = 7,
	Task                                     = 8,
	FSM                                      = 9,
	Dialogue                                 = 10,
	Guide                                    = 11,
	BossRush                                 = 12,
	SkillMapping                             = 13,
	TaskStage                                = 14,
	Max                                      = 15,
};

// Enum Calliope.ECalliopeNodeStyle
// NumValues: 0x0008
enum class ECalliopeNodeStyle : uint8
{
	Condition                                = 0,
	Default                                  = 1,
	InOut                                    = 2,
	Latent                                   = 3,
	Logic                                    = 4,
	SubGraph                                 = 5,
	Transit                                  = 6,
	ECalliopeNodeStyle_MAX                   = 7,
};

// Enum Calliope.ECalliopeActivationState
// NumValues: 0x0004
enum class ECalliopeActivationState : uint8
{
	NeverActivated                           = 0,
	Active                                   = 1,
	WasActive                                = 2,
	ECalliopeActivationState_MAX             = 3,
};

// Enum Calliope.ECalliopeNetMode
// NumValues: 0x0006
enum class ECalliopeNetMode : uint8
{
	Any                                      = 0,
	Authority                                = 1,
	ClientOnly                               = 2,
	ServerOnly                               = 3,
	SinglePlayerOnly                         = 4,
	ECalliopeNetMode_MAX                     = 5,
};

// Enum Calliope.EGsDynamicObstacleState
// NumValues: 0x0003
enum class EGsDynamicObstacleState : uint8
{
	Opened                                   = 0,
	Closed                                   = 1,
	EGsDynamicObstacleState_MAX              = 2,
};

// Enum Calliope.EGsOverlapState
// NumValues: 0x0003
enum class EGsOverlapState : uint8
{
	Enabled                                  = 0,
	Disabled                                 = 1,
	EGsOverlapState_MAX                      = 2,
};

// Enum Calliope.EGsInteractorState
// NumValues: 0x0003
enum class EGsInteractorState : uint8
{
	Interactive                              = 0,
	NotInteractive                           = 1,
	EGsInteractorState_MAX                   = 2,
};

// Enum Calliope.EGsSpawnerState
// NumValues: 0x0004
enum class EGsSpawnerState : uint8
{
	Disabled                                 = 0,
	Enabled                                  = 1,
	Spawned                                  = 2,
	EGsSpawnerState_MAX                      = 3,
};

// Enum Calliope.EGsStreamingLevelState
// NumValues: 0x0003
enum class EGsStreamingLevelState : uint8
{
	LoadedAndShown                           = 0,
	Unloaded                                 = 1,
	EGsStreamingLevelState_MAX               = 2,
};

// Enum Calliope.EGsNPCShowState
// NumValues: 0x0003
enum class EGsNPCShowState : uint8
{
	Show                                     = 0,
	Hide                                     = 1,
	EGsNPCShowState_MAX                      = 2,
};

// Enum Calliope.EGsNPCBuffState
// NumValues: 0x0003
enum class EGsNPCBuffState : uint8
{
	Add                                      = 0,
	Remove                                   = 1,
	EGsNPCBuffState_MAX                      = 2,
};

// Enum Calliope.EGsUnitResetType
// NumValues: 0x0007
enum class EGsUnitResetType : uint8
{
	No                                       = 0,
	Destroy                                  = 1,
	Status                                   = 2,
	Spawn                                    = 3,
	StatusWithoutHp                          = 4,
	None                                     = 5,
	EGsUnitResetType_MAX                     = 6,
};

// Enum Calliope.EGsDynamicObstacleManagePolice
// NumValues: 0x0006
enum class EGsDynamicObstacleManagePolice : uint8
{
	SameAsPrevious                           = 0,
	KeepOpen                                 = 1,
	KeepClose                                = 2,
	AsBattleInDoor                           = 3,
	AsBattleOutDoor                          = 4,
	EGsDynamicObstacleManagePolice_MAX       = 5,
};

// Enum Calliope.EGsOverlapManagePolice
// NumValues: 0x0004
enum class EGsOverlapManagePolice : uint8
{
	SameAsPrevious                           = 0,
	KeepEnable                               = 1,
	KeepDisable                              = 2,
	EGsOverlapManagePolice_MAX               = 3,
};

// Enum Calliope.EGsInteractorManagePolice
// NumValues: 0x0004
enum class EGsInteractorManagePolice : uint8
{
	SameAsPrevious                           = 0,
	KeepInteractive                          = 1,
	KeepNotInteractive                       = 2,
	EGsInteractorManagePolice_MAX            = 3,
};

// Enum Calliope.EGsSpawnerManagePolice
// NumValues: 0x0008
enum class EGsSpawnerManagePolice : uint8
{
	SameAsPrevious                           = 0,
	Auto                                     = 1,
	SameAsBattle                             = 2,
	OnlyBeginSameAsBattle                    = 3,
	OnlyEndSameAsBattle                      = 4,
	Disable                                  = 5,
	BeginLikeStateEndLikeBattle              = 6,
	EGsSpawnerManagePolice_MAX               = 7,
};

// Enum Calliope.EGsStreamingLevelManagePolice
// NumValues: 0x0004
enum class EGsStreamingLevelManagePolice : uint8
{
	SameAsPrevious                           = 0,
	DefaultLoadAndShow                       = 1,
	DefaultUnload                            = 2,
	EGsStreamingLevelManagePolice_MAX        = 3,
};

// Enum Calliope.EGsUnitManagePolice
// NumValues: 0x0006
enum class EGsUnitManagePolice : uint8
{
	SameAsPrevious                           = 0,
	Status                                   = 1,
	StatusWithoutHP                          = 2,
	Spawn                                    = 3,
	Destroy                                  = 4,
	EGsUnitManagePolice_MAX                  = 5,
};

// Enum Calliope.EGsManagedParamType
// NumValues: 0x001D
enum class EGsManagedParamType : uint8
{
	None                                     = 0,
	Parameter                                = 1,
	SceneObj                                 = 2,
	DynamicObstacle                          = 3,
	Overlap                                  = 4,
	Interactor                               = 5,
	Spawner                                  = 6,
	Unit                                     = 7,
	NPCUnit                                  = 8,
	GroupUnit                                = 9,
	IntParam                                 = 32,
	SequenceID                               = 33,
	TaskStageID                              = 34,
	BuffID                                   = 35,
	GroupID                                  = 36,
	AiConversationID                         = 37,
	TaskLineID                               = 38,
	NameParam                                = 64,
	ArchiveLabel                             = 65,
	StreamingLevel                           = 66,
	AssociationUnitConfig                    = 67,
	AssociationOnFightSkillID                = 68,
	FollowPartnerConfig                      = 69,
	TeamID                                   = 70,
	IdleAMIdx                                = 71,
	InteractGroupID                          = 72,
	StreamingLevelStateConfig                = 73,
	LeisureAnimIndex                         = 74,
	EGsManagedParamType_MAX                  = 75,
};

// ScriptStruct Calliope.CalliopeGuid
// 0x0010 (0x0010 - 0x0000)
struct FCalliopeGuid final
{
public:
	int32                                         A;                                                 // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         B;                                                 // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         C;                                                 // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         D;                                                 // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCalliopeGuid;

// ScriptStruct Calliope.CalliopePin
// 0x0018 (0x0018 - 0x0000)
struct FCalliopePin final
{
public:
	class FName                                   PinName;                                           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PinToolTip;                                        // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCalliopePin;

// ScriptStruct Calliope.CalliopeConnectedPin
// 0x0018 (0x0018 - 0x0000)
struct FCalliopeConnectedPin final
{
public:
	struct FCalliopeGuid                          NodeGuid;                                          // 0x0000(0x0010)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PinName;                                           // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCalliopeConnectedPin;

// ScriptStruct Calliope.GsManagedParamBase
// 0x0038 (0x0038 - 0x0000)
struct alignas(0x08) FGsManagedParamBase
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	EGsManagedParamType                           ParamType;                                         // 0x0008(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  ConfigGuid;                                        // 0x000C(0x0010)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AliasName;                                         // 0x001C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x14];                                      // 0x0024(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGsManagedParamBase;

// ScriptStruct Calliope.GsManagedFollowPartnerConfigID
// 0x0008 (0x0040 - 0x0038)
struct FGsManagedFollowPartnerConfigID final : public FGsManagedParamBase
{
public:
	int32                                         ConfigID;                                          // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGsManagedFollowPartnerConfigID;

// ScriptStruct Calliope.GsManagedAssociationUnitConfigID
// 0x0008 (0x0040 - 0x0038)
struct FGsManagedAssociationUnitConfigID final : public FGsManagedParamBase
{
public:
	int32                                         ConfigID;                                          // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGsManagedAssociationUnitConfigID;

// ScriptStruct Calliope.GsManagedAssociationOnFightSkillID
// 0x0008 (0x0040 - 0x0038)
struct FGsManagedAssociationOnFightSkillID final : public FGsManagedParamBase
{
public:
	int32                                         OnFightSkillID;                                    // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGsManagedAssociationOnFightSkillID;

// ScriptStruct Calliope.GsManagedSequenceID
// 0x0008 (0x0040 - 0x0038)
struct FGsManagedSequenceID final : public FGsManagedParamBase
{
public:
	int32                                         SequenceID;                                        // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGsManagedSequenceID;

// ScriptStruct Calliope.GsManagedTaskLine
// 0x0008 (0x0040 - 0x0038)
struct FGsManagedTaskLine final : public FGsManagedParamBase
{
public:
	int32                                         TaskLineID;                                        // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGsManagedTaskLine;

// ScriptStruct Calliope.GsManagedTaskStage
// 0x0008 (0x0040 - 0x0038)
struct FGsManagedTaskStage final : public FGsManagedParamBase
{
public:
	int32                                         TaskStage;                                         // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGsManagedTaskStage;

// ScriptStruct Calliope.GsSmartParamArray
// 0x0010 (0x0010 - 0x0000)
struct FGsSmartParamArray final
{
public:
	TArray<struct FGuid>                          ConfigGuides;                                      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGsSmartParamArray;

// ScriptStruct Calliope.GsSmartParam
// 0x0010 (0x0010 - 0x0000)
struct FGsSmartParam final
{
public:
	struct FGuid                                  ConfigGuid;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGsSmartParam;

// ScriptStruct Calliope.GsManagedBuffID
// 0x0018 (0x0050 - 0x0038)
struct FGsManagedBuffID final : public FGsManagedParamBase
{
public:
	int32                                         BuffID;                                            // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGsSmartParamArray                     NPCUnit;                                           // 0x0040(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGsManagedBuffID;

// ScriptStruct Calliope.GsManagedGroupID
// 0x0008 (0x0040 - 0x0038)
struct FGsManagedGroupID final : public FGsManagedParamBase
{
public:
	int32                                         InteractorGroupID;                                 // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGsManagedGroupID;

// ScriptStruct Calliope.GsManagedArchiveLabel
// 0x0008 (0x0040 - 0x0038)
struct FGsManagedArchiveLabel final : public FGsManagedParamBase
{
public:
	class FName                                   ArchiveLabel;                                      // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGsManagedArchiveLabel;

// ScriptStruct Calliope.GsManagedStreamingLevel
// 0x0018 (0x0050 - 0x0038)
struct FGsManagedStreamingLevel final : public FGsManagedParamBase
{
public:
	class FName                                   PersistentLevelName;                               // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   StreamingLevelName;                                // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGsStreamingLevelState                        State;                                             // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGsManagedStreamingLevel;

// ScriptStruct Calliope.GsManagedSceneObjBase
// 0x0018 (0x0050 - 0x0038)
struct FGsManagedSceneObjBase : public FGsManagedParamBase
{
public:
	class FString                                 ActorGuid;                                         // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNeedStateManaged;                                 // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGsManagedSceneObjBase;

// ScriptStruct Calliope.GsManagedGroupUnitObjBase
// 0x0010 (0x0048 - 0x0038)
struct FGsManagedGroupUnitObjBase : public FGsManagedParamBase
{
public:
	struct FGameplayTag                           GroupTag;                                          // 0x0038(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNeedStateManaged;                                 // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGsManagedGroupUnitObjBase;

// ScriptStruct Calliope.GsManagedSpawner
// 0x0030 (0x0080 - 0x0050)
struct FGsManagedSpawner final : public FGsManagedSceneObjBase
{
public:
	TSoftObjectPtr<class AActor>                  Actor;                                             // 0x0050(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGsSpawnerState                               State;                                             // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGsManagedSpawner;

// ScriptStruct Calliope.GsManagedUnit
// 0x0058 (0x00A8 - 0x0050)
struct FGsManagedUnit final : public FGsManagedSceneObjBase
{
public:
	TSoftObjectPtr<class ACharacter>              Actor;                                             // 0x0050(0x0028)(Edit, BlueprintVisible, EditConst, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class AActor>                  Tamer;                                             // 0x0078(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGsUnitResetType                              State;                                             // 0x00A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGsManagedUnit;

// ScriptStruct Calliope.GsManagedGroupUnit
// 0x0008 (0x0050 - 0x0048)
struct FGsManagedGroupUnit final : public FGsManagedGroupUnitObjBase
{
public:
	EGsUnitResetType                              State;                                             // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGsManagedGroupUnit;

// ScriptStruct Calliope.GsNPCReferenceInfo
// 0x0050 (0x0050 - 0x0000)
struct FGsNPCReferenceInfo final
{
public:
	struct FGuid                                  ConfigGuid;                                        // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class AActor>                  Tamer;                                             // 0x0010(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ActorGuid;                                         // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AliasName;                                         // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGsNPCReferenceInfo;

// ScriptStruct Calliope.GsManagedNPCUnit
// 0x00C8 (0x0118 - 0x0050)
struct FGsManagedNPCUnit final : public FGsManagedSceneObjBase
{
public:
	TSoftObjectPtr<class ACharacter>              Actor;                                             // 0x0050(0x0028)(Edit, BlueprintVisible, EditConst, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class AActor>                  Tamer;                                             // 0x0078(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGsNPCReferenceInfo>            NPCInstanceGroup;                                  // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         TeamID;                                            // 0x00B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGsSmartParam                          TeamIDParam;                                       // 0x00B4(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         IdleAMIdx;                                         // 0x00C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGsSmartParam                          IdleAMIdxParam;                                    // 0x00C8(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         LeisureAnimIndex;                                  // 0x00D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGsSmartParam                          LeisureAnimIndexParam;                             // 0x00DC(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         InteractGroupID;                                   // 0x00EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGsSmartParam                          InteractGroupIDParam;                              // 0x00F0(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	EGsNPCShowState                               ShowState;                                         // 0x0100(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  ActiveInstance;                                    // 0x0104(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGsManagedNPCUnit;

// ScriptStruct Calliope.GsManagedStreamingLevelStateConfig
// 0x0008 (0x0040 - 0x0038)
struct FGsManagedStreamingLevelStateConfig final : public FGsManagedParamBase
{
public:
	int32                                         LevelID;                                           // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DataAssetID;                                       // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGsManagedStreamingLevelStateConfig;

// ScriptStruct Calliope.GsManagedDynamicObstacle
// 0x0030 (0x0080 - 0x0050)
struct FGsManagedDynamicObstacle final : public FGsManagedSceneObjBase
{
public:
	TSoftObjectPtr<class AActor>                  Actor;                                             // 0x0050(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGsDynamicObstacleState                       State;                                             // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGsManagedDynamicObstacle;

// ScriptStruct Calliope.GsManagedOverlap
// 0x0030 (0x0080 - 0x0050)
struct FGsManagedOverlap final : public FGsManagedSceneObjBase
{
public:
	TSoftObjectPtr<class AActor>                  Actor;                                             // 0x0050(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGsOverlapState                               State;                                             // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGsManagedOverlap;

// ScriptStruct Calliope.GsManagedInteractor
// 0x0040 (0x0090 - 0x0050)
struct FGsManagedInteractor final : public FGsManagedSceneObjBase
{
public:
	TSoftObjectPtr<class AActor>                  Actor;                                             // 0x0050(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGsInteractorState                            State;                                             // 0x0078(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGsSmartParam                          GroupId;                                           // 0x007C(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGsManagedInteractor;

// ScriptStruct Calliope.GsManagedAiConversationID
// 0x0010 (0x0048 - 0x0038)
struct FGsManagedAiConversationID final : public FGsManagedParamBase
{
public:
	TArray<int32>                                 AiConversationIDList;                              // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGsManagedAiConversationID;

// ScriptStruct Calliope.GsManagedTeamID
// 0x0008 (0x0040 - 0x0038)
struct FGsManagedTeamID final : public FGsManagedParamBase
{
public:
	int32                                         TeamID;                                            // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGsManagedTeamID;

// ScriptStruct Calliope.GsManagedIdleAMIdx
// 0x0008 (0x0040 - 0x0038)
struct FGsManagedIdleAMIdx final : public FGsManagedParamBase
{
public:
	int32                                         IdleAMIdx;                                         // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGsManagedIdleAMIdx;

// ScriptStruct Calliope.GsManagedLeisureAnimIndex
// 0x0008 (0x0040 - 0x0038)
struct FGsManagedLeisureAnimIndex final : public FGsManagedParamBase
{
public:
	int32                                         LeisureAnimIndex;                                  // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGsManagedLeisureAnimIndex;

// ScriptStruct Calliope.GsManagedInteractGroupID
// 0x0008 (0x0040 - 0x0038)
struct FGsManagedInteractGroupID final : public FGsManagedParamBase
{
public:
	int32                                         InteractGroupID;                                   // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGsManagedInteractGroupID;

// ScriptStruct Calliope.CalliopeParameters
// 0x0170 (0x0170 - 0x0000)
struct FCalliopeParameters final
{
public:
	TArray<struct FGsManagedFollowPartnerConfigID> FollowPartnerConfigIDCollection;                  // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGsManagedAssociationUnitConfigID> AssociationUnitConfigIDCollection;              // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGsManagedAssociationOnFightSkillID> AssociationOnFightSkillIDCollection;          // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGsManagedSequenceID>           SequenceIDCollection;                              // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGsManagedTaskStage>            TaskStageCollection;                               // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGsManagedTaskLine>             TaskLineCollection;                                // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGsManagedBuffID>               BuffIDCollection;                                  // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGsManagedArchiveLabel>         ArchiveLabelCollection;                            // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGsManagedGroupID>              GroupIDCollection;                                 // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGsManagedAiConversationID>     AiConversationIDCollection;                        // 0x0090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGsManagedTeamID>               TeamIDCollection;                                  // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGsManagedIdleAMIdx>            IdleAMIdxCollection;                               // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGsManagedLeisureAnimIndex>     LeisureAnimIndexCollection;                        // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGsManagedInteractGroupID>      InteractGroupIDCollection;                         // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGsManagedDynamicObstacle>      DynamicObstacleCollection;                         // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGsManagedOverlap>              OverlapCollection;                                 // 0x00F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGsManagedInteractor>           InteractorCollection;                              // 0x0100(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGsManagedSpawner>              SpawnerCollection;                                 // 0x0110(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGsManagedUnit>                 UnitCollection;                                    // 0x0120(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGsManagedGroupUnit>            GroupUnitCollection;                               // 0x0130(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGsManagedNPCUnit>              NPCUnitCollection;                                 // 0x0140(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGsManagedStreamingLevel>       StreamingLevelCollection;                          // 0x0150(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGsManagedStreamingLevelStateConfig> StreamingLevelStateConfigCollection;          // 0x0160(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCalliopeParameters;

// ScriptStruct Calliope.CalliopeParameterMapping
// 0x00B8 (0x00B8 - 0x0000)
struct FCalliopeParameterMapping final
{
public:
	EGsManagedParamType                           ParamType;                                         // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  ParamGuid;                                         // 0x0004(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ParamDisplayName;                                  // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class AActor>                  Actor;                                             // 0x0028(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ActorGuid;                                         // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SequenceID;                                        // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TaskStage;                                         // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BuffID;                                            // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GroupId;                                           // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 AiConversationIDList;                              // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class FName                                   ArchiveLabel;                                      // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bKeepOriginal;                                     // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ParameterString;                                   // 0x0090(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ParameterInt;                                      // 0x00A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 ParameterArrayInt;                                 // 0x00A8(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCalliopeParameterMapping;

// ScriptStruct Calliope.CalliopeParameterMappingGroup
// 0x0030 (0x0030 - 0x0000)
struct FCalliopeParameterMappingGroup final
{
public:
	struct FGuid                                  GroupGuid;                                         // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCalliopeParameterMapping>      Mappings;                                          // 0x0010(0x0010)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 Comment;                                           // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCalliopeParameterMappingGroup;

// ScriptStruct Calliope.GsSceneObjPoliceConfigBase
// 0x0010 (0x0010 - 0x0000)
struct FGsSceneObjPoliceConfigBase
{
public:
	struct FGuid                                  ConfigGuid;                                        // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGsSceneObjPoliceConfigBase;

// ScriptStruct Calliope.GsDynamicObstaclePoliceConfig
// 0x0008 (0x0018 - 0x0010)
struct FGsDynamicObstaclePoliceConfig final : public FGsSceneObjPoliceConfigBase
{
public:
	EGsDynamicObstacleManagePolice                ManagePolice;                                      // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGsDynamicObstacleState                       State;                                             // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGsDynamicObstacleState                       OutState;                                          // 0x0012(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGsDynamicObstacleState                       DefaultState;                                      // 0x0013(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGsDynamicObstacleManagePolice                ActualManagePolice;                                // 0x0014(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGsDynamicObstaclePoliceConfig;

// ScriptStruct Calliope.GsOverlapPoliceConfig
// 0x0008 (0x0018 - 0x0010)
struct FGsOverlapPoliceConfig final : public FGsSceneObjPoliceConfigBase
{
public:
	EGsOverlapManagePolice                        ManagePolice;                                      // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGsOverlapState                               State;                                             // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGsOverlapState                               OutState;                                          // 0x0012(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGsOverlapState                               DefaultState;                                      // 0x0013(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGsOverlapManagePolice                        ActualManagePolice;                                // 0x0014(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGsOverlapPoliceConfig;

// ScriptStruct Calliope.GsInteractorPoliceConfig
// 0x0038 (0x0048 - 0x0010)
struct FGsInteractorPoliceConfig final : public FGsSceneObjPoliceConfigBase
{
public:
	EGsInteractorManagePolice                     ManagePolice;                                      // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGsInteractorState                            State;                                             // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGsInteractorState                            DefaultState;                                      // 0x0012(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGsInteractorManagePolice                     ActualManagePolice;                                // 0x0013(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGsInteractorState                            OutState;                                          // 0x0014(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanModify;                                        // 0x0015(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGsSmartParam                          ActualValue;                                       // 0x0018(0x0010)(Edit, BlueprintVisible, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FGsSmartParam                          ModifyValue;                                       // 0x0028(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FGsSmartParam                          DefaultValue;                                      // 0x0038(0x0010)(Edit, BlueprintVisible, EditConst, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGsInteractorPoliceConfig;

// ScriptStruct Calliope.GsSpawnerPoliceConfig
// 0x0008 (0x0018 - 0x0010)
struct FGsSpawnerPoliceConfig final : public FGsSceneObjPoliceConfigBase
{
public:
	EGsSpawnerManagePolice                        ManagePolice;                                      // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGsSpawnerState                               State;                                             // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGsSpawnerState                               DefaultState;                                      // 0x0012(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGsSpawnerManagePolice                        ActualManagePolice;                                // 0x0013(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGsSpawnerState                               OutState;                                          // 0x0014(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGsSpawnerPoliceConfig;

// ScriptStruct Calliope.GsStreamingLevelPoliceConfig
// 0x0008 (0x0018 - 0x0010)
struct FGsStreamingLevelPoliceConfig final : public FGsSceneObjPoliceConfigBase
{
public:
	EGsStreamingLevelManagePolice                 ManagePolice;                                      // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGsStreamingLevelState                        State;                                             // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGsStreamingLevelState                        DefaultState;                                      // 0x0012(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGsStreamingLevelManagePolice                 ActualManagePolice;                                // 0x0013(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGsStreamingLevelState                        OutState;                                          // 0x0014(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGsStreamingLevelPoliceConfig;

// ScriptStruct Calliope.GsUnitPoliceConfig
// 0x0008 (0x0018 - 0x0010)
struct FGsUnitPoliceConfig final : public FGsSceneObjPoliceConfigBase
{
public:
	EGsUnitManagePolice                           ManagePolice;                                      // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGsUnitResetType                              State;                                             // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGsUnitResetType                              DefaultState;                                      // 0x0012(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGsUnitManagePolice                           ActualManagePolice;                                // 0x0013(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGsUnitResetType                              OutState;                                          // 0x0014(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGsUnitPoliceConfig;

// ScriptStruct Calliope.GsNPCUnitIntParamConfig
// 0x0014 (0x0014 - 0x0000)
struct FGsNPCUnitIntParamConfig final
{
public:
	bool                                          bCanModify;                                        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ActualParam;                                       // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ModifyParam;                                       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DefaultParam;                                      // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutParam;                                          // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGsNPCUnitIntParamConfig;

// ScriptStruct Calliope.GsNPCUnitSmartParamConfig
// 0x0044 (0x0044 - 0x0000)
struct FGsNPCUnitSmartParamConfig final
{
public:
	bool                                          bCanModify;                                        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGsSmartParam                          ActualParam;                                       // 0x0004(0x0010)(Edit, BlueprintVisible, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FGsSmartParam                          ModifyParam;                                       // 0x0014(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FGsSmartParam                          DefaultParam;                                      // 0x0024(0x0010)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FGsSmartParam                          OutParam;                                          // 0x0034(0x0010)(BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGsNPCUnitSmartParamConfig;

// ScriptStruct Calliope.GsNPCUnitShowStateParamConfig
// 0x0005 (0x0005 - 0x0000)
struct FGsNPCUnitShowStateParamConfig final
{
public:
	bool                                          bCanModify;                                        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGsNPCShowState                               ActualParam;                                       // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGsNPCShowState                               ModifyParam;                                       // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGsNPCShowState                               DefaultParam;                                      // 0x0003(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGsNPCShowState                               OutParam;                                          // 0x0004(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGsNPCUnitShowStateParamConfig;

// ScriptStruct Calliope.GsNPCUnitGuidParamConfig
// 0x0044 (0x0044 - 0x0000)
struct FGsNPCUnitGuidParamConfig final
{
public:
	bool                                          bCanModify;                                        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  ActualParam;                                       // 0x0004(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ModifyParam;                                       // 0x0014(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  DefaultParam;                                      // 0x0024(0x0010)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  OutParam;                                          // 0x0034(0x0010)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGsNPCUnitGuidParamConfig;

// ScriptStruct Calliope.GsNPCUnitBuffParamConfig
// 0x0018 (0x0018 - 0x0000)
struct FGsNPCUnitBuffParamConfig final
{
public:
	struct FGuid                                  ConfigGuid;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanModify;                                        // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
