#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CinematicPrestreaming

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "CinematicPrestreaming_structs.hpp"
#include "MovieScene_structs.hpp"
#include "MovieScene_classes.hpp"


namespace SDK
{

// Class CinematicPrestreaming.CinePrestreamingData
// 0x0040 (0x0068 - 0x0028)
class UCinePrestreamingData final : public UObject
{
public:
	TArray<struct FFrameNumber>                   Times;                                             // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FCinePrestreamingVTData>        VirtualTextureDatas;                               // 0x0038(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FCinePrestreamingNaniteData>    NaniteDatas;                                       // 0x0048(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FDateTime                              RecordedTime;                                      // 0x0058(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              RecordedResolution;                                // 0x0060(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CinePrestreamingData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CinePrestreamingData")
	}
	static class UCinePrestreamingData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCinePrestreamingData>();
	}
};
DUMPER7_ASSERTS_UCinePrestreamingData;

// Class CinematicPrestreaming.MovieSceneCinePrestreamingSection
// 0x0038 (0x0120 - 0x00E8)
class UMovieSceneCinePrestreamingSection final : public UMovieSceneSection
{
public:
	uint8                                         Pad_E8[0x8];                                       // 0x00E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UCinePrestreamingData>   PrestreamingAsset;                                 // 0x00F0(0x0028)(Edit, BlueprintVisible, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         StartFrameOffset;                                  // 0x0118(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         QualityLevel;                                      // 0x011C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetPrestreamingAsset(const class UCinePrestreamingData* InData);
	void SetQualityLevel(const int32 InLevel);
	void SetStartFrameOffset(const int32 InOffset);

	TSoftObjectPtr<class UCinePrestreamingData> GetPrestreamingAsset() const;
	int32 GetQualityLevel() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneCinePrestreamingSection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneCinePrestreamingSection")
	}
	static class UMovieSceneCinePrestreamingSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneCinePrestreamingSection>();
	}
};
DUMPER7_ASSERTS_UMovieSceneCinePrestreamingSection;

// Class CinematicPrestreaming.MovieSceneCinePrestreamingTrack
// 0x0010 (0x00A0 - 0x0090)
class UMovieSceneCinePrestreamingTrack final : public UMovieSceneNameableTrack
{
public:
	TArray<class UMovieSceneSection*>             Sections;                                          // 0x0090(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneCinePrestreamingTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneCinePrestreamingTrack")
	}
	static class UMovieSceneCinePrestreamingTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneCinePrestreamingTrack>();
	}
};
DUMPER7_ASSERTS_UMovieSceneCinePrestreamingTrack;

// Class CinematicPrestreaming.MovieSceneCinePrestreamingTrackInstance
// 0x00A0 (0x00F0 - 0x0050)
class UMovieSceneCinePrestreamingTrackInstance final : public UMovieSceneTrackInstance
{
public:
	TMap<struct FMovieSceneTrackInstanceInput, class UCinePrestreamingData*> PrestreamingAssetMap;   // 0x0050(0x0050)(Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A0[0x50];                                      // 0x00A0(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneCinePrestreamingTrackInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneCinePrestreamingTrackInstance")
	}
	static class UMovieSceneCinePrestreamingTrackInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneCinePrestreamingTrackInstance>();
	}
};
DUMPER7_ASSERTS_UMovieSceneCinePrestreamingTrackInstance;

}

