#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ControlRig_AttackIK

#include "Basic.hpp"

#include "PBIK_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ControlRig_structs.hpp"
#include "ControlRig_classes.hpp"
#include "AnimationCore_structs.hpp"
#include "RigVM_classes.hpp"


namespace SDK
{

// RigVMMemoryStorageGeneratorClass ControlRig_AttackIK.RigVMMemory_Work
// 0x04F8 (0x0520 - 0x0028)
class ControlRig_AttackIK::URigVMMemory_Work final : public URigVMMemoryStorage
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FControlRigExecuteContext              ExecuteContext_;                                   // 0x0030(0x00C0)(Edit, EditConst, NonTransactional)
	struct FTransform                             ConstructRoot_ConstructRoot_RigUnit_GetTransform_Transform; // 0x00F0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FRigElementKey                         ConstructRoot_ConstructRoot_RigUnit_GetTransform_Item__IO; // 0x0150(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              ConstructRoot_ConstructRoot_RigUnit_GetTransform_CachedIndex; // 0x0160(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             ConstructRoot_ConstructRoot_RigUnit_SetTransform_Transform__IO; // 0x0170(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              ConstructRoot_ConstructRoot_RigUnit_SetTransform_CachedIndex; // 0x01D0(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  AttackPlane_AttackPlane_MathQuaternionFromEuler_Result; // 0x01E0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	double                                        AttackPlane_AttackPlane_ArrayGetAtIndex_3_Element; // 0x0200(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         ArrayIterator_Index;                               // 0x0208(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        AttackPlane_AttackPlane_ArrayGetAtIndex_3_1_Element; // 0x0210(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                AttackPlane_AttackPlane_MathQuaternionFromEuler_Euler__IO; // 0x0218(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             AttackPlane_AttackPlane_RigUnit_SetTransform_1_Transform__IO; // 0x0230(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              AttackPlane_AttackPlane_RigUnit_SetTransform_1_CachedIndex; // 0x0290(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             AttackPlane_AttackPlane_RigUnit_GetTransform_1_Transform; // 0x02A0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	class FName                                   AttackPlane_AttackPlane_ArrayGetAtIndex_Element;   // 0x0300(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         AttackPlane_AttackPlane_RigUnit_GetTransform_1_Item__IO; // 0x0308(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              AttackPlane_AttackPlane_RigUnit_GetTransform_1_CachedIndex; // 0x0318(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              AttackPlane_AttackPlane_RigUnit_SetTransform_2_CachedIndex; // 0x0328(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_338[0x8];                                      // 0x0338(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             AttackPlane_AttackPlane_RigUnit_GetTransform_2_Transform; // 0x0340(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              AttackPlane_AttackPlane_RigUnit_GetTransform_2_CachedIndex; // 0x03A0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              AttackPlane_AttackPlane_RigUnit_SetTransform_3_CachedIndex; // 0x03B0(0x0010)(Edit, EditConst, NonTransactional)
	class FName                                   AttackPlane_AttackPlane_ArrayGetAtIndex_1_Element; // 0x03C0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   AttackPlane_AttackPlane_ArrayGetAtIndex_2_Element; // 0x03C8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             AttackPlane_AttackPlane_RigUnit_GetTransform_3_Transform; // 0x03D0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              AttackPlane_AttackPlane_RigUnit_GetTransform_3_CachedIndex; // 0x0430(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FPBIKEffector>                  AttackPlane_AttackPlane_PBIK_Effectors__IO;        // 0x0440(0x0010)(Edit, EditConst, NonTransactional)
	TArray<TArray<int32>>                         AttackPlane_AttackPlane_PBIK_EffectorSolverIndices; // 0x0450(0x0010)(Edit, EditConst, NonTransactional)
	TArray<TArray<int32>>                         AttackPlane_AttackPlane_PBIK_BoneSettingToSolverBoneIndex; // 0x0460(0x0010)(Edit, EditConst, NonTransactional)
	TArray<TArray<int32>>                         AttackPlane_AttackPlane_PBIK_SolverBoneToElementIndex; // 0x0470(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FPBIKSolver>                    AttackPlane_AttackPlane_PBIK_Solver;               // 0x0480(0x0010)(Edit, EditConst, NonTransactional)
	TArray<uint8>                                 AttackPlane_AttackPlane_PBIK_bNeedsInit;           // 0x0490(0x0010)(Edit, EditConst, NonTransactional)
	class FName                                   ArrayIterator_Element;                             // 0x04A0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         ArrayIterator_Count;                               // 0x04A8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ArrayIterator_Ratio;                               // 0x04AC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         ArrayIterator_Continue : 1;                        // 0x04B0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_4B1[0x7];                                      // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPBIKEffector>                  PBIK_Effectors__IO;                                // 0x04B8(0x0010)(Edit, EditConst, NonTransactional)
	TArray<TArray<int32>>                         PBIK_EffectorSolverIndices;                        // 0x04C8(0x0010)(Edit, EditConst, NonTransactional)
	TArray<TArray<int32>>                         PBIK_BoneSettingToSolverBoneIndex;                 // 0x04D8(0x0010)(Edit, EditConst, NonTransactional)
	TArray<TArray<int32>>                         PBIK_SolverBoneToElementIndex;                     // 0x04E8(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FPBIKSolver>                    PBIK_Solver;                                       // 0x04F8(0x0010)(Edit, EditConst, NonTransactional)
	TArray<uint8>                                 PBIK_bNeedsInit;                                   // 0x0508(0x0010)(Edit, EditConst, NonTransactional)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL_FULLNAME("RigVMMemoryStorageGeneratorClass ControlRig_AttackIK.RigVMMemory_Work")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RigVMMemory_Work")
	}
	static class ControlRig_AttackIK::URigVMMemory_Work* GetDefaultObj()
	{
		return GetDefaultObjImpl<ControlRig_AttackIK::URigVMMemory_Work>();
	}
};
DUMPER7_ASSERTS_ControlRig_AttackIK__URigVMMemory_Work;

// RigVMMemoryStorageGeneratorClass ControlRig_AttackIK.RigVMMemory_Literal
// 0x0148 (0x0170 - 0x0028)
class ControlRig_AttackIK::URigVMMemory_Literal final : public URigVMMemoryStorage
{
public:
	struct FRigElementKey                         ConstructRoot_ConstructRoot_RigUnit_SetTransform_Item__Const; // 0x0028(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EBoneGetterSetterMode                         ConstructRoot_ConstructRoot_RigUnit_SetTransform_Space__Const; // 0x0034(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         ConstructRoot_ConstructRoot_RigUnit_SetTransform_bInitial__Const : 1; // 0x0035(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_36[0xA];                                       // 0x0036(0x000A)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ConstructRoot_ConstructRoot_RigUnit_SetTransform_Transform__Const; // 0x0040(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FRigElementKey                         ConstructRoot_ConstructRoot_RigUnit_GetTransform_Item__Const; // 0x00A0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ConstructRoot_ConstructRoot_RigUnit_SetTransform_Weight__Const; // 0x00AC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         AttackPlane_AttackPlane_RigUnit_SetTransform_1_Item__Const; // 0x00B0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EBoneGetterSetterMode                         AttackPlane_AttackPlane_RigUnit_SetTransform_1_Space__Const; // 0x00BC(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                AttackPlane_AttackPlane_MathQuaternionFromEuler_Euler__Const; // 0x00C0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EEulerRotationOrder                           AttackPlane_AttackPlane_MathQuaternionFromEuler_RotationOrder__Const; // 0x00D8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         AttackPlane_AttackPlane_RigUnit_SetTransform_2_Item__Const; // 0x00DC(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         AttackPlane_AttackPlane_RigUnit_GetTransform_1_Item__Const; // 0x00E8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         AttackPlane_AttackPlane_RigUnit_SetTransform_3_Item__Const; // 0x00F4(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPBIKEffector>                  AttackPlane_AttackPlane_PBIK_Effectors__Const;     // 0x0100(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FPBIKBoneSetting>               AttackPlane_AttackPlane_PBIK_BoneSettings__Const;  // 0x0110(0x0010)(Edit, EditConst, NonTransactional)
	TArray<class FName>                           AttackPlane_AttackPlane_PBIK_ExcludedBones__Const; // 0x0120(0x0010)(Edit, EditConst, NonTransactional)
	struct FPBIKSolverSettings                    AttackPlane_AttackPlane_PBIK_Settings__Const;      // 0x0130(0x0010)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FPBIKDebug                             AttackPlane_AttackPlane_PBIK_Debug__Const;         // 0x0140(0x0008)(Edit, EditConst, NonTransactional, NoDestructor)
	TArray<struct FPBIKEffector>                  PBIK_Effectors__Const;                             // 0x0148(0x0010)(Edit, EditConst, NonTransactional)
	struct FPBIKSolverSettings                    PBIK_Settings__Const;                              // 0x0158(0x0010)(Edit, EditConst, NonTransactional, NoDestructor)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL_FULLNAME("RigVMMemoryStorageGeneratorClass ControlRig_AttackIK.RigVMMemory_Literal")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RigVMMemory_Literal")
	}
	static class ControlRig_AttackIK::URigVMMemory_Literal* GetDefaultObj()
	{
		return GetDefaultObjImpl<ControlRig_AttackIK::URigVMMemory_Literal>();
	}
};
DUMPER7_ASSERTS_ControlRig_AttackIK__URigVMMemory_Literal;

// ControlRigBlueprintGeneratedClass ControlRig_AttackIK.ControlRig_AttackIK_C
// 0x0070 (0x0500 - 0x0490)
class UControlRig_AttackIK_C final : public UControlRig
{
public:
	uint8                                         Pad_488[0x8];                                      // 0x0488(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<double>                                AtkIKRoll;                                         // 0x0490(0x0010)(Edit, BlueprintVisible)
	TArray<double>                                AtkIKPitch;                                        // 0x04A0(0x0010)(Edit, BlueprintVisible)
	class FName                                   RootName;                                          // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           SolverRootBoneNameList;                            // 0x04B8(0x0010)(Edit, BlueprintVisible)
	TArray<class FName>                           SolverEffectorsBoneNameList;                       // 0x04C8(0x0010)(Edit, BlueprintVisible)
	bool                                          BoneScaleEnable;                                   // 0x04D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D9[0x3];                                      // 0x04D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   BoneScaleName;                                     // 0x04DC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E4[0x4];                                      // 0x04E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                TargetPosition;                                    // 0x04E8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ControlRig_AttackIK_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ControlRig_AttackIK_C")
	}
	static class UControlRig_AttackIK_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControlRig_AttackIK_C>();
	}
};
DUMPER7_ASSERTS_UControlRig_AttackIK_C;

}

