#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CtrlRig_SlowIK_L_WeaponL

#include "Basic.hpp"

#include "PBIK_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ControlRig_structs.hpp"
#include "ControlRig_classes.hpp"
#include "RigVM_classes.hpp"


namespace SDK
{

// RigVMMemoryStorageGeneratorClass CtrlRig_SlowIK_L_WeaponL.RigVMMemory_Work
// 0x0198 (0x01C0 - 0x0028)
class CtrlRig_SlowIK_L_WeaponL::URigVMMemory_Work final : public URigVMMemoryStorage
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FControlRigExecuteContext              ExecuteContext_;                                   // 0x0030(0x00C0)(Edit, EditConst, NonTransactional)
	struct FTransform                             GetTransform_Transform;                            // 0x00F0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              GetTransform_CachedIndex;                          // 0x0150(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FPBIKEffector>                  PBIK_Effectors__IO;                                // 0x0160(0x0010)(Edit, EditConst, NonTransactional)
	TArray<TArray<int32>>                         PBIK_EffectorSolverIndices;                        // 0x0170(0x0010)(Edit, EditConst, NonTransactional)
	TArray<TArray<int32>>                         PBIK_BoneSettingToSolverBoneIndex;                 // 0x0180(0x0010)(Edit, EditConst, NonTransactional)
	TArray<TArray<int32>>                         PBIK_SolverBoneToElementIndex;                     // 0x0190(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FPBIKSolver>                    PBIK_Solver;                                       // 0x01A0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<uint8>                                 PBIK_bNeedsInit;                                   // 0x01B0(0x0010)(Edit, EditConst, NonTransactional)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL_FULLNAME("RigVMMemoryStorageGeneratorClass CtrlRig_SlowIK_L_WeaponL.RigVMMemory_Work")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RigVMMemory_Work")
	}
	static class CtrlRig_SlowIK_L_WeaponL::URigVMMemory_Work* GetDefaultObj()
	{
		return GetDefaultObjImpl<CtrlRig_SlowIK_L_WeaponL::URigVMMemory_Work>();
	}
};
DUMPER7_ASSERTS_CtrlRig_SlowIK_L_WeaponL__URigVMMemory_Work;

// RigVMMemoryStorageGeneratorClass CtrlRig_SlowIK_L_WeaponL.RigVMMemory_Literal
// 0x0060 (0x0088 - 0x0028)
class CtrlRig_SlowIK_L_WeaponL::URigVMMemory_Literal final : public URigVMMemoryStorage
{
public:
	class FName                                   PBIK_Root__Const;                                  // 0x0028(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPBIKEffector>                  PBIK_Effectors__Const;                             // 0x0030(0x0010)(Edit, EditConst, NonTransactional)
	struct FRigElementKey                         GetTransform_Item__Const;                          // 0x0040(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EBoneGetterSetterMode                         GetTransform_Space__Const;                         // 0x004C(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         GetTransform_bInitial__Const : 1;                  // 0x004D(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPBIKBoneSetting>               PBIK_BoneSettings__Const;                          // 0x0050(0x0010)(Edit, EditConst, NonTransactional)
	TArray<class FName>                           PBIK_ExcludedBones__Const;                         // 0x0060(0x0010)(Edit, EditConst, NonTransactional)
	struct FPBIKSolverSettings                    PBIK_Settings__Const;                              // 0x0070(0x0010)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FPBIKDebug                             PBIK_Debug__Const;                                 // 0x0080(0x0008)(Edit, EditConst, NonTransactional, NoDestructor)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL_FULLNAME("RigVMMemoryStorageGeneratorClass CtrlRig_SlowIK_L_WeaponL.RigVMMemory_Literal")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RigVMMemory_Literal")
	}
	static class CtrlRig_SlowIK_L_WeaponL::URigVMMemory_Literal* GetDefaultObj()
	{
		return GetDefaultObjImpl<CtrlRig_SlowIK_L_WeaponL::URigVMMemory_Literal>();
	}
};
DUMPER7_ASSERTS_CtrlRig_SlowIK_L_WeaponL__URigVMMemory_Literal;

// ControlRigBlueprintGeneratedClass CtrlRig_SlowIK_L_WeaponL.CtrlRig_SlowIK_L_WeaponL_C
// 0x0070 (0x0500 - 0x0490)
class UCtrlRig_SlowIK_L_WeaponL_C final : public UControlRig
{
public:
	uint8                                         Pad_488[0x8];                                      // 0x0488(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CachedHandTransform;                               // 0x0490(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	double                                        Slow_Alpha;                                        // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("CtrlRig_SlowIK_L_WeaponL_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CtrlRig_SlowIK_L_WeaponL_C")
	}
	static class UCtrlRig_SlowIK_L_WeaponL_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCtrlRig_SlowIK_L_WeaponL_C>();
	}
};
DUMPER7_ASSERTS_UCtrlRig_SlowIK_L_WeaponL_C;

}

