#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomLightSystem

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CustomLightSystem_structs.hpp"


namespace SDK::Params
{

// Function CustomLightSystem.CLSLightManager.CheckReforenceListValid
// 0x0001 (0x0001 - 0x0000)
struct CLSLightManager_CheckReforenceListValid final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CLSLightManager_CheckReforenceListValid;

// Function CustomLightSystem.CLSLightManager.InitializeTagActor
// 0x0010 (0x0010 - 0x0000)
struct CLSLightManager_InitializeTagActor final
{
public:
	class UCLSTagComponent*                       TagComponent;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CLSLightManager_InitializeTagActor;

// Function CustomLightSystem.CLSLightManager.SetLightManagerActive
// 0x0001 (0x0001 - 0x0000)
struct CLSLightManager_SetLightManagerActive final
{
public:
	bool                                          NewActive;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CLSLightManager_SetLightManagerActive;

// Function CustomLightSystem.CLSLightManager.SwitchAllLightAndFog
// 0x0008 (0x0008 - 0x0000)
struct CLSLightManager_SwitchAllLightAndFog final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CLSLightManager_SwitchAllLightAndFog;

// Function CustomLightSystem.CLSLightManager.SwitchAtmosphericFog
// 0x0008 (0x0008 - 0x0000)
struct CLSLightManager_SwitchAtmosphericFog final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CLSLightManager_SwitchAtmosphericFog;

// Function CustomLightSystem.CLSLightManager.SwitchDirectionalLight
// 0x0008 (0x0008 - 0x0000)
struct CLSLightManager_SwitchDirectionalLight final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CLSLightManager_SwitchDirectionalLight;

// Function CustomLightSystem.CLSLightManager.SwitchExponentialHeightFog
// 0x0008 (0x0008 - 0x0000)
struct CLSLightManager_SwitchExponentialHeightFog final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CLSLightManager_SwitchExponentialHeightFog;

// Function CustomLightSystem.CLSLightManager.SwitchLightAndFog
// 0x0004 (0x0004 - 0x0000)
struct CLSLightManager_SwitchLightAndFog final
{
public:
	float                                         Percentage;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CLSLightManager_SwitchLightAndFog;

// Function CustomLightSystem.CLSLightManager.SwitchSkyLight
// 0x0008 (0x0008 - 0x0000)
struct CLSLightManager_SwitchSkyLight final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CLSLightManager_SwitchSkyLight;

// Function CustomLightSystem.CLSLightManager.SyncLightsAndFogs
// 0x0068 (0x0068 - 0x0000)
struct CLSLightManager_SyncLightsAndFogs final
{
public:
	class ADirectionalLight*                      InTargetDirectionalLight;                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ASkyLight*                              InTargetSkyLight;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ASkyAtmosphere*                         InTargetAtmosphericFog;                            // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AExponentialHeightFog*                  InTargetExponentialHeightFog;                      // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCLSMaterialParametersCollectionProperty InTargetCLSVolumeMPCProperty;                    // 0x0020(0x0020)(Parm, NativeAccessSpecifierPublic)
	struct FCLSMaterialParametersCollectionProperty InOriginalCLSVolumeMPCProperty;                  // 0x0040(0x0020)(Parm, NativeAccessSpecifierPublic)
	float                                         InTargetVolumePercentage;                          // 0x0060(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ForceUpdate;                                       // 0x0064(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CLSLightManager_SyncLightsAndFogs;

// Function CustomLightSystem.CLSAtmosphericFog.SetVisibility
// 0x0001 (0x0001 - 0x0000)
struct CLSAtmosphericFog_SetVisibility final
{
public:
	bool                                          bNewVisibility;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CLSAtmosphericFog_SetVisibility;

// Function CustomLightSystem.CLSBaseVolume.SetDynamicLevel
// 0x0004 (0x0004 - 0x0000)
struct CLSBaseVolume_SetDynamicLevel final
{
public:
	int32                                         InDynamicLevel;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CLSBaseVolume_SetDynamicLevel;

// Function CustomLightSystem.CLSBaseVolume.SetForceEnableAnyWhere
// 0x0001 (0x0001 - 0x0000)
struct CLSBaseVolume_SetForceEnableAnyWhere final
{
public:
	bool                                          bInForceEnableAnyWhere;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CLSBaseVolume_SetForceEnableAnyWhere;

// Function CustomLightSystem.CLSCommandManager.SafelySwitchLightsAndFogs
// 0x0068 (0x0068 - 0x0000)
struct CLSCommandManager_SafelySwitchLightsAndFogs final
{
public:
	class ADirectionalLight*                      InTargetDirectionalLight;                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ASkyLight*                              InTargetSkyLight;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ASkyAtmosphere*                         InTargetAtmosphericFog;                            // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AExponentialHeightFog*                  InTargetExponentialHeightFog;                      // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCLSMaterialParametersCollectionProperty InTargetCLSVolumeMPCProperty;                    // 0x0020(0x0020)(Parm, NativeAccessSpecifierPublic)
	struct FCLSMaterialParametersCollectionProperty InOriginalCLSVolumeMPCProperty;                  // 0x0040(0x0020)(Parm, NativeAccessSpecifierPublic)
	float                                         InTargetVolumePercentage;                          // 0x0060(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ForceUpdate;                                       // 0x0064(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CLSCommandManager_SafelySwitchLightsAndFogs;

// Function CustomLightSystem.CLSCommandManager.SwitchLightsAndFogs
// 0x0068 (0x0068 - 0x0000)
struct CLSCommandManager_SwitchLightsAndFogs final
{
public:
	class ADirectionalLight*                      InTargetDirectionalLight;                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ASkyLight*                              InTargetSkyLight;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ASkyAtmosphere*                         InTargetAtmosphericFog;                            // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AExponentialHeightFog*                  InTargetExponentialHeightFog;                      // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCLSMaterialParametersCollectionProperty InTargetCLSVolumeMPCProperty;                    // 0x0020(0x0020)(Parm, NativeAccessSpecifierPublic)
	struct FCLSMaterialParametersCollectionProperty InOriginalCLSVolumeMPCProperty;                  // 0x0040(0x0020)(Parm, NativeAccessSpecifierPublic)
	float                                         InTargetVolumePercentage;                          // 0x0060(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ForceUpdate;                                       // 0x0064(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CLSCommandManager_SwitchLightsAndFogs;

// Function CustomLightSystem.CLSDirectionalLight.SetVisibility
// 0x0001 (0x0001 - 0x0000)
struct CLSDirectionalLight_SetVisibility final
{
public:
	bool                                          bNewVisibility;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CLSDirectionalLight_SetVisibility;

// Function CustomLightSystem.CLSExponentialHeightFog.SetVisibility
// 0x0001 (0x0001 - 0x0000)
struct CLSExponentialHeightFog_SetVisibility final
{
public:
	bool                                          bNewVisibility;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CLSExponentialHeightFog_SetVisibility;

// Function CustomLightSystem.CLSFunctionLibrary.GetCurrentCLSManager
// 0x0008 (0x0008 - 0x0000)
struct CLSFunctionLibrary_GetCurrentCLSManager final
{
public:
	class ACLSManager*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CLSFunctionLibrary_GetCurrentCLSManager;

// Function CustomLightSystem.CLSFunctionLibrary.OverrideEnvLightBlendInSpeed
// 0x0008 (0x0008 - 0x0000)
struct CLSFunctionLibrary_OverrideEnvLightBlendInSpeed final
{
public:
	bool                                          bOverride;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InBlendInSpeed;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CLSFunctionLibrary_OverrideEnvLightBlendInSpeed;

// Function CustomLightSystem.CLSFunctionLibrary.RegisterNeedPointLightControlActor
// 0x0010 (0x0010 - 0x0000)
struct CLSFunctionLibrary_RegisterNeedPointLightControlActor final
{
public:
	class FName                                   InTag;                                             // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 InActor;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CLSFunctionLibrary_RegisterNeedPointLightControlActor;

// Function CustomLightSystem.CLSFunctionLibrary.UnregisterNeedPointLightControlActor
// 0x0008 (0x0008 - 0x0000)
struct CLSFunctionLibrary_UnregisterNeedPointLightControlActor final
{
public:
	class FName                                   InTag;                                             // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CLSFunctionLibrary_UnregisterNeedPointLightControlActor;

// Function CustomLightSystem.CLSManager.SetActorLightAttenuation
// 0x0004 (0x0004 - 0x0000)
struct CLSManager_SetActorLightAttenuation final
{
public:
	float                                         InActorLightAttenuation;                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CLSManager_SetActorLightAttenuation;

// Function CustomLightSystem.CLSManager.SetEnableManager
// 0x0001 (0x0001 - 0x0000)
struct CLSManager_SetEnableManager final
{
public:
	bool                                          bInEnableManager;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CLSManager_SetEnableManager;

// Function CustomLightSystem.CLSManager.SetPlayerLightAttenuation
// 0x0004 (0x0004 - 0x0000)
struct CLSManager_SetPlayerLightAttenuation final
{
public:
	float                                         InPlayerLightAttenuation;                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CLSManager_SetPlayerLightAttenuation;

// Function CustomLightSystem.CLSManager.UpdateAndGetWatchData
// 0x0290 (0x0290 - 0x0000)
struct CLSManager_UpdateAndGetWatchData final
{
public:
	struct FCLSWatchData                          ReturnValue;                                       // 0x0000(0x0290)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CLSManager_UpdateAndGetWatchData;

// Function CustomLightSystem.CLSPostVolume.AddOrUpdateBlendable
// 0x0018 (0x0018 - 0x0000)
struct CLSPostVolume_AddOrUpdateBlendable final
{
public:
	TScriptInterface<class IBlendableInterface>   InBlendableObject;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InWeight;                                          // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CLSPostVolume_AddOrUpdateBlendable;

// Function CustomLightSystem.RTXSettings.GetRTXQuality
// 0x0001 (0x0001 - 0x0000)
struct RTXSettings_GetRTXQuality final
{
public:
	uint8                                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RTXSettings_GetRTXQuality;

// Function CustomLightSystem.RTXSettings.IsDLSSRREnabled
// 0x0001 (0x0001 - 0x0000)
struct RTXSettings_IsDLSSRREnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RTXSettings_IsDLSSRREnabled;

// Function CustomLightSystem.RTXSettings.IsRTXEnabled
// 0x0001 (0x0001 - 0x0000)
struct RTXSettings_IsRTXEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RTXSettings_IsRTXEnabled;

// Function CustomLightSystem.RTXSettings.SetDlssRREnable
// 0x0001 (0x0001 - 0x0000)
struct RTXSettings_SetDlssRREnable final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RTXSettings_SetDlssRREnable;

// Function CustomLightSystem.RTXSettings.SetRTXEnabled
// 0x0001 (0x0001 - 0x0000)
struct RTXSettings_SetRTXEnabled final
{
public:
	bool                                          bInEnable;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RTXSettings_SetRTXEnabled;

// Function CustomLightSystem.RTXSettings.SetRTXQuality
// 0x0001 (0x0001 - 0x0000)
struct RTXSettings_SetRTXQuality final
{
public:
	uint8                                         Quality;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RTXSettings_SetRTXQuality;

// Function CustomLightSystem.CLSSkyLight.SetVisibility
// 0x0001 (0x0001 - 0x0000)
struct CLSSkyLight_SetVisibility final
{
public:
	bool                                          bNewVisibility;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CLSSkyLight_SetVisibility;

// Function CustomLightSystem.CLSVolumeManager.CheckOverlapVolumes
// 0x0028 (0x0028 - 0x0000)
struct CLSVolumeManager_CheckOverlapVolumes final
{
public:
	struct FVector                                position;                                          // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ACLSBaseVolume*>                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CLSVolumeManager_CheckOverlapVolumes;

// Function CustomLightSystem.CLSVolumeManager.CheckReforenceVolumeListValid
// 0x0001 (0x0001 - 0x0000)
struct CLSVolumeManager_CheckReforenceVolumeListValid final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CLSVolumeManager_CheckReforenceVolumeListValid;

// Function CustomLightSystem.CLSVolumeManager.CheckValidByWeight
// 0x0020 (0x0020 - 0x0000)
struct CLSVolumeManager_CheckValidByWeight final
{
public:
	struct FVector                                position;                                          // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CLSVolumeManager_CheckValidByWeight;

// Function CustomLightSystem.CLSVolumeManager.ForceDortPPV
// 0x0018 (0x0018 - 0x0000)
struct CLSVolumeManager_ForceDortPPV final
{
public:
	struct FVector                                ViewLocation;                                      // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CLSVolumeManager_ForceDortPPV;

// Function CustomLightSystem.CLSVolumeManager.GetValidVolumeByWeight
// 0x0068 (0x0068 - 0x0000)
struct CLSVolumeManager_GetValidVolumeByWeight final
{
public:
	struct FVector                                position;                                          // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class ACLSBaseVolume*, float>            ReturnValue;                                       // 0x0018(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CLSVolumeManager_GetValidVolumeByWeight;

// Function CustomLightSystem.CLSVolumeManager.InitializeVolumes
// 0x0008 (0x0008 - 0x0000)
struct CLSVolumeManager_InitializeVolumes final
{
public:
	class ACLSBaseVolume*                         InVolume;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CLSVolumeManager_InitializeVolumes;

// Function CustomLightSystem.CLSVolumeManager.SetLightManagerActive
// 0x0001 (0x0001 - 0x0000)
struct CLSVolumeManager_SetLightManagerActive final
{
public:
	bool                                          NewActive;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CLSVolumeManager_SetLightManagerActive;

// Function CustomLightSystem.CLSVolumeManager.SwitchToValidLightAndFog
// 0x0018 (0x0018 - 0x0000)
struct CLSVolumeManager_SwitchToValidLightAndFog final
{
public:
	struct FVector                                position;                                          // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CLSVolumeManager_SwitchToValidLightAndFog;

// Function CustomLightSystem.CLSVolumeManager.UpdateVolume
// 0x0018 (0x0018 - 0x0000)
struct CLSVolumeManager_UpdateVolume final
{
public:
	struct FVector                                position;                                          // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CLSVolumeManager_UpdateVolume;

// Function CustomLightSystem.CLSVolumeManager.RunVolumeProcessParameterCommand
// 0x0010 (0x0010 - 0x0000)
struct CLSVolumeManager_RunVolumeProcessParameterCommand final
{
public:
	class FString                                 TargetParameter;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CLSVolumeManager_RunVolumeProcessParameterCommand;

// Function CustomLightSystem.CLSVolumeManager.SwitchVolumeProcessParameters
// 0x0008 (0x0008 - 0x0000)
struct CLSVolumeManager_SwitchVolumeProcessParameters final
{
public:
	class ACLSBaseVolume*                         TargetVolume;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CLSVolumeManager_SwitchVolumeProcessParameters;

}

