#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Debug_Parameters

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Debug_Parameters.Debug_Parameters
// 0x01B8 (0x01B8 - 0x0000)
struct FDebug_Parameters final
{
public:
	class FString                                 NormalBias_15_8A32C7694BB9E814F5B79080A92D92FF;    // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 DebugForceOpaque_16_C804BF5D4DD6036507DFF789796FA3D2; // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 DebugDisableTriangleCull_18_F6A8E355470D11CB81EAB8B19AC1C7A6; // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 EnableReflectionDenoiser_20_12D307E54569217835508CB0D10A7977; // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 EnableShadowDenoiser_21_66089741487B775E6A06E499B3D14354; // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 EnableGIDenoiser_22_048015BE4ECE190E94DAC98FC43DBFBC; // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 EnableMaterials_86_49932A5A461504BB59F75CB217B2162E; // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 RTXSwitch_26_CF19681044E915DF3EE1B7A42E9CE572;     // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	double                                        UseShaderWPO_32_EF11C3E64B117CFB7C16B0BAA7F5A01D;  // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 ParallelMeshBatchSize_66_DD9B821743F54A691D43C8A24A9BE556; // 0x0088(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 BuildRayTracingMeshForCaustics_68_BDEEC918403656B6270A94A80C0DE5DB; // 0x0098(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ParallelMeshBatchSetup_56_86CA6095450FFE588738FC85344DC2FD; // 0x00A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 NonBlockingPipelineCreation_79_48AF81E64271EABF0A7934900DCD8A49; // 0x00B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 DynamicGeometryLastRenderTimeUpdateDistance_82_85FDD70C4ECBD20FDB4138A3032A7F47; // 0x00C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	double                                        RTXTickInterval_71_9F40A6F64535D2EC280D3A931AB6EBC1; // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PlayerMaxVelocityThreshold_73_ED82F8D84E62D435C28326AD3146CBC0; // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableAdaptiveRTXRender_76_D6F55266402401FBB0ED1293B4FEA290; // 0x00E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        UseRasterCaustics_89_538AA5884238B1737615599CDB58D3E3; // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 VolumetricScatteringIntensityScale_92_A6C5C006449DEB6D498E979D106DE13F; // 0x00F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 UseSkeletalMeshLODBias_95_0791AE8B47FA4B1E69C461BD05775B1B; // 0x0108(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 AsyncBuild_98_C5509A2A41941095244BB4AF21BA307E;    // 0x0118(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 MaxBuiltPrimitivesPerFrame_101_5C3E2B904E972515BCAFE1B2452227C0; // 0x0128(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 NiagaraUseRayTracingShadow_104_BBA72FFC4AE13955CE1D1D901C9628E3; // 0x0138(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 NiagaraShadowSupportLocalLight_106_C8173766479122BE412F13A77FDB4787; // 0x0148(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ParticleIndirectLightingScale_112_5D781F6949A23E70EC5ED29EA799FB3B; // 0x0158(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 RayTMinOffset_115_141A9E1E4AF662C272DD98B51FF50B68; // 0x0168(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 VolumetricFogGridPixelSize_118_284C27EC4A2299E78E6122BA955BC0D9; // 0x0178(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 VolumetricFogGridSizeZ_120_EDBC7293434C85D7DAE550A91C8B1256; // 0x0188(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          RTArtistParameterOverride_122_A1B6A5EF46D9B7CFC801D199C1E885B5; // 0x0198(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 TonemapperSharpen_125_6F7FF43E4B9767E311F20DBFBF88A4E2; // 0x01A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          DLSSRRSSSParameterOverride_127_E71D2B684331350521848A863B97DE14; // 0x01B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FDebug_Parameters;

}

