#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DownloadTookit

#include "Basic.hpp"

#include "DownloadTookit_structs.hpp"


namespace SDK::Params
{

// Function DownloadTookit.DownloadProxy.ReDownload
// 0x0001 (0x0001 - 0x0000)
struct DownloadProxy_ReDownload final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DownloadProxy_ReDownload;

// Function DownloadTookit.DownloadProxy.RequestDownload
// 0x0030 (0x0030 - 0x0000)
struct DownloadProxy_RequestDownload final
{
public:
	class FString                                 InURL;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InSavePathOpt;                                     // 0x0010(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInSliceOpt;                                       // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InSliceByteSizeOpt;                                // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInForceOpt;                                       // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DownloadProxy_RequestDownload;

// Function DownloadTookit.DownloadProxy.Resume
// 0x0001 (0x0001 - 0x0000)
struct DownloadProxy_Resume final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DownloadProxy_Resume;

// Function DownloadTookit.DownloadProxy.Tick
// 0x0008 (0x0008 - 0x0000)
struct DownloadProxy_Tick final
{
public:
	float                                         Delta;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DownloadProxy_Tick;

// Function DownloadTookit.DownloadProxy.GetDownloadedFileInfo
// 0x0048 (0x0048 - 0x0000)
struct DownloadProxy_GetDownloadedFileInfo final
{
public:
	struct FDownloadFile                          ReturnValue;                                       // 0x0000(0x0048)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DownloadProxy_GetDownloadedFileInfo;

// Function DownloadTookit.DownloadProxy.GetDownloadedSize
// 0x0004 (0x0004 - 0x0000)
struct DownloadProxy_GetDownloadedSize final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DownloadProxy_GetDownloadedSize;

// Function DownloadTookit.DownloadProxy.GetDownloadProgress
// 0x0004 (0x0004 - 0x0000)
struct DownloadProxy_GetDownloadProgress final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DownloadProxy_GetDownloadProgress;

// Function DownloadTookit.DownloadProxy.GetDownloadSpeed
// 0x0004 (0x0004 - 0x0000)
struct DownloadProxy_GetDownloadSpeed final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DownloadProxy_GetDownloadSpeed;

// Function DownloadTookit.DownloadProxy.GetDownloadSpeedKbs
// 0x0004 (0x0004 - 0x0000)
struct DownloadProxy_GetDownloadSpeedKbs final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DownloadProxy_GetDownloadSpeedKbs;

// Function DownloadTookit.DownloadProxy.GetDownloadStatus
// 0x0001 (0x0001 - 0x0000)
struct DownloadProxy_GetDownloadStatus final
{
public:
	EDownloadStatus                               ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DownloadProxy_GetDownloadStatus;

// Function DownloadTookit.DownloadProxy.GetTotalSize
// 0x0004 (0x0004 - 0x0000)
struct DownloadProxy_GetTotalSize final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DownloadProxy_GetTotalSize;

// Function DownloadTookit.DownloadProxy.HashCheck
// 0x0018 (0x0018 - 0x0000)
struct DownloadProxy_HashCheck final
{
public:
	class FString                                 InMD5Hash;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DownloadProxy_HashCheck;

}

