#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DualSenseAdaptor

#include "Basic.hpp"

#include "AudioExtensions_classes.hpp"


namespace SDK
{

// Class DualSenseAdaptor.DualSenseAdaptorExternalEndpointSettings
// 0x0008 (0x0030 - 0x0028)
class UDualSenseAdaptorExternalEndpointSettings final : public UAudioEndpointSettingsBase
{
public:
	int32                                         ControllerIndex;                                   // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DualSenseAdaptorExternalEndpointSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DualSenseAdaptorExternalEndpointSettings")
	}
	static class UDualSenseAdaptorExternalEndpointSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDualSenseAdaptorExternalEndpointSettings>();
	}
};
DUMPER7_ASSERTS_UDualSenseAdaptorExternalEndpointSettings;

// Class DualSenseAdaptor.DualSenseAdaptorSoundfieldEndpointSettings
// 0x0008 (0x0030 - 0x0028)
class UDualSenseAdaptorSoundfieldEndpointSettings final : public USoundfieldEndpointSettingsBase
{
public:
	int32                                         ControllerIndex;                                   // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DualSenseAdaptorSoundfieldEndpointSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DualSenseAdaptorSoundfieldEndpointSettings")
	}
	static class UDualSenseAdaptorSoundfieldEndpointSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDualSenseAdaptorSoundfieldEndpointSettings>();
	}
};
DUMPER7_ASSERTS_UDualSenseAdaptorSoundfieldEndpointSettings;

// Class DualSenseAdaptor.DualSenseAdaptorSpatializationSettings
// 0x0010 (0x0038 - 0x0028)
class UDualSenseAdaptorSpatializationSettings final : public USoundfieldEncodingSettingsBase
{
public:
	float                                         Spread;                                            // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Passthrough;                                       // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DualSenseAdaptorSpatializationSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DualSenseAdaptorSpatializationSettings")
	}
	static class UDualSenseAdaptorSpatializationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDualSenseAdaptorSpatializationSettings>();
	}
};
DUMPER7_ASSERTS_UDualSenseAdaptorSpatializationSettings;

}

