#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EnhancedInput

#include "Basic.hpp"

#include "EnhancedInput_structs.hpp"
#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function EnhancedInput.InputTrigger.UpdateState
// 0x0030 (0x0030 - 0x0000)
struct InputTrigger_UpdateState final
{
public:
	const class UEnhancedPlayerInput*             PlayerInput;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInputActionValue                      ModifiedValue;                                     // 0x0008(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         DeltaTime;                                         // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETriggerState                                 ReturnValue;                                       // 0x002C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InputTrigger_UpdateState;

// Function EnhancedInput.InputTrigger.GetTriggerType
// 0x0001 (0x0001 - 0x0000)
struct InputTrigger_GetTriggerType final
{
public:
	EnhancedInput::ETriggerType                   ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InputTrigger_GetTriggerType;

// Function EnhancedInput.InputTrigger.IsActuated
// 0x0028 (0x0028 - 0x0000)
struct InputTrigger_IsActuated final
{
public:
	struct FInputActionValue                      ForValue;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InputTrigger_IsActuated;

// Function EnhancedInput.EnhancedInputComponent.GetBoundActionValue
// 0x0028 (0x0028 - 0x0000)
struct EnhancedInputComponent_GetBoundActionValue final
{
public:
	const class UInputAction*                     Action;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInputActionValue                      ReturnValue;                                       // 0x0008(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputComponent_GetBoundActionValue;

// Function EnhancedInput.InputModifier.GetExecutionPhase
// 0x0001 (0x0001 - 0x0000)
struct InputModifier_GetExecutionPhase final
{
public:
	EModifierExecutionPhase                       ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InputModifier_GetExecutionPhase;

// Function EnhancedInput.InputModifier.GetVisualizationColor
// 0x0050 (0x0050 - 0x0000)
struct InputModifier_GetVisualizationColor final
{
public:
	struct FInputActionValue                      SampleValue;                                       // 0x0000(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FInputActionValue                      FinalValue;                                        // 0x0020(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FLinearColor                           ReturnValue;                                       // 0x0040(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InputModifier_GetVisualizationColor;

// Function EnhancedInput.InputModifier.ModifyRaw
// 0x0050 (0x0050 - 0x0000)
struct InputModifier_ModifyRaw final
{
public:
	const class UEnhancedPlayerInput*             PlayerInput;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInputActionValue                      CurrentValue;                                      // 0x0008(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         DeltaTime;                                         // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      ReturnValue;                                       // 0x0030(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InputModifier_ModifyRaw;

// Function EnhancedInput.EnhancedInputLibrary.BreakInputActionValue
// 0x0030 (0x0030 - 0x0000)
struct EnhancedInputLibrary_BreakInputActionValue final
{
public:
	struct FInputActionValue                      InActionValue;                                     // 0x0000(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         X;                                                 // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Y;                                                 // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Z;                                                 // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EnhancedInputLibrary_BreakInputActionValue;

// Function EnhancedInput.EnhancedInputLibrary.Conv_InputActionValueToAxis1D
// 0x0028 (0x0028 - 0x0000)
struct EnhancedInputLibrary_Conv_InputActionValueToAxis1D final
{
public:
	struct FInputActionValue                      InValue;                                           // 0x0000(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EnhancedInputLibrary_Conv_InputActionValueToAxis1D;

// Function EnhancedInput.EnhancedInputLibrary.Conv_InputActionValueToAxis2D
// 0x0030 (0x0030 - 0x0000)
struct EnhancedInputLibrary_Conv_InputActionValueToAxis2D final
{
public:
	struct FInputActionValue                      InValue;                                           // 0x0000(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector2D                              ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputLibrary_Conv_InputActionValueToAxis2D;

// Function EnhancedInput.EnhancedInputLibrary.Conv_InputActionValueToAxis3D
// 0x0038 (0x0038 - 0x0000)
struct EnhancedInputLibrary_Conv_InputActionValueToAxis3D final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputLibrary_Conv_InputActionValueToAxis3D;

// Function EnhancedInput.EnhancedInputLibrary.Conv_InputActionValueToBool
// 0x0028 (0x0028 - 0x0000)
struct EnhancedInputLibrary_Conv_InputActionValueToBool final
{
public:
	struct FInputActionValue                      InValue;                                           // 0x0000(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EnhancedInputLibrary_Conv_InputActionValueToBool;

// Function EnhancedInput.EnhancedInputLibrary.Conv_InputActionValueToString
// 0x0030 (0x0030 - 0x0000)
struct EnhancedInputLibrary_Conv_InputActionValueToString final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputLibrary_Conv_InputActionValueToString;

// Function EnhancedInput.EnhancedInputLibrary.GetBoundActionValue
// 0x0030 (0x0030 - 0x0000)
struct EnhancedInputLibrary_GetBoundActionValue final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UInputAction*                     Action;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInputActionValue                      ReturnValue;                                       // 0x0010(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputLibrary_GetBoundActionValue;

// Function EnhancedInput.EnhancedInputLibrary.MakeInputActionValue
// 0x0050 (0x0050 - 0x0000)
struct EnhancedInputLibrary_MakeInputActionValue final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Y;                                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Z;                                                 // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      MatchValueType;                                    // 0x0010(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FInputActionValue                      ReturnValue;                                       // 0x0030(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputLibrary_MakeInputActionValue;

// Function EnhancedInput.EnhancedInputLibrary.RequestRebuildControlMappingsUsingContext
// 0x0010 (0x0010 - 0x0000)
struct EnhancedInputLibrary_RequestRebuildControlMappingsUsingContext final
{
public:
	const class UInputMappingContext*             Context;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceImmediately;                                 // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EnhancedInputLibrary_RequestRebuildControlMappingsUsingContext;

// Function EnhancedInput.EnhancedInputSubsystemInterface.AddMappingContext
// 0x0010 (0x0010 - 0x0000)
struct EnhancedInputSubsystemInterface_AddMappingContext final
{
public:
	const class UInputMappingContext*             MappingContext;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModifyContextOptions                  Options;                                           // 0x000C(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EnhancedInputSubsystemInterface_AddMappingContext;

// Function EnhancedInput.EnhancedInputSubsystemInterface.AddPlayerMappableConfig
// 0x0010 (0x0010 - 0x0000)
struct EnhancedInputSubsystemInterface_AddPlayerMappableConfig final
{
public:
	const class UPlayerMappableInputConfig*       Config;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModifyContextOptions                  Options;                                           // 0x0008(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EnhancedInputSubsystemInterface_AddPlayerMappableConfig;

// Function EnhancedInput.EnhancedInputSubsystemInterface.AddPlayerMappedKey
// 0x0028 (0x0028 - 0x0000)
struct EnhancedInputSubsystemInterface_AddPlayerMappedKey final
{
public:
	class FName                                   MappingName;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKey                                   NewKey;                                            // 0x0008(0x0018)(ConstParm, Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModifyContextOptions                  Options;                                           // 0x0020(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputSubsystemInterface_AddPlayerMappedKey;

// Function EnhancedInput.EnhancedInputSubsystemInterface.InjectInputForAction
// 0x0048 (0x0048 - 0x0000)
struct EnhancedInputSubsystemInterface_InjectInputForAction final
{
public:
	const class UInputAction*                     Action;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInputActionValue                      RawValue;                                          // 0x0008(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	TArray<class UInputModifier*>                 Modifiers;                                         // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class UInputTrigger*>                  Triggers;                                          // 0x0038(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputSubsystemInterface_InjectInputForAction;

// Function EnhancedInput.EnhancedInputSubsystemInterface.InjectInputVectorForAction
// 0x0040 (0x0040 - 0x0000)
struct EnhancedInputSubsystemInterface_InjectInputVectorForAction final
{
public:
	const class UInputAction*                     Action;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Value;                                             // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UInputModifier*>                 Modifiers;                                         // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class UInputTrigger*>                  Triggers;                                          // 0x0030(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputSubsystemInterface_InjectInputVectorForAction;

// Function EnhancedInput.EnhancedInputSubsystemInterface.QueryMapKeyInActiveContextSet
// 0x0040 (0x0040 - 0x0000)
struct EnhancedInputSubsystemInterface_QueryMapKeyInActiveContextSet final
{
public:
	const class UInputMappingContext*             InputContext;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UInputAction*                     Action;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKey                                   Key;                                               // 0x0010(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMappingQueryIssue>             OutIssues;                                         // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	EMappingQueryIssue                            BlockingIssues;                                    // 0x0038(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMappingQueryResult                           ReturnValue;                                       // 0x0039(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EnhancedInputSubsystemInterface_QueryMapKeyInActiveContextSet;

// Function EnhancedInput.EnhancedInputSubsystemInterface.QueryMapKeyInContextSet
// 0x0050 (0x0050 - 0x0000)
struct EnhancedInputSubsystemInterface_QueryMapKeyInContextSet final
{
public:
	TArray<class UInputMappingContext*>           PrioritizedActiveContexts;                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	const class UInputMappingContext*             InputContext;                                      // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UInputAction*                     Action;                                            // 0x0018(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKey                                   Key;                                               // 0x0020(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMappingQueryIssue>             OutIssues;                                         // 0x0038(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	EMappingQueryIssue                            BlockingIssues;                                    // 0x0048(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMappingQueryResult                           ReturnValue;                                       // 0x0049(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EnhancedInputSubsystemInterface_QueryMapKeyInContextSet;

// Function EnhancedInput.EnhancedInputSubsystemInterface.RemoveMappingContext
// 0x0010 (0x0010 - 0x0000)
struct EnhancedInputSubsystemInterface_RemoveMappingContext final
{
public:
	const class UInputMappingContext*             MappingContext;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModifyContextOptions                  Options;                                           // 0x0008(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EnhancedInputSubsystemInterface_RemoveMappingContext;

// Function EnhancedInput.EnhancedInputSubsystemInterface.RemovePlayerMappableConfig
// 0x0010 (0x0010 - 0x0000)
struct EnhancedInputSubsystemInterface_RemovePlayerMappableConfig final
{
public:
	const class UPlayerMappableInputConfig*       Config;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModifyContextOptions                  Options;                                           // 0x0008(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EnhancedInputSubsystemInterface_RemovePlayerMappableConfig;

// Function EnhancedInput.EnhancedInputSubsystemInterface.RemovePlayerMappedKey
// 0x0010 (0x0010 - 0x0000)
struct EnhancedInputSubsystemInterface_RemovePlayerMappedKey final
{
public:
	class FName                                   MappingName;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModifyContextOptions                  Options;                                           // 0x0008(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputSubsystemInterface_RemovePlayerMappedKey;

// Function EnhancedInput.EnhancedInputSubsystemInterface.RequestRebuildControlMappings
// 0x0002 (0x0002 - 0x0000)
struct EnhancedInputSubsystemInterface_RequestRebuildControlMappings final
{
public:
	struct FModifyContextOptions                  Options;                                           // 0x0000(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EInputMappingRebuildType                      RebuildType;                                       // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputSubsystemInterface_RequestRebuildControlMappings;

// Function EnhancedInput.EnhancedInputSubsystemInterface.HasMappingContext
// 0x0010 (0x0010 - 0x0000)
struct EnhancedInputSubsystemInterface_HasMappingContext final
{
public:
	const class UInputMappingContext*             MappingContext;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EnhancedInputSubsystemInterface_HasMappingContext;

// Function EnhancedInput.EnhancedInputSubsystemInterface.QueryKeysMappedToAction
// 0x0018 (0x0018 - 0x0000)
struct EnhancedInputSubsystemInterface_QueryKeysMappedToAction final
{
public:
	const class UInputAction*                     Action;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FKey>                           ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedInputSubsystemInterface_QueryKeysMappedToAction;

// Function EnhancedInput.InputMappingContext.MapKey
// 0x00A8 (0x00A8 - 0x0000)
struct InputMappingContext_MapKey final
{
public:
	const class UInputAction*                     Action;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKey                                   ToKey;                                             // 0x0008(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FEnhancedActionKeyMapping              ReturnValue;                                       // 0x0020(0x0088)(Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InputMappingContext_MapKey;

// Function EnhancedInput.InputMappingContext.UnmapAction
// 0x0008 (0x0008 - 0x0000)
struct InputMappingContext_UnmapAction final
{
public:
	const class UInputAction*                     Action;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InputMappingContext_UnmapAction;

// Function EnhancedInput.InputMappingContext.UnmapKey
// 0x0020 (0x0020 - 0x0000)
struct InputMappingContext_UnmapKey final
{
public:
	const class UInputAction*                     Action;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKey                                   Key;                                               // 0x0008(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InputMappingContext_UnmapKey;

// Function EnhancedInput.PlayerMappableInputConfig.GetConfigName
// 0x0008 (0x0008 - 0x0000)
struct PlayerMappableInputConfig_GetConfigName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PlayerMappableInputConfig_GetConfigName;

// Function EnhancedInput.PlayerMappableInputConfig.GetDisplayName
// 0x0018 (0x0018 - 0x0000)
struct PlayerMappableInputConfig_GetDisplayName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PlayerMappableInputConfig_GetDisplayName;

// Function EnhancedInput.PlayerMappableInputConfig.GetKeysBoundToAction
// 0x0018 (0x0018 - 0x0000)
struct PlayerMappableInputConfig_GetKeysBoundToAction final
{
public:
	const class UInputAction*                     InAction;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FEnhancedActionKeyMapping>      ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PlayerMappableInputConfig_GetKeysBoundToAction;

// Function EnhancedInput.PlayerMappableInputConfig.GetMappingByName
// 0x0090 (0x0090 - 0x0000)
struct PlayerMappableInputConfig_GetMappingByName final
{
public:
	class FName                                   MappingName;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FEnhancedActionKeyMapping              ReturnValue;                                       // 0x0008(0x0088)(Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PlayerMappableInputConfig_GetMappingByName;

// Function EnhancedInput.PlayerMappableInputConfig.GetMappingContexts
// 0x0050 (0x0050 - 0x0000)
struct PlayerMappableInputConfig_GetMappingContexts final
{
public:
	TMap<class UInputMappingContext*, int32>      ReturnValue;                                       // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PlayerMappableInputConfig_GetMappingContexts;

// Function EnhancedInput.PlayerMappableInputConfig.GetMetaData
// 0x0008 (0x0008 - 0x0000)
struct PlayerMappableInputConfig_GetMetaData final
{
public:
	class UObject*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PlayerMappableInputConfig_GetMetaData;

// Function EnhancedInput.PlayerMappableInputConfig.GetPlayerMappableKeys
// 0x0010 (0x0010 - 0x0000)
struct PlayerMappableInputConfig_GetPlayerMappableKeys final
{
public:
	TArray<struct FEnhancedActionKeyMapping>      ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PlayerMappableInputConfig_GetPlayerMappableKeys;

// Function EnhancedInput.PlayerMappableInputConfig.IsDeprecated
// 0x0001 (0x0001 - 0x0000)
struct PlayerMappableInputConfig_IsDeprecated final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PlayerMappableInputConfig_IsDeprecated;

}

