#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FootFBIK

#include "Basic.hpp"

#include "FullBodyIK_structs.hpp"
#include "ControlRig_structs.hpp"
#include "ControlRig_classes.hpp"
#include "RigVM_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// RigVMMemoryStorageGeneratorClass FootFBIK.RigVMMemory_Work
// 0x0128 (0x0150 - 0x0028)
class FootFBIK::URigVMMemory_Work final : public URigVMMemoryStorage
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FControlRigExecuteContext              ExecuteContext_;                                   // 0x0030(0x00C0)(Edit, EditConst, NonTransactional)
	TArray<struct FFBIKEndEffector>               FullbodyIK_Effectors__IO;                          // 0x00F0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FFBIKConstraintOption>          FullbodyIK_Constraints__IO;                        // 0x0100(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FRigUnit_FullbodyIK_WorkData>   FullbodyIK_WorkData;                               // 0x0110(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FFBIKEndEffector>               FullbodyIK_1_Effectors__IO;                        // 0x0120(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FFBIKConstraintOption>          FullbodyIK_1_Constraints__IO;                      // 0x0130(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FRigUnit_FullbodyIK_WorkData>   FullbodyIK_1_WorkData;                             // 0x0140(0x0010)(Edit, EditConst, NonTransactional)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL_FULLNAME("RigVMMemoryStorageGeneratorClass FootFBIK.RigVMMemory_Work")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RigVMMemory_Work")
	}
	static class FootFBIK::URigVMMemory_Work* GetDefaultObj()
	{
		return GetDefaultObjImpl<FootFBIK::URigVMMemory_Work>();
	}
};
DUMPER7_ASSERTS_FootFBIK__URigVMMemory_Work;

// RigVMMemoryStorageGeneratorClass FootFBIK.RigVMMemory_Literal
// 0x0108 (0x0130 - 0x0028)
class FootFBIK::URigVMMemory_Literal final : public URigVMMemoryStorage
{
public:
	struct FRigElementKey                         FullbodyIK_Root__Const;                            // 0x0028(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFBIKEndEffector>               FullbodyIK_Effectors__Const;                       // 0x0038(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FFBIKConstraintOption>          FullbodyIK_Constraints__Const;                     // 0x0048(0x0010)(Edit, EditConst, NonTransactional)
	struct FSolverInput                           FullbodyIK_SolverProperty__Const;                  // 0x0058(0x0024)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FMotionProcessInput                    FullbodyIK_MotionProperty__Const;                  // 0x007C(0x0002)(Edit, EditConst, NonTransactional, NoDestructor)
	uint8                                         FullbodyIK_bPropagateToChildren__Const : 1;        // 0x007E(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_7F[0x1];                                       // 0x007F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFBIKDebugOption                       FullbodyIK_DebugOption__Const;                     // 0x0080(0x0080)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FRigElementKey                         FullbodyIK_1_Root__Const;                          // 0x0100(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFBIKEndEffector>               FullbodyIK_1_Effectors__Const;                     // 0x0110(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FFBIKConstraintOption>          FullbodyIK_1_Constraints__Const;                   // 0x0120(0x0010)(Edit, EditConst, NonTransactional)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL_FULLNAME("RigVMMemoryStorageGeneratorClass FootFBIK.RigVMMemory_Literal")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RigVMMemory_Literal")
	}
	static class FootFBIK::URigVMMemory_Literal* GetDefaultObj()
	{
		return GetDefaultObjImpl<FootFBIK::URigVMMemory_Literal>();
	}
};
DUMPER7_ASSERTS_FootFBIK__URigVMMemory_Literal;

// ControlRigBlueprintGeneratedClass FootFBIK.FootFBIK_C
// 0x0070 (0x0500 - 0x0490)
class UFootFBIK_C final : public UControlRig
{
public:
	uint8                                         Pad_488[0x8];                                      // 0x0488(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                IKEffectorRightFoot;                               // 0x0490(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                IKJointRightFoot;                                  // 0x04A8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                IKEffectorLeftFoot;                                // 0x04C0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                IKJointLeftFoot;                                   // 0x04D8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        IKRightFootAlpha;                                  // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        IKLeftFootAlpha;                                   // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("FootFBIK_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FootFBIK_C")
	}
	static class UFootFBIK_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFootFBIK_C>();
	}
};
DUMPER7_ASSERTS_UFootFBIK_C;

}

