#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GSAnimMachine

#include "Basic.hpp"

#include "SMSystem_classes.hpp"
#include "GSAnimMachine_structs.hpp"


namespace SDK
{

// Class GSAnimMachine.CustomState
// 0x0008 (0x0098 - 0x0090)
class UCustomState : public USMStateInstance
{
public:
	uint8                                         Pad_90[0x8];                                       // 0x0090(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPostStateBegin(class USMStateInstance_Base* StateInstance);
	void OnStateBegin(class USMStateInstance_Base* StateInstance);
	void OnStateEnd(class USMStateInstance_Base* StateInstance);
	void OnStateUpdate(class USMStateInstance_Base* StateInstance, float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CustomState")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CustomState")
	}
	static class UCustomState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomState>();
	}
};
DUMPER7_ASSERTS_UCustomState;

// Class GSAnimMachine.AnimState
// 0x0038 (0x00D0 - 0x0098)
class UAnimState final : public UCustomState
{
public:
	struct FAnimSettings                          AnimSettings;                                      // 0x0098(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                         PlayingTime;                                       // 0x00C8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Weight;                                            // 0x00CC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimState")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimState")
	}
	static class UAnimState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimState>();
	}
};
DUMPER7_ASSERTS_UAnimState;

// Class GSAnimMachine.AKBState
// 0x0048 (0x00E0 - 0x0098)
class UAKBState final : public UCustomState
{
public:
	struct FAKBSettings                           AKBSettings;                                       // 0x0098(0x0048)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AKBState")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AKBState")
	}
	static class UAKBState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAKBState>();
	}
};
DUMPER7_ASSERTS_UAKBState;

// Class GSAnimMachine.AnimTransition
// 0x0000 (0x0060 - 0x0060)
class UAnimTransition final : public USMTransitionInstance
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimTransition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimTransition")
	}
	static class UAnimTransition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimTransition>();
	}
};
DUMPER7_ASSERTS_UAnimTransition;

// Class GSAnimMachine.AnimMachine
// 0x0118 (0x06E8 - 0x05D0)
class UAnimMachine final : public USMInstance
{
public:
	class UUserWidget*                            OwnerWidget;                                       // 0x05D0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsPause;                                           // 0x05D8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5D9[0x7];                                      // 0x05D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UASAnimController*                      Controller;                                        // 0x05E0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAnimPlayData>                  AnimPlayData;                                      // 0x05E8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TMap<class FString, class UWidgetAnimation*>  WidgetAnimationMap;                                // 0x05F8(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	TMap<class UWidgetAnimation*, class UASAnimation*> ASAnimationMap;                               // 0x0648(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	TMap<class FString, class UGSAnimKeyStateBlender*> AnimKeyStateBlenderMap;                       // 0x0698(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)

public:
	void Init(class UUserWidget* InWidget);
	void InnerTick(float DeltaTime);
	bool IsAKBBlending(const class UCustomState* State, const struct FAKBSettings& InAKBSettings);
	bool IsAnimCanExit(const class UCustomState* State);
	void PlayAnimation(const class USMStateInstance* InState, const struct FAnimSettings& InAnimSettings);
	void SetIsPause(bool InIsPause);
	bool SwitchAKBState(const class USMStateInstance* InState, const struct FAKBSettings& InAKBSettings);
	class UASAnimation* TryGetASAnimation(class UWidgetAnimation* WidgetAnimation);
	class UWidgetAnimation* TryGetWidgetAnimation(const class FString& AnimName);

	bool TryGetPlayData(const class UCustomState* State, struct FAnimPlayData* OutPlayData) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimMachine")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimMachine")
	}
	static class UAnimMachine* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimMachine>();
	}
};
DUMPER7_ASSERTS_UAnimMachine;

}

