#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GSAnimSystem

#include "Basic.hpp"

#include "GSAnimSystem_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class GSAnimSystem.AnimSystemSettings
// 0x0008 (0x0040 - 0x0038)
class UAnimSystemSettings final : public UDeveloperSettings
{
public:
	bool                                          bEnableDebugLogs;                                  // 0x0038(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimSystemSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimSystemSettings")
	}
	static class UAnimSystemSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimSystemSettings>();
	}
};
DUMPER7_ASSERTS_UAnimSystemSettings;

// Class GSAnimSystem.ASAnimation
// 0x0078 (0x00A0 - 0x0028)
class UASAnimation final : public UObject
{
public:
	class UASAnimController*                      Controller;                                        // 0x0028(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidgetAnimation*                       Animation;                                         // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class UASBindObj*>                       BindObjSet;                                        // 0x0038(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	float                                         Weight;                                            // 0x0088(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x14];                                      // 0x008C(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ASAnimation")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ASAnimation")
	}
	static class UASAnimation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UASAnimation>();
	}
};
DUMPER7_ASSERTS_UASAnimation;

// Class GSAnimSystem.ASAnimController
// 0x00B8 (0x00E0 - 0x0028)
class UASAnimController final : public UObject
{
public:
	class UObject*                                Owner;                                             // 0x0028(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class UObject*, class UASBindObj*>       BindObjMap;                                        // 0x0030(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	TMap<class UWidgetAnimation*, class UASAnimation*> AnimMap;                                      // 0x0080(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	TArray<class UASAnimPlayer*>                  ActiveAnimPlayers;                                 // 0x00D0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)

public:
	static class UASAnimController* Create(class UObject* InWorldContext);

	class UASAnimation* CreateAnimation(class UWidgetAnimation* InAnimation);
	void Init(class UObject* InBindWidget);
	void OnTick(float DeltaTime);
	void PlayAnimation(class UASAnimation* InAnimation, const float InStartTime, const float InEndTime, const int32 InNumberOfLoops, const float InPlaybackSpeed);
	void StopAnimation(class UASAnimation* InAnimation);

	float GetAnimNormalTime(const class UASAnimation* InAnimation) const;
	class UObject* GetOwner() const;
	int32 GetPlayAnimCount(const class UASAnimation* InAnimation) const;
	bool IsAnimValid(const class UASAnimation* InAnimation) const;
	bool IsPlayingAnimation(const class UASAnimation* InAnimation) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ASAnimController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ASAnimController")
	}
	static class UASAnimController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UASAnimController>();
	}
};
DUMPER7_ASSERTS_UASAnimController;

// Class GSAnimSystem.ASAnimPlayer
// 0x0038 (0x0060 - 0x0028)
class UASAnimPlayer final : public UObject
{
public:
	class UASAnimation*                           Animation;                                         // 0x0028(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x30];                                      // 0x0030(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ASAnimPlayer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ASAnimPlayer")
	}
	static class UASAnimPlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UASAnimPlayer>();
	}
};
DUMPER7_ASSERTS_UASAnimPlayer;

// Class GSAnimSystem.ASBindObj
// 0x00C0 (0x00E8 - 0x0028)
class UASBindObj final : public UObject
{
public:
	class UObject*                                TargetObject;                                      // 0x0028(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EASObjType                                    ObjType;                                           // 0x0030(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_31[0xB7];                                      // 0x0031(0x00B7)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ASBindObj")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ASBindObj")
	}
	static class UASBindObj* GetDefaultObj()
	{
		return GetDefaultObjImpl<UASBindObj>();
	}
};
DUMPER7_ASSERTS_UASBindObj;

}

