#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GSAnimationKeyBlender

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "MovieScene_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum GSAnimationKeyBlender.EGSAnimMarginChannel
// NumValues: 0x0006
enum class EGSAnimMarginChannel : uint8
{
	GSA_MARGIN_MIN                           = 0,
	GSA_MARGIN_TOP                           = 1,
	GSA_MARGIN_LEFT                          = 2,
	GSA_MARGIN_RIGHT                         = 3,
	GSA_MARGIN_BOTTOM                        = 4,
	GSA_MARGIN_MAX                           = 5,
};

// Enum GSAnimationKeyBlender.EGSAnimColorChannel
// NumValues: 0x0006
enum class EGSAnimColorChannel : uint8
{
	GSA_COLOR_MIN                            = 0,
	GSA_COLOR_RED                            = 1,
	GSA_COLOR_GREEN                          = 2,
	GSA_COLOR_BLUE                           = 3,
	GSA_COLOR_ALPHA                          = 4,
	GSA_COLOR_MAX                            = 5,
};

// Enum GSAnimationKeyBlender.EGSAKBObjType
// NumValues: 0x0005
enum class EGSAKBObjType : uint8
{
	GSA_OBJ_TYPE_MIN                         = 0,
	GSA_OBJ_TYPE_ACTOR                       = 1,
	GSA_OBJ_TYPE_WIDGET                      = 2,
	GSA_OBJ_TYPE_MPC_INST                    = 3,
	GSA_OBJ_TYPE_MAX                         = 4,
};

// Enum GSAnimationKeyBlender.EGSAnimKBEnumBoolEasing
// NumValues: 0x0005
enum class EGSAnimKBEnumBoolEasing : uint8
{
	GSEnd                                    = 0,
	GSBegin                                  = 1,
	GSCalc                                   = 2,
	GSHalf                                   = 3,
	EGSAnimKBEnumBoolEasing_MAX              = 4,
};

// ScriptStruct GSAnimationKeyBlender.GSAKMatParamBool
// 0x0020 (0x0020 - 0x0000)
struct FGSAKMatParamBool final
{
public:
	TArray<class FName>                           BrushPropertyNamePath;                             // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	int32                                         ComponentMaterialIndex;                            // 0x0010(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ParamName;                                         // 0x0014(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Value;                                             // 0x001C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGSAKMatParamBool;

// ScriptStruct GSAnimationKeyBlender.GSAKMatParamScalar
// 0x0020 (0x0020 - 0x0000)
struct FGSAKMatParamScalar final
{
public:
	TArray<class FName>                           BrushPropertyNamePath;                             // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	int32                                         ComponentMaterialIndex;                            // 0x0010(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ParamName;                                         // 0x0014(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x001C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGSAKMatParamScalar;

// ScriptStruct GSAnimationKeyBlender.GSAKMatParamVector4
// 0x0040 (0x0040 - 0x0000)
struct FGSAKMatParamVector4 final
{
public:
	TArray<class FName>                           BrushPropertyNamePath;                             // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	int32                                         ComponentMaterialIndex;                            // 0x0010(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ParamName;                                         // 0x0014(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ValueFactor;                                       // 0x001C(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Value;                                             // 0x002C(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGSAKMatParamVector4;

// ScriptStruct GSAnimationKeyBlender.GSAKPropertyFloat
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FGSAKPropertyFloat final
{
public:
	struct FMovieScenePropertyBinding             PropertyBinding;                                   // 0x0000(0x0014)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	float                                         PropertyValue;                                     // 0x0014(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x10];                                      // 0x0018(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGSAKPropertyFloat;

// ScriptStruct GSAnimationKeyBlender.GSAKPropertyDouble
// 0x0030 (0x0030 - 0x0000)
struct FGSAKPropertyDouble final
{
public:
	struct FMovieScenePropertyBinding             PropertyBinding;                                   // 0x0000(0x0014)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        PropertyValue;                                     // 0x0018(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20[0x10];                                      // 0x0020(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGSAKPropertyDouble;

// ScriptStruct GSAnimationKeyBlender.GSAKPropertyLinearColor
// 0x0048 (0x0048 - 0x0000)
struct alignas(0x08) FGSAKPropertyLinearColor final
{
public:
	struct FMovieScenePropertyBinding             PropertyBinding;                                   // 0x0000(0x0014)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FLinearColor                           PropertyFactor;                                    // 0x0014(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           PropertyValue;                                     // 0x0024(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x14];                                      // 0x0034(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGSAKPropertyLinearColor;

// ScriptStruct GSAnimationKeyBlender.GSAKPropertyObjectProperty
// 0x0030 (0x0030 - 0x0000)
struct FGSAKPropertyObjectProperty final
{
public:
	struct FMovieScenePropertyBinding             PropertyBinding;                                   // 0x0000(0x0014)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                PropertyValue;                                     // 0x0018(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20[0x10];                                      // 0x0020(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGSAKPropertyObjectProperty;

// ScriptStruct GSAnimationKeyBlender.GSAKPropertyMargin
// 0x0048 (0x0048 - 0x0000)
struct alignas(0x08) FGSAKPropertyMargin final
{
public:
	struct FMovieScenePropertyBinding             PropertyBinding;                                   // 0x0000(0x0014)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                PropertyFactor;                                    // 0x0014(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                PropertyValue;                                     // 0x0024(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x14];                                      // 0x0034(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGSAKPropertyMargin;

// ScriptStruct GSAnimationKeyBlender.GSAKPropertyVector4
// 0x0070 (0x0070 - 0x0000)
struct FGSAKPropertyVector4 final
{
public:
	struct FMovieScenePropertyBinding             PropertyBinding;                                   // 0x0000(0x0014)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         VectorDimension;                                   // 0x0014(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               PropertyFactor;                                    // 0x0020(0x0020)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector4                               PropertyValue;                                     // 0x0040(0x0020)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_60[0x10];                                      // 0x0060(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGSAKPropertyVector4;

// ScriptStruct GSAnimationKeyBlender.GSAKPropertyByte
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FGSAKPropertyByte final
{
public:
	struct FMovieScenePropertyBinding             PropertyBinding;                                   // 0x0000(0x0014)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         PropertyValue;                                     // 0x0014(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x13];                                      // 0x0015(0x0013)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGSAKPropertyByte;

// ScriptStruct GSAnimationKeyBlender.GSAKPropertyInteger
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FGSAKPropertyInteger final
{
public:
	struct FMovieScenePropertyBinding             PropertyBinding;                                   // 0x0000(0x0014)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         PropertyValue;                                     // 0x0014(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x10];                                      // 0x0018(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGSAKPropertyInteger;

// ScriptStruct GSAnimationKeyBlender.GSAKPropertyBool
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FGSAKPropertyBool final
{
public:
	struct FMovieScenePropertyBinding             PropertyBinding;                                   // 0x0000(0x0014)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          PropertyValue;                                     // 0x0014(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x13];                                      // 0x0015(0x0013)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGSAKPropertyBool;

// ScriptStruct GSAnimationKeyBlender.GSAnimKeyCachedMatParamData
// 0x00F0 (0x00F0 - 0x0000)
struct FGSAnimKeyCachedMatParamData
{
public:
	TMap<class FString, struct FGSAKMatParamBool> MatParamBoolMap;                                   // 0x0000(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	TMap<class FString, struct FGSAKMatParamScalar> MatParamScalarMap;                               // 0x0050(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	TMap<class FString, struct FGSAKMatParamVector4> MatParamVector4Map;                             // 0x00A0(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGSAnimKeyCachedMatParamData;

// ScriptStruct GSAnimationKeyBlender.GSAnimKeyStateData
// 0x0400 (0x04F0 - 0x00F0)
struct FGSAnimKeyStateData final : public FGSAnimKeyCachedMatParamData
{
public:
	class FName                                   StateName;                                         // 0x00F0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFrameNumber                           FrameNumber;                                       // 0x00F8(0x0004)(Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              TranslationFactor;                                 // 0x0100(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngleFactor;                                       // 0x0110(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              ScaleFactor;                                       // 0x0118(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ShearFactor;                                       // 0x0128(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWidgetTransform                       WidgetTransform;                                   // 0x0138(0x0038)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                WorldTranslationFactor;                            // 0x0170(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                WorldScale3DFactor;                                // 0x0188(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                WorldRotate3DFactor;                               // 0x01A0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B8[0x8];                                      // 0x01B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             WorldTransform;                                    // 0x01C0(0x0060)(Edit, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TMap<class FName, struct FGSAKPropertyFloat>  PropertyFloatMap;                                  // 0x0220(0x0050)(Edit, EditConst, NativeAccessSpecifierPublic)
	TMap<class FName, struct FGSAKPropertyDouble> PropertyDoubleMap;                                 // 0x0270(0x0050)(Edit, EditConst, NativeAccessSpecifierPublic)
	TMap<class FName, struct FGSAKPropertyByte>   PropertyByteMap;                                   // 0x02C0(0x0050)(Edit, EditConst, NativeAccessSpecifierPublic)
	TMap<class FName, struct FGSAKPropertyVector4> PropertyVector4Map;                               // 0x0310(0x0050)(Edit, EditConst, NativeAccessSpecifierPublic)
	TMap<class FName, struct FGSAKPropertyInteger> PropertyIntegerMap;                               // 0x0360(0x0050)(Edit, EditConst, NativeAccessSpecifierPublic)
	TMap<class FName, struct FGSAKPropertyBool>   PropertyBoolMap;                                   // 0x03B0(0x0050)(Edit, EditConst, NativeAccessSpecifierPublic)
	TMap<class FName, struct FGSAKPropertyLinearColor> PropertyLinearColorMap;                       // 0x0400(0x0050)(Edit, EditConst, NativeAccessSpecifierPublic)
	TMap<class FName, struct FGSAKPropertyMargin> PropertyMarginMap;                                 // 0x0450(0x0050)(Edit, EditConst, NativeAccessSpecifierPublic)
	TMap<class FName, struct FGSAKPropertyObjectProperty> PropertyObjectPropertyMap;                 // 0x04A0(0x0050)(Edit, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGSAnimKeyStateData;

// ScriptStruct GSAnimationKeyBlender.GSAnimKeyObjST
// 0x0030 (0x0030 - 0x0000)
struct FGSAnimKeyObjST final
{
public:
	class UObject*                                TargetObject;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGSAKBObjType                                 ObjType;                                           // 0x0008(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  BindedGuid;                                        // 0x000C(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsSubActor;                                        // 0x001C(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGSAnimKeyStateData>            StateKeyDataList;                                  // 0x0020(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGSAnimKeyObjST;

// ScriptStruct GSAnimationKeyBlender.GSAKObjectEasingOneToOneStateData
// 0x0A00 (0x0A00 - 0x0000)
struct FGSAKObjectEasingOneToOneStateData final
{
public:
	class UObject*                                TargetObject;                                      // 0x0000(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGSAKBObjType                                 ObjType;                                           // 0x0008(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  BindedGuid;                                        // 0x000C(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsSubActor;                                        // 0x001C(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGSAnimKeyStateData                    BeginStateData;                                    // 0x0020(0x04F0)(Edit, EditConst, NativeAccessSpecifierPublic)
	struct FGSAnimKeyStateData                    EndStateData;                                      // 0x0510(0x04F0)(Edit, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGSAKObjectEasingOneToOneStateData;

// ScriptStruct GSAnimationKeyBlender.GSAKBStateEasingCfg
// 0x0018 (0x0018 - 0x0000)
struct FGSAKBStateEasingCfg final
{
public:
	float                                         EasingTime;                                        // 0x0000(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DelayEasingTime;                                   // 0x0004(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEasingFunc                                   EasingFunc;                                        // 0x0008(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         EasingBlendExp;                                    // 0x000C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EasingSteps;                                       // 0x0010(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGSAnimKBEnumBoolEasing                       EnumValEasingType;                                 // 0x0014(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGSAnimKBEnumBoolEasing                       BoolValEasingType;                                 // 0x0015(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGSAKBStateEasingCfg;

}

