#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GSAnimationKeyBlender

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GSAnimationKeyBlender_structs.hpp"


namespace SDK::Params
{

// Function GSAnimationKeyBlender.GSAnimKeyStateBlender.BeforeInitAddBindingActor
// 0x0018 (0x0018 - 0x0000)
struct GSAnimKeyStateBlender_BeforeInitAddBindingActor final
{
public:
	class ALevelSequenceActor*                    RefLevelSequenceActor;                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BindingActorTagName;                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 InActor;                                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSAnimKeyStateBlender_BeforeInitAddBindingActor;

// Function GSAnimationKeyBlender.GSAnimKeyStateBlender.DoTick
// 0x0004 (0x0004 - 0x0000)
struct GSAnimKeyStateBlender_DoTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSAnimKeyStateBlender_DoTick;

// Function GSAnimationKeyBlender.GSAnimKeyStateBlender.EasingToEndState
// 0x0008 (0x0008 - 0x0000)
struct GSAnimKeyStateBlender_EasingToEndState final
{
public:
	float                                         alpha;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsFromForceSetStateImmediately;                    // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSAnimKeyStateBlender_EasingToEndState;

// Function GSAnimationKeyBlender.GSAnimKeyStateBlender.ForceSetStateImmediately
// 0x0008 (0x0008 - 0x0000)
struct GSAnimKeyStateBlender_ForceSetStateImmediately final
{
public:
	class FName                                   TargetStateName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSAnimKeyStateBlender_ForceSetStateImmediately;

// Function GSAnimationKeyBlender.GSAnimKeyStateBlender.GetBeginStateName
// 0x0008 (0x0008 - 0x0000)
struct GSAnimKeyStateBlender_GetBeginStateName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSAnimKeyStateBlender_GetBeginStateName;

// Function GSAnimationKeyBlender.GSAnimKeyStateBlender.GetCurrentStateName
// 0x0008 (0x0008 - 0x0000)
struct GSAnimKeyStateBlender_GetCurrentStateName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSAnimKeyStateBlender_GetCurrentStateName;

// Function GSAnimationKeyBlender.GSAnimKeyStateBlender.GetEndStateName
// 0x0008 (0x0008 - 0x0000)
struct GSAnimKeyStateBlender_GetEndStateName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSAnimKeyStateBlender_GetEndStateName;

// Function GSAnimationKeyBlender.GSAnimKeyStateBlender.GetPredicToStateCfgEasingTime
// 0x0010 (0x0010 - 0x0000)
struct GSAnimKeyStateBlender_GetPredicToStateCfgEasingTime final
{
public:
	class FName                                   TargetStateName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutDelayEasingTime;                                // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSAnimKeyStateBlender_GetPredicToStateCfgEasingTime;

// Function GSAnimationKeyBlender.GSAnimKeyStateBlender.InitAddStateToStateEasingCfg
// 0x0028 (0x0028 - 0x0000)
struct GSAnimKeyStateBlender_InitAddStateToStateEasingCfg final
{
public:
	class FName                                   FromStateName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ToStateName;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InEasingTime;                                      // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEasingFunc                                   InEasingFunc;                                      // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InEasingBlendExp;                                  // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InEasingSteps;                                     // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGSAnimKBEnumBoolEasing                       InEnumValEasingType;                               // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGSAnimKBEnumBoolEasing                       InBoolValEasingType;                               // 0x0021(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InDelayEasingTime;                                 // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSAnimKeyStateBlender_InitAddStateToStateEasingCfg;

// Function GSAnimationKeyBlender.GSAnimKeyStateBlender.InitSetDefaultEasingCfg
// 0x0018 (0x0018 - 0x0000)
struct GSAnimKeyStateBlender_InitSetDefaultEasingCfg final
{
public:
	float                                         InEasingTime;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEasingFunc                                   InEasingFunc;                                      // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InEasingBlendExp;                                  // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InEasingSteps;                                     // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGSAnimKBEnumBoolEasing                       InEnumValEasingType;                               // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGSAnimKBEnumBoolEasing                       InBoolValEasingType;                               // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InDelayEasingTime;                                 // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSAnimKeyStateBlender_InitSetDefaultEasingCfg;

// Function GSAnimationKeyBlender.GSAnimKeyStateBlender.InitSetLevelSequence
// 0x0018 (0x0018 - 0x0000)
struct GSAnimKeyStateBlender_InitSetLevelSequence final
{
public:
	class UObject*                                InRefObject;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULevelSequence*                         InLevelSequence;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InIsStrictStateMatchCfg;                           // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InIsAlwaysUsingEndStateAsChanging;                 // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSAnimKeyStateBlender_InitSetLevelSequence;

// Function GSAnimationKeyBlender.GSAnimKeyStateBlender.InitSetWidgetAnimation
// 0x0018 (0x0018 - 0x0000)
struct GSAnimKeyStateBlender_InitSetWidgetAnimation final
{
public:
	class UUserWidget*                            InRefUserWidget;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidgetAnimation*                       InWidgetAnimation;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InIsStrictStateMatchCfg;                           // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InIsAlwaysUsingEndStateAsChanging;                 // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSAnimKeyStateBlender_InitSetWidgetAnimation;

// Function GSAnimationKeyBlender.GSAnimKeyStateBlender.IsInBlending
// 0x0001 (0x0001 - 0x0000)
struct GSAnimKeyStateBlender_IsInBlending final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSAnimKeyStateBlender_IsInBlending;

// Function GSAnimationKeyBlender.GSAnimKeyStateBlender.ToState
// 0x0010 (0x0010 - 0x0000)
struct GSAnimKeyStateBlender_ToState final
{
public:
	class FName                                   TargetStateName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InStateDelayEasingTime;                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InStateOverideEasingTime;                          // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSAnimKeyStateBlender_ToState;

// Function GSAnimationKeyBlender.GSAnimKeyStateBlenderUtil.RegAnimKeyStateBlenderObjForTick
// 0x0008 (0x0008 - 0x0000)
struct GSAnimKeyStateBlenderUtil_RegAnimKeyStateBlenderObjForTick final
{
public:
	class UGSAnimKeyStateBlender*                 AnimKeyStateBlender;                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSAnimKeyStateBlenderUtil_RegAnimKeyStateBlenderObjForTick;

// Function GSAnimationKeyBlender.GSAnimKeyStateBlenderUtil.UnRegAnimKeyStateBlenderObjForTick
// 0x0008 (0x0008 - 0x0000)
struct GSAnimKeyStateBlenderUtil_UnRegAnimKeyStateBlenderObjForTick final
{
public:
	class UGSAnimKeyStateBlender*                 AnimKeyStateBlender;                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSAnimKeyStateBlenderUtil_UnRegAnimKeyStateBlenderObjForTick;

}

