#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GSDataShare

#include "Basic.hpp"


namespace SDK::Params
{

// Function GSDataShare.GSDataShareAPI.BPCheckDataValid
// 0x0004 (0x0004 - 0x0000)
struct GSDataShareAPI_BPCheckDataValid final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSDataShareAPI_BPCheckDataValid;

// Function GSDataShare.GSDataShareAPI.BPInitLoadData
// 0x0004 (0x0004 - 0x0000)
struct GSDataShareAPI_BPInitLoadData final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSDataShareAPI_BPInitLoadData;

// Function GSDataShare.GSDataShareAPI.BPReloadData
// 0x0004 (0x0004 - 0x0000)
struct GSDataShareAPI_BPReloadData final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSDataShareAPI_BPReloadData;

// Function GSDataShare.GSDataShareAPIHelper.IsAssetExist
// 0x0018 (0x0018 - 0x0000)
struct GSDataShareAPIHelper_IsAssetExist final
{
public:
	class FString                                 AssetPath;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSDataShareAPIHelper_IsAssetExist;

}

