#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GSDisplayDebug

#include "Basic.hpp"

#include "GSDisplayDebug_structs.hpp"


namespace SDK::Params
{

// Function GSDisplayDebug.GSDisplayDebugObserver.Register
// 0x0010 (0x0010 - 0x0000)
struct GSDisplayDebugObserver_Register final
{
public:
	class UGSDisplayDebugObserver*                Observer;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsRegister;                                        // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSDisplayDebugObserver_Register;

// Function GSDisplayDebug.GSDisplayDebugObserver.FetchDebugInfo
// 0x0018 (0x0018 - 0x0000)
struct GSDisplayDebugObserver_FetchDebugInfo final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGSDebugInfo>                   DebugInfos;                                        // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSDisplayDebugObserver_FetchDebugInfo;

// Function GSDisplayDebug.GSDisplayDebugObserver.GetDisplayDebugNames
// 0x0010 (0x0010 - 0x0000)
struct GSDisplayDebugObserver_GetDisplayDebugNames final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSDisplayDebugObserver_GetDisplayDebugNames;

}

