#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GSEngineExtent

#include "Basic.hpp"

#include "CinematicCamera_classes.hpp"
#include "GSEngineExtent_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class GSEngineExtent.AnimNotify_PlayDummyEfx
// 0x0028 (0x0060 - 0x0038)
class UAnimNotify_PlayDummyEfx final : public UAnimNotify
{
public:
	TSubclassOf<class AActor>                     DummyActorClass;                                   // 0x0038(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAnimNotify_DummyEfx>           DummyEfxs;                                         // 0x0040(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	class UAnimSequence*                          AnimSeq;                                           // 0x0050(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxLifetime;                                       // 0x0058(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotify_PlayDummyEfx")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotify_PlayDummyEfx")
	}
	static class UAnimNotify_PlayDummyEfx* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_PlayDummyEfx>();
	}
};
DUMPER7_ASSERTS_UAnimNotify_PlayDummyEfx;

// Class GSEngineExtent.GSEDestructibleMeshGenComponent
// 0x01F8 (0x02B8 - 0x00C0)
class UGSEDestructibleMeshGenComponent final : public UActorComponent
{
public:
	class UBlueprint*                             TargetBlueprint;                                   // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FolderPath;                                        // 0x00C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UDestructibleComponent*>         DestructibleComponentArray;                        // 0x00D8(0x0010)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<class FName>                           BoneNameArray;                                     // 0x00E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	bool                                          bUseCustomCollisionToDefault;                      // 0x00F8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRefreshPriviewObjectsOnAnimalMesh;                // 0x00F9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBodyInstance                          BodyInstance;                                      // 0x0100(0x0190)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class UCurveFloat*                            FloatCurve;                                        // 0x0290(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ParamName;                                         // 0x0298(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(float curvetime)> FloatCurveTick;                                  // 0x02A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B0[0x8];                                      // 0x02B0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool CallFloatCurve();
	bool SetAllCollisionEnabledForce(ECollisionEnabled NewType);
	bool SetAllCollisionObjectType(ECollisionChannel Channel);
	bool SetAllCollisionResponseToAllChannels(ECollisionResponse NewResponse);
	bool SetAllCollisionResponseToChannel(ECollisionChannel Channel, ECollisionResponse NewResponse);
	bool SetCollisionEnabledForce(ECollisionEnabled NewType, class UDestructibleComponent* Comp);
	bool SetCollisionEnabledForceByName(ECollisionEnabled NewType, const class FString& Name_0);
	bool SetCollisionObjectType(ECollisionChannel Channel, class UDestructibleComponent* Comp);
	bool SetCollisionObjectTypeByName(ECollisionChannel Channel, const class FString& Name_0);
	bool SetCollisionResponseToAllChannels(ECollisionResponse NewResponse, class UDestructibleComponent* Comp);
	bool SetCollisionResponseToAllChannelsByName(ECollisionResponse NewResponse, const class FString& Name_0);
	bool SetCollisionResponseToChannel(ECollisionChannel Channel, ECollisionResponse NewResponse, class UDestructibleComponent* Comp);
	bool SetCollisionResponseToChannelByName(ECollisionChannel Channel, ECollisionResponse NewResponse, const class FString& Name_0);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSEDestructibleMeshGenComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSEDestructibleMeshGenComponent")
	}
	static class UGSEDestructibleMeshGenComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSEDestructibleMeshGenComponent>();
	}
};
DUMPER7_ASSERTS_UGSEDestructibleMeshGenComponent;

// Class GSEngineExtent.EditorFuncLibCommon
// 0x0000 (0x0028 - 0x0028)
class UEditorFuncLibCommon final : public UBlueprintFunctionLibrary
{
public:
	static int32 UMGTemplate_GetLearnID(int32 UnitID, int32 LearnID);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EditorFuncLibCommon")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EditorFuncLibCommon")
	}
	static class UEditorFuncLibCommon* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorFuncLibCommon>();
	}
};
DUMPER7_ASSERTS_UEditorFuncLibCommon;

// Class GSEngineExtent.GSDPICustomScalingRuleInCPP
// 0x0000 (0x0028 - 0x0028)
class UGSDPICustomScalingRuleInCPP final : public UDPICustomScalingRule
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSDPICustomScalingRuleInCPP")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSDPICustomScalingRuleInCPP")
	}
	static class UGSDPICustomScalingRuleInCPP* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSDPICustomScalingRuleInCPP>();
	}
};
DUMPER7_ASSERTS_UGSDPICustomScalingRuleInCPP;

// Class GSEngineExtent.GSEActorComponent
// 0x0000 (0x00C0 - 0x00C0)
class UGSEActorComponent final : public UActorComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSEActorComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSEActorComponent")
	}
	static class UGSEActorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSEActorComponent>();
	}
};
DUMPER7_ASSERTS_UGSEActorComponent;

// Class GSEngineExtent.GSEBlastMeshActor
// 0x0000 (0x0288 - 0x0288)
class AGSEBlastMeshActor final : public AActor
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSEBlastMeshActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSEBlastMeshActor")
	}
	static class AGSEBlastMeshActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGSEBlastMeshActor>();
	}
};
DUMPER7_ASSERTS_AGSEBlastMeshActor;

// Class GSEngineExtent.GSECameraRig_Rail
// 0x0000 (0x02A8 - 0x02A8)
class AGSECameraRig_Rail final : public ACameraRig_Rail
{
public:
	float GetSplineLength();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSECameraRig_Rail")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSECameraRig_Rail")
	}
	static class AGSECameraRig_Rail* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGSECameraRig_Rail>();
	}
};
DUMPER7_ASSERTS_AGSECameraRig_Rail;

// Class GSEngineExtent.GSELuaActor
// 0x0000 (0x0288 - 0x0288)
class AGSELuaActor final : public AActor
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSELuaActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSELuaActor")
	}
	static class AGSELuaActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGSELuaActor>();
	}
};
DUMPER7_ASSERTS_AGSELuaActor;

// Class GSEngineExtent.GSELuaStateUObj
// 0x0000 (0x0028 - 0x0028)
class UGSELuaStateUObj final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSELuaStateUObj")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSELuaStateUObj")
	}
	static class UGSELuaStateUObj* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSELuaStateUObj>();
	}
};
DUMPER7_ASSERTS_UGSELuaStateUObj;

// Class GSEngineExtent.GSELuaFuncLib
// 0x0000 (0x0028 - 0x0028)
class UGSELuaFuncLib final : public UBlueprintFunctionLibrary
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSELuaFuncLib")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSELuaFuncLib")
	}
	static class UGSELuaFuncLib* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSELuaFuncLib>();
	}
};
DUMPER7_ASSERTS_UGSELuaFuncLib;

// Class GSEngineExtent.GSPMLocationBoneSocket
// 0x00A0 (0x00D0 - 0x0030)
class UGSPMLocationBoneSocket final : public UParticleModuleLocationBase
{
public:
	ELocationBoneSocketSource                     SourceType;                                        // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                UniversalOffset;                                   // 0x0038(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         SelectAllBoneOp : 1;                               // 0x0050(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         ClearAllBoneOp : 1;                                // 0x0050(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLocationBoneSocketInfo>        SourceLocations;                                   // 0x0058(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPMLocationBoneSocketBoneInfo>  NeedAddRootBoneNames;                              // 0x0068(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_78[0x10];                                      // 0x0078(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPMLocationBoneSocketBoneInfo>  NeedDeleteRootBoneNames;                           // 0x0088(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_98[0x10];                                      // 0x0098(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	ELocationBoneSocketSelectionMethod            SelectionMethod;                                   // 0x00A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bUpdatePositionEachFrame : 1;                      // 0x00AC(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOrientMeshEmitters : 1;                           // 0x00AC(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bInheritBoneVelocity : 1;                          // 0x00AC(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InheritVelocityScale;                              // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SkelMeshActorParamName;                            // 0x00B4(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumPreSelectedIndices;                             // 0x00BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bAlwaysKeepWorldScale : 1;                         // 0x00C0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   RefScaleSocketNameInMesh;                          // 0x00C4(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSPMLocationBoneSocket")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSPMLocationBoneSocket")
	}
	static class UGSPMLocationBoneSocket* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSPMLocationBoneSocket>();
	}
};
DUMPER7_ASSERTS_UGSPMLocationBoneSocket;

// Class GSEngineExtent.GSPMLocationSkelVertSurface
// 0x00C0 (0x00F0 - 0x0030)
class UGSPMLocationSkelVertSurface final : public UParticleModuleLocationBase
{
public:
	ELocationSkelVertSurfaceSource                SourceType;                                        // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                UniversalOffset;                                   // 0x0038(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bUpdatePositionEachFrame : 1;                      // 0x0050(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOrientMeshEmitters : 1;                           // 0x0050(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bInheritBoneVelocity : 1;                          // 0x0050(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InheritVelocityScale;                              // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SkelMeshActorParamName;                            // 0x0058(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           ValidAssociatedBones;                              // 0x0060(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPMLocationSkelVertSurfaceBoneInfo> NeedAddRootBoneNames;                          // 0x0070(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_80[0x10];                                      // 0x0080(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPMLocationSkelVertSurfaceBoneInfo> NeedDeleteRootBoneNames;                       // 0x0090(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_A0[0x10];                                      // 0x00A0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         SelectAllBoneOp : 1;                               // 0x00B0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         ClearAllBoneOp : 1;                                // 0x00B0(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnforceNormalCheck : 1;                           // 0x00B0(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                NormalToCompare;                                   // 0x00B8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NormalCheckToleranceDegrees;                       // 0x00D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NormalCheckTolerance;                              // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 ValidMaterialIndices;                              // 0x00D8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         bInheritVertexColor : 1;                           // 0x00E8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bInheritUV : 1;                                    // 0x00E8(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        InheritUVChannel;                                  // 0x00EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSPMLocationSkelVertSurface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSPMLocationSkelVertSurface")
	}
	static class UGSPMLocationSkelVertSurface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSPMLocationSkelVertSurface>();
	}
};
DUMPER7_ASSERTS_UGSPMLocationSkelVertSurface;

// Class GSEngineExtent.GSPMBase
// 0x0000 (0x0030 - 0x0030)
class UGSPMBase : public UParticleModule
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSPMBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSPMBase")
	}
	static class UGSPMBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSPMBase>();
	}
};
DUMPER7_ASSERTS_UGSPMBase;

// Class GSEngineExtent.GSPMMeshSetParamByCurve
// 0x0040 (0x0070 - 0x0030)
class UGSPMMeshSetParamByCurve final : public UGSPMBase
{
public:
	struct FRawDistributionFloat                  FloatCurve;                                        // 0x0030(0x0030)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class FName                                   MeshMaterialParamName;                             // 0x0060(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SkelMeshActorParamName;                            // 0x0068(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSPMMeshSetParamByCurve")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSPMMeshSetParamByCurve")
	}
	static class UGSPMMeshSetParamByCurve* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSPMMeshSetParamByCurve>();
	}
};
DUMPER7_ASSERTS_UGSPMMeshSetParamByCurve;

// Class GSEngineExtent.GSPMSizeScaleKeep
// 0x0010 (0x0040 - 0x0030)
class UGSPMSizeScaleKeep final : public UParticleModuleLocationBase
{
public:
	uint8                                         bAlwaysKeepWorldScale : 1;                         // 0x0030(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   RefScaleSocketNameInMesh;                          // 0x0034(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSPMSizeScaleKeep")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSPMSizeScaleKeep")
	}
	static class UGSPMSizeScaleKeep* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSPMSizeScaleKeep>();
	}
};
DUMPER7_ASSERTS_UGSPMSizeScaleKeep;

// Class GSEngineExtent.GSPMWorldOffset
// 0x0000 (0x0098 - 0x0098)
class UGSPMWorldOffset final : public UParticleModuleLocationWorldOffset
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSPMWorldOffset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSPMWorldOffset")
	}
	static class UGSPMWorldOffset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSPMWorldOffset>();
	}
};
DUMPER7_ASSERTS_UGSPMWorldOffset;

// Class GSEngineExtent.GSSceneCaptureComponent2D
// 0x0000 (0x0C40 - 0x0C40)
class UGSSceneCaptureComponent2D final : public USceneCaptureComponent2D
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSSceneCaptureComponent2D")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSSceneCaptureComponent2D")
	}
	static class UGSSceneCaptureComponent2D* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSSceneCaptureComponent2D>();
	}
};
DUMPER7_ASSERTS_UGSSceneCaptureComponent2D;

// Class GSEngineExtent.GSViewPortRatioUtil
// 0x0000 (0x0028 - 0x0028)
class UGSViewPortRatioUtil final : public UBlueprintFunctionLibrary
{
public:
	static void CalcCachedData(class UObject* WorldContext, int32* OutRefViewPortWidth, int32* OutRefViewPortHeight, float* OutCfgMaxRatioMin, float* OutCfgMaxRatioMax, float* OutCfgMinRatio, float* OutCfgRefHeightDPIScale, EGSForceRatioType* OutForceRatioTye, EGSConstraintAspectRatioType* OutConstraintAspectRatioType, float* OutRatio);
	static void CalcCameraRatioInner(int32 RefViewPortWidth, int32 RefViewPortHeight, float* TargetRatio, EGSConstraintAspectRatioType* ConstraintAspectRatioType);
	static void CalcCameraRatioInnerWithRatioType(int32 RefViewPortWidth, int32 RefViewPortHeight, EGSForceRatioType InForceRatioType, float* TargetRatio, EGSConstraintAspectRatioType* ConstraintAspectRatioType);
	static EGSForceRatioType GetForceRatioType();
	static void InitSetCfg(float InCfgMaxRatioMin, float InCfgMaxRatioMax, float InCfgMinRatio, float InCfgRefHeightDPIScale);
	static void SetForceRatioType(EGSForceRatioType NewType);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSViewPortRatioUtil")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSViewPortRatioUtil")
	}
	static class UGSViewPortRatioUtil* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSViewPortRatioUtil>();
	}
};
DUMPER7_ASSERTS_UGSViewPortRatioUtil;

// Class GSEngineExtent.GSE_WWiseParticleAsset
// 0x0008 (0x0038 - 0x0030)
class UGSE_WWiseParticleAsset final : public UPrimaryDataAsset
{
public:
	class UParticleSystem*                        ParticleSystem;                                    // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSE_WWiseParticleAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSE_WWiseParticleAsset")
	}
	static class UGSE_WWiseParticleAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSE_WWiseParticleAsset>();
	}
};
DUMPER7_ASSERTS_UGSE_WWiseParticleAsset;

}

