#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GSInput

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GSInput_structs.hpp"
#include "SlateCore_structs.hpp"
#include "EnhancedInput_structs.hpp"


namespace SDK::Params
{

// Function GSInput.GSE_InputFuncLib.AddInputMappingContext
// 0x0018 (0x0018 - 0x0000)
struct GSE_InputFuncLib_AddInputMappingContext final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UInputMappingContext*             InputMappingContext;                               // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreAllPressedKeysUntilRelease;                 // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceImmediately;                                 // 0x0015(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSE_InputFuncLib_AddInputMappingContext;

// Function GSInput.GSE_InputFuncLib.AddPlayerMappedKey
// 0x0030 (0x0030 - 0x0000)
struct GSE_InputFuncLib_AddPlayerMappedKey final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MappingName;                                       // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKey                                   NewKey;                                            // 0x0010(0x0018)(ConstParm, Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModifyContextOptions                  Options;                                           // 0x0028(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSE_InputFuncLib_AddPlayerMappedKey;

// Function GSInput.GSE_InputFuncLib.BindAction
// 0x0018 (0x0018 - 0x0000)
struct GSE_InputFuncLib_BindAction final
{
public:
	class UGSInputComponent*                      InputComponent;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UInputAction*                     InputAction;                                       // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETriggerEvent                                 TriggerEvent;                                      // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSE_InputFuncLib_BindAction;

// Function GSInput.GSE_InputFuncLib.ClearAllInputMappingContext
// 0x0008 (0x0008 - 0x0000)
struct GSE_InputFuncLib_ClearAllInputMappingContext final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_InputFuncLib_ClearAllInputMappingContext;

// Function GSInput.GSE_InputFuncLib.CustomizeInputMappingContext
// 0x0018 (0x0018 - 0x0000)
struct GSE_InputFuncLib_CustomizeInputMappingContext final
{
public:
	class UInputMappingContext*                   MappingContext;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MappableName;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   KeyName;                                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_InputFuncLib_CustomizeInputMappingContext;

// Function GSInput.GSE_InputFuncLib.FindKeyByName
// 0x0020 (0x0020 - 0x0000)
struct GSE_InputFuncLib_FindKeyByName final
{
public:
	class FName                                   KeyName;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKey                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_InputFuncLib_FindKeyByName;

// Function GSInput.GSE_InputFuncLib.FlushPressedInput
// 0x0008 (0x0008 - 0x0000)
struct GSE_InputFuncLib_FlushPressedInput final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_InputFuncLib_FlushPressedInput;

// Function GSInput.GSE_InputFuncLib.GetActionNamesFromInputMappingContext
// 0x0018 (0x0018 - 0x0000)
struct GSE_InputFuncLib_GetActionNamesFromInputMappingContext final
{
public:
	class UInputMappingContext*                   InputMappingContext;                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_InputFuncLib_GetActionNamesFromInputMappingContext;

// Function GSInput.GSE_InputFuncLib.GetChordInputAction
// 0x0018 (0x0018 - 0x0000)
struct GSE_InputFuncLib_GetChordInputAction final
{
public:
	const class UInputMappingContext*             InputMappingContext;                               // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UInputAction*>                   ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_InputFuncLib_GetChordInputAction;

// Function GSInput.GSE_InputFuncLib.GetConflictChordInputAction
// 0x0038 (0x0038 - 0x0000)
struct GSE_InputFuncLib_GetConflictChordInputAction final
{
public:
	const class UInputAction*                     PrimaryChordAction;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UInputMappingContext*>           Contexts;                                          // 0x0008(0x0010)(ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UInputAction*>                   PrimaryConflictActions;                            // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UInputAction*>                   SecondaryConflictActions;                          // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_InputFuncLib_GetConflictChordInputAction;

// Function GSInput.GSE_InputFuncLib.GetDebugEventAccumulatorThisTick
// 0x0018 (0x0018 - 0x0000)
struct GSE_InputFuncLib_GetDebugEventAccumulatorThisTick final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UInputAction*                     Action;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsReleasedEvent;                                   // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_InputFuncLib_GetDebugEventAccumulatorThisTick;

// Function GSInput.GSE_InputFuncLib.GetGamepadControllerName
// 0x0018 (0x0018 - 0x0000)
struct GSE_InputFuncLib_GetGamepadControllerName final
{
public:
	int32                                         ControllerId;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_InputFuncLib_GetGamepadControllerName;

// Function GSInput.GSE_InputFuncLib.GetGamepadDeadZoneThreshold
// 0x0004 (0x0004 - 0x0000)
struct GSE_InputFuncLib_GetGamepadDeadZoneThreshold final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_InputFuncLib_GetGamepadDeadZoneThreshold;

// Function GSInput.GSE_InputFuncLib.GetInputActionValue
// 0x0028 (0x0028 - 0x0000)
struct GSE_InputFuncLib_GetInputActionValue final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UInputAction*                     Action;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_InputFuncLib_GetInputActionValue;

// Function GSInput.GSE_InputFuncLib.GetInputDeviceTypes
// 0x0010 (0x0010 - 0x0000)
struct GSE_InputFuncLib_GetInputDeviceTypes final
{
public:
	TArray<EGSInputDeviceType>                    ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_InputFuncLib_GetInputDeviceTypes;

// Function GSInput.GSE_InputFuncLib.GetInputPreProc
// 0x0010 (0x0010 - 0x0000)
struct GSE_InputFuncLib_GetInputPreProc final
{
public:
	const class UObject*                          WorldContext;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGSInputPreProc*                        ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_InputFuncLib_GetInputPreProc;

// Function GSInput.GSE_InputFuncLib.GetInputSettingPreProc
// 0x0010 (0x0010 - 0x0000)
struct GSE_InputFuncLib_GetInputSettingPreProc final
{
public:
	const class UObject*                          WorldContext;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGSInputSettingPreProc*                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_InputFuncLib_GetInputSettingPreProc;

// Function GSInput.GSE_InputFuncLib.GetKeyByAnalogInputEvent
// 0x0048 (0x0048 - 0x0000)
struct GSE_InputFuncLib_GetKeyByAnalogInputEvent final
{
public:
	struct FAnalogInputEvent                      AnalogInputEvent;                                  // 0x0000(0x0040)(ConstParm, Parm, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_InputFuncLib_GetKeyByAnalogInputEvent;

// Function GSInput.GSE_InputFuncLib.GetKeyByKeyEvent
// 0x0040 (0x0040 - 0x0000)
struct GSE_InputFuncLib_GetKeyByKeyEvent final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0038)(ConstParm, Parm, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_InputFuncLib_GetKeyByKeyEvent;

// Function GSInput.GSE_InputFuncLib.GetKeyByPointerEvent
// 0x0098 (0x0098 - 0x0000)
struct GSE_InputFuncLib_GetKeyByPointerEvent final
{
public:
	struct FPointerEvent                          PointerEvent;                                      // 0x0000(0x0090)(ConstParm, Parm, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0090(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_InputFuncLib_GetKeyByPointerEvent;

// Function GSInput.GSE_InputFuncLib.GetLastInputType
// 0x0010 (0x0010 - 0x0000)
struct GSE_InputFuncLib_GetLastInputType final
{
public:
	const class UObject*                          WorldContext;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGSInputType                                  ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSE_InputFuncLib_GetLastInputType;

// Function GSInput.GSE_InputFuncLib.GetMappableKey
// 0x0058 (0x0058 - 0x0000)
struct GSE_InputFuncLib_GetMappableKey final
{
public:
	const class UInputMappingContext*             MappingContext;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, struct FKey>                ReturnValue;                                       // 0x0008(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_InputFuncLib_GetMappableKey;

// Function GSInput.GSE_InputFuncLib.GetMappingsInfo
// 0x0038 (0x0038 - 0x0000)
struct GSE_InputFuncLib_GetMappingsInfo final
{
public:
	const class UInputMappingContext*             MappingContext;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UInputAction*>                   Actions;                                           // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FKey>                           Keys;                                              // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UInputAction*>                   ChordActions;                                      // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_InputFuncLib_GetMappingsInfo;

// Function GSInput.GSE_InputFuncLib.GetProductStringList
// 0x0010 (0x0010 - 0x0000)
struct GSE_InputFuncLib_GetProductStringList final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_InputFuncLib_GetProductStringList;

// Function GSInput.GSE_InputFuncLib.IsAppActive
// 0x0001 (0x0001 - 0x0000)
struct GSE_InputFuncLib_IsAppActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_InputFuncLib_IsAppActive;

// Function GSInput.GSE_InputFuncLib.IsConsoleActive
// 0x0010 (0x0010 - 0x0000)
struct GSE_InputFuncLib_IsConsoleActive final
{
public:
	const class UObject*                          WorldContext;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSE_InputFuncLib_IsConsoleActive;

// Function GSInput.GSE_InputFuncLib.QueryKeysByInputAction
// 0x0020 (0x0020 - 0x0000)
struct GSE_InputFuncLib_QueryKeysByInputAction final
{
public:
	const class UInputMappingContext*             MappingContext;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UInputAction*                     Action;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FKey>                           ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_InputFuncLib_QueryKeysByInputAction;

// Function GSInput.GSE_InputFuncLib.QueryKeysMappedToAction
// 0x0020 (0x0020 - 0x0000)
struct GSE_InputFuncLib_QueryKeysMappedToAction final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UInputAction*                     Action;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FKey>                           ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_InputFuncLib_QueryKeysMappedToAction;

// Function GSInput.GSE_InputFuncLib.RegisterGSInputProc
// 0x0010 (0x0010 - 0x0000)
struct GSE_InputFuncLib_RegisterGSInputProc final
{
public:
	const class UObject*                          WorldContext;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGSInputProcOrder                             Order;                                             // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSE_InputFuncLib_RegisterGSInputProc;

// Function GSInput.GSE_InputFuncLib.RegisterInputTargetBinding
// 0x0008 (0x0008 - 0x0000)
struct GSE_InputFuncLib_RegisterInputTargetBinding final
{
public:
	class UGSInputTargetBinding*                  InputTargetBindingObj;                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_InputFuncLib_RegisterInputTargetBinding;

// Function GSInput.GSE_InputFuncLib.RemoveInputMappingContext
// 0x0018 (0x0018 - 0x0000)
struct GSE_InputFuncLib_RemoveInputMappingContext final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UInputMappingContext*             InputMappingContext;                               // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreAllPressedKeysUntilRelease;                 // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceImmediately;                                 // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSE_InputFuncLib_RemoveInputMappingContext;

// Function GSInput.GSE_InputFuncLib.RequestRebuildControlMappings
// 0x0010 (0x0010 - 0x0000)
struct GSE_InputFuncLib_RequestRebuildControlMappings final
{
public:
	const class APlayerController*                PlayerController;                                  // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceImmediately;                                 // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreAllPressedKeysUntilRelease;                 // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSE_InputFuncLib_RequestRebuildControlMappings;

// Function GSInput.GSE_InputFuncLib.SetCursorVisibility
// 0x0001 (0x0001 - 0x0000)
struct GSE_InputFuncLib_SetCursorVisibility final
{
public:
	bool                                          bDrawCursor;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_InputFuncLib_SetCursorVisibility;

// Function GSInput.GSE_InputFuncLib.SetGameOnly
// 0x0008 (0x0008 - 0x0000)
struct GSE_InputFuncLib_SetGameOnly final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_InputFuncLib_SetGameOnly;

// Function GSInput.GSE_InputFuncLib.SetIgnoreAllButtonKeyInput
// 0x0010 (0x0010 - 0x0000)
struct GSE_InputFuncLib_SetIgnoreAllButtonKeyInput final
{
public:
	const class UObject*                          WorldContext;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsIgnore;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSE_InputFuncLib_SetIgnoreAllButtonKeyInput;

// Function GSInput.GSE_InputFuncLib.SetMouseCursorPosition
// 0x0010 (0x0010 - 0x0000)
struct GSE_InputFuncLib_SetMouseCursorPosition final
{
public:
	struct FVector2D                              position;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_InputFuncLib_SetMouseCursorPosition;

// Function GSInput.GSE_InputFuncLib.SetUIOnly
// 0x0010 (0x0010 - 0x0000)
struct GSE_InputFuncLib_SetUIOnly final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNeedMouseCapture;                                 // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSE_InputFuncLib_SetUIOnly;

// Function GSInput.GSE_InputFuncLib.TryToSetContextNewPriority
// 0x0018 (0x0018 - 0x0000)
struct GSE_InputFuncLib_TryToSetContextNewPriority final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UInputMappingContext*             Context;                                           // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NewPriority;                                       // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSE_InputFuncLib_TryToSetContextNewPriority;

// Function GSInput.GSE_InputFuncLib.UnRegisterGSInputProc
// 0x0010 (0x0010 - 0x0000)
struct GSE_InputFuncLib_UnRegisterGSInputProc final
{
public:
	const class UObject*                          WorldContext;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGSInputProcOrder                             Order;                                             // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSE_InputFuncLib_UnRegisterGSInputProc;

// Function GSInput.GSE_InputFuncLib.UnRegisterInputTargetBinding
// 0x0008 (0x0008 - 0x0000)
struct GSE_InputFuncLib_UnRegisterInputTargetBinding final
{
public:
	class UGSInputTargetBinding*                  InputTargetBindingObj;                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_InputFuncLib_UnRegisterInputTargetBinding;

// Function GSInput.GSInputDisplayWidget.SetAxisValue
// 0x0020 (0x0020 - 0x0000)
struct GSInputDisplayWidget_SetAxisValue final
{
public:
	struct FKey                                   InKey;                                             // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InAxisValue;                                       // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSInputDisplayWidget_SetAxisValue;

// Function GSInput.GSInputDisplayWidget.SetIsPress
// 0x0001 (0x0001 - 0x0000)
struct GSInputDisplayWidget_SetIsPress final
{
public:
	bool                                          InIsPress;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSInputDisplayWidget_SetIsPress;

// Function GSInput.GSInputDisplayWidget.SetMousePos
// 0x0010 (0x0010 - 0x0000)
struct GSInputDisplayWidget_SetMousePos final
{
public:
	struct FVector2D                              InMousePos;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSInputDisplayWidget_SetMousePos;

// Function GSInput.GSInputActionIcon.BeginHold
// 0x0004 (0x0004 - 0x0000)
struct GSInputActionIcon_BeginHold final
{
public:
	float                                         InTotalTime;                                       // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSInputActionIcon_BeginHold;

// Function GSInput.GSInputActionIcon.OpenPercentBg
// 0x0001 (0x0001 - 0x0000)
struct GSInputActionIcon_OpenPercentBg final
{
public:
	bool                                          bOpen;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSInputActionIcon_OpenPercentBg;

// Function GSInput.GSInputActionIcon.SetInputAction
// 0x0008 (0x0008 - 0x0000)
struct GSInputActionIcon_SetInputAction final
{
public:
	class UInputAction*                           InputAction_0;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSInputActionIcon_SetInputAction;

// Function GSInput.GSInputActionIcon.SetPercent
// 0x0004 (0x0004 - 0x0000)
struct GSInputActionIcon_SetPercent final
{
public:
	float                                         InPercent;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSInputActionIcon_SetPercent;

// Function GSInput.GSInputDisplayUI.OnInputAxisChange
// 0x0020 (0x0020 - 0x0000)
struct GSInputDisplayUI_OnInputAxisChange final
{
public:
	struct FKey                                   InKey;                                             // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InAxisValue;                                       // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSInputDisplayUI_OnInputAxisChange;

// Function GSInput.GSInputDisplayUI.OnInputKeyDown
// 0x0018 (0x0018 - 0x0000)
struct GSInputDisplayUI_OnInputKeyDown final
{
public:
	struct FKey                                   InKey;                                             // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSInputDisplayUI_OnInputKeyDown;

// Function GSInput.GSInputDisplayUI.OnInputKeyUp
// 0x0018 (0x0018 - 0x0000)
struct GSInputDisplayUI_OnInputKeyUp final
{
public:
	struct FKey                                   InKey;                                             // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSInputDisplayUI_OnInputKeyUp;

// Function GSInput.GSInputDisplayUI.OnInputMouseButtonDoubleClick
// 0x0018 (0x0018 - 0x0000)
struct GSInputDisplayUI_OnInputMouseButtonDoubleClick final
{
public:
	struct FKey                                   InKey;                                             // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSInputDisplayUI_OnInputMouseButtonDoubleClick;

// Function GSInput.GSInputDisplayUI.OnInputMouseButtonDown
// 0x0018 (0x0018 - 0x0000)
struct GSInputDisplayUI_OnInputMouseButtonDown final
{
public:
	struct FKey                                   InKey;                                             // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSInputDisplayUI_OnInputMouseButtonDown;

// Function GSInput.GSInputDisplayUI.OnInputMouseButtonUp
// 0x0018 (0x0018 - 0x0000)
struct GSInputDisplayUI_OnInputMouseButtonUp final
{
public:
	struct FKey                                   InKey;                                             // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSInputDisplayUI_OnInputMouseButtonUp;

// Function GSInput.GSInputDisplayUI.OnInputMouseMove
// 0x0010 (0x0010 - 0x0000)
struct GSInputDisplayUI_OnInputMouseMove final
{
public:
	struct FVector2D                              InMousePos;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSInputDisplayUI_OnInputMouseMove;

// Function GSInput.GSInputDisplayUI.OnInputMouseWheelOrGesture
// 0x0004 (0x0004 - 0x0000)
struct GSInputDisplayUI_OnInputMouseWheelOrGesture final
{
public:
	float                                         InWheelDelta;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSInputDisplayUI_OnInputMouseWheelOrGesture;

// Function GSInput.GSInputDisplayUI.SetIsShow
// 0x0001 (0x0001 - 0x0000)
struct GSInputDisplayUI_SetIsShow final
{
public:
	bool                                          IsShow;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSInputDisplayUI_SetIsShow;

// Function GSInput.GSInputTargetBinding.ActionListener
// 0x0088 (0x0088 - 0x0000)
struct GSInputTargetBinding_ActionListener final
{
public:
	struct FInputActionInstance                   ActionInstance;                                    // 0x0000(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSInputTargetBinding_ActionListener;

// Function GSInput.GSInputTargetBinding.CanceledActionListener
// 0x0088 (0x0088 - 0x0000)
struct GSInputTargetBinding_CanceledActionListener final
{
public:
	struct FInputActionInstance                   ActionInstance;                                    // 0x0000(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSInputTargetBinding_CanceledActionListener;

// Function GSInput.GSInputTargetBinding.CompletedActionListener
// 0x0088 (0x0088 - 0x0000)
struct GSInputTargetBinding_CompletedActionListener final
{
public:
	struct FInputActionInstance                   ActionInstance;                                    // 0x0000(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSInputTargetBinding_CompletedActionListener;

// Function GSInput.GSInputTargetBinding.FetchDebugInfo
// 0x0020 (0x0020 - 0x0000)
struct GSInputTargetBinding_FetchDebugInfo final
{
public:
	TArray<class FString>                         DebugLines;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FColor>                         DebugColors;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSInputTargetBinding_FetchDebugInfo;

// Function GSInput.GSInputTargetBinding.GetRichTextInlineIconInfo
// 0x000C (0x000C - 0x0000)
struct GSInputTargetBinding_GetRichTextInlineIconInfo final
{
public:
	int32                                         BasePixelHeight;                                   // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BaselineOffset;                                    // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ConnectIconOffset;                                 // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSInputTargetBinding_GetRichTextInlineIconInfo;

// Function GSInput.GSInputTargetBinding.InputActionTrigger
// 0x0030 (0x0030 - 0x0000)
struct GSInputTargetBinding_InputActionTrigger final
{
public:
	class FString                                 ActionName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETriggerEvent                                 TriggerEvent;                                      // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputActionValueType                         InputActionValueType;                              // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                InputActionValue;                                  // 0x0018(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSInputTargetBinding_InputActionTrigger;

// Function GSInput.GSInputTargetBinding.IsInputDebuggerOpen
// 0x0001 (0x0001 - 0x0000)
struct GSInputTargetBinding_IsInputDebuggerOpen final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSInputTargetBinding_IsInputDebuggerOpen;

// Function GSInput.GSInputTargetBinding.OngoingActionListener
// 0x0088 (0x0088 - 0x0000)
struct GSInputTargetBinding_OngoingActionListener final
{
public:
	struct FInputActionInstance                   ActionInstance;                                    // 0x0000(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSInputTargetBinding_OngoingActionListener;

// Function GSInput.GSInputTargetBinding.PostApplicationActivationChanged
// 0x0001 (0x0001 - 0x0000)
struct GSInputTargetBinding_PostApplicationActivationChanged final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSInputTargetBinding_PostApplicationActivationChanged;

// Function GSInput.GSInputTargetBinding.PostConsoleActivationStateChanged
// 0x0001 (0x0001 - 0x0000)
struct GSInputTargetBinding_PostConsoleActivationStateChanged final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSInputTargetBinding_PostConsoleActivationStateChanged;

// Function GSInput.GSInputTargetBinding.StartedActionListener
// 0x0088 (0x0088 - 0x0000)
struct GSInputTargetBinding_StartedActionListener final
{
public:
	struct FInputActionInstance                   ActionInstance;                                    // 0x0000(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSInputTargetBinding_StartedActionListener;

// Function GSInput.GSInputTargetBinding.TriggeredActionListener
// 0x0088 (0x0088 - 0x0000)
struct GSInputTargetBinding_TriggeredActionListener final
{
public:
	struct FInputActionInstance                   ActionInstance;                                    // 0x0000(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSInputTargetBinding_TriggeredActionListener;

// Function GSInput.GSInputTargetBinding.TryGetInlineTexture
// 0x0038 (0x0038 - 0x0000)
struct GSInputTargetBinding_TryGetInlineTexture final
{
public:
	class FString                                 ActionTag;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGSInputRichTextMarkUpType                    MarkUpType;                                        // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             InlineTexture;                                     // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             InlineChordTexture;                                // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             ConnectTexture;                                    // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSInputTargetBinding_TryGetInlineTexture;

// Function GSInput.GSInputTargetBinding.TryGetTextureByAction
// 0x0040 (0x0040 - 0x0000)
struct GSInputTargetBinding_TryGetTextureByAction final
{
public:
	class UInputAction*                           InputAction;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Offset;                                            // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Texture;                                           // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BgType;                                            // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ChordOffset;                                       // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             ChordTexture;                                      // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             ConnectTexture;                                    // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             NoneTexture;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSInputTargetBinding_TryGetTextureByAction;

// Function GSInput.GSInputTargetBinding.TryGetTextureInfoByName
// 0x0020 (0x0020 - 0x0000)
struct GSInputTargetBinding_TryGetTextureInfoByName final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Offset;                                            // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BgType;                                            // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSInputTargetBinding_TryGetTextureInfoByName;

// Function GSInput.GSInputWidget.IsChildGSWidgetOf
// 0x0010 (0x0010 - 0x0000)
struct GSInputWidget_IsChildGSWidgetOf final
{
public:
	class UWidget*                                PossibleParent;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSInputWidget_IsChildGSWidgetOf;

// Function GSInput.GSInputWidget.OnFocusChanging
// 0x0008 (0x0008 - 0x0000)
struct GSInputWidget_OnFocusChanging final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSInputWidget_OnFocusChanging;

// Function GSInput.GSOverlay.AddChildToGSOverlay
// 0x0010 (0x0010 - 0x0000)
struct GSOverlay_AddChildToGSOverlay final
{
public:
	class UWidget*                                Content;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOverlaySlot*                           ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSOverlay_AddChildToGSOverlay;

// Function GSInput.GSOverlay.OnChildAddToGSOverlayCS
// 0x0008 (0x0008 - 0x0000)
struct GSOverlay_OnChildAddToGSOverlayCS final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSOverlay_OnChildAddToGSOverlayCS;

}

