#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GSInput

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "GSInput_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "EnhancedInput_structs.hpp"
#include "EnhancedInput_classes.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class GSInput.GSInputDisplaySetting
// 0x0018 (0x0040 - 0x0028)
class UGSInputDisplaySetting final : public UObject
{
public:
	bool                                          IsLock;                                            // 0x0028(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsShow;                                            // 0x0029(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurScaleRate;                                      // 0x002C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              CurPosition;                                       // 0x0030(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSInputDisplaySetting")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSInputDisplaySetting")
	}
	static class UGSInputDisplaySetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSInputDisplaySetting>();
	}
};
DUMPER7_ASSERTS_UGSInputDisplaySetting;

// Class GSInput.GSE_InputFuncLib
// 0x0000 (0x0028 - 0x0028)
class UGSE_InputFuncLib final : public UObject
{
public:
	static void AddInputMappingContext(class APlayerController* PlayerController, const class UInputMappingContext* InputMappingContext, int32 Priority, bool bIgnoreAllPressedKeysUntilRelease, bool bForceImmediately);
	static void AddPlayerMappedKey(class APlayerController* PlayerController, const class FName MappingName, const struct FKey& NewKey, const struct FModifyContextOptions& Options);
	static void BindAction(class UGSInputComponent* InputComponent, const class UInputAction* InputAction, ETriggerEvent TriggerEvent);
	static void ClearAllInputMappingContext(class APlayerController* PlayerController);
	static void CustomizeInputMappingContext(class UInputMappingContext* MappingContext, class FName MappableName, class FName KeyName);
	static struct FKey FindKeyByName(class FName KeyName);
	static void FlushPressedInput(class APlayerController* PlayerController);
	static TArray<class FString> GetActionNamesFromInputMappingContext(class UInputMappingContext* InputMappingContext);
	static TArray<class UInputAction*> GetChordInputAction(const class UInputMappingContext* InputMappingContext);
	static void GetConflictChordInputAction(const class UInputAction* PrimaryChordAction, const TArray<class UInputMappingContext*>& Contexts, TArray<class UInputAction*>* PrimaryConflictActions, TArray<class UInputAction*>* SecondaryConflictActions);
	static int32 GetDebugEventAccumulatorThisTick(class APlayerController* PlayerController, const class UInputAction* Action, bool IsReleasedEvent);
	static class FString GetGamepadControllerName(int32 ControllerId);
	static float GetGamepadDeadZoneThreshold();
	static struct FVector GetInputActionValue(class APlayerController* PlayerController, const class UInputAction* Action);
	static TArray<EGSInputDeviceType> GetInputDeviceTypes();
	static class UGSInputPreProc* GetInputPreProc(const class UObject* WorldContext);
	static class UGSInputSettingPreProc* GetInputSettingPreProc(const class UObject* WorldContext);
	static class FName GetKeyByAnalogInputEvent(const struct FAnalogInputEvent& AnalogInputEvent);
	static class FName GetKeyByKeyEvent(const struct FKeyEvent& KeyEvent);
	static class FName GetKeyByPointerEvent(const struct FPointerEvent& PointerEvent);
	static EGSInputType GetLastInputType(const class UObject* WorldContext);
	static TMap<class FName, struct FKey> GetMappableKey(const class UInputMappingContext* MappingContext);
	static void GetMappingsInfo(const class UInputMappingContext* MappingContext, TArray<class UInputAction*>* Actions, TArray<struct FKey>* Keys, TArray<class UInputAction*>* ChordActions);
	static TArray<class FString> GetProductStringList();
	static bool IsAppActive();
	static bool IsConsoleActive(const class UObject* WorldContext);
	static TArray<struct FKey> QueryKeysByInputAction(const class UInputMappingContext* MappingContext, const class UInputAction* Action);
	static TArray<struct FKey> QueryKeysMappedToAction(class APlayerController* PlayerController, const class UInputAction* Action);
	static void RegisterGSInputProc(const class UObject* WorldContext, EGSInputProcOrder Order);
	static void RegisterInputTargetBinding(class UGSInputTargetBinding* InputTargetBindingObj);
	static void RemoveInputMappingContext(class APlayerController* PlayerController, const class UInputMappingContext* InputMappingContext, bool bIgnoreAllPressedKeysUntilRelease, bool bForceImmediately);
	static void RequestRebuildControlMappings(const class APlayerController* PlayerController, bool bForceImmediately, bool bIgnoreAllPressedKeysUntilRelease);
	static void SetCursorVisibility(bool bDrawCursor);
	static void SetGameOnly(class APlayerController* PlayerController);
	static void SetIgnoreAllButtonKeyInput(const class UObject* WorldContext, bool IsIgnore);
	static void SetMouseCursorPosition(const struct FVector2D& position);
	static void SetUIOnly(class APlayerController* PlayerController, bool bNeedMouseCapture);
	static bool TryToSetContextNewPriority(class APlayerController* PlayerController, const class UInputMappingContext* Context, int32 NewPriority);
	static void UnRegisterGSInputProc(const class UObject* WorldContext, EGSInputProcOrder Order);
	static void UnRegisterInputTargetBinding(class UGSInputTargetBinding* InputTargetBindingObj);
	static void UpdateAllInputIcon();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSE_InputFuncLib")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSE_InputFuncLib")
	}
	static class UGSE_InputFuncLib* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSE_InputFuncLib>();
	}
};
DUMPER7_ASSERTS_UGSE_InputFuncLib;

// Class GSInput.GSInputDisplayWidget
// 0x00E8 (0x0380 - 0x0298)
class UGSInputDisplayWidget final : public UUserWidget
{
public:
	EInputDisplayType                             InputDisplayType;                                  // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   BindButtonKey;                                     // 0x02A0(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKey                                   BindXKey;                                          // 0x02B8(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKey                                   BindYKey;                                          // 0x02D0(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ShowText_1;                                        // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ShowText_2;                                        // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         JoystickMoveLength;                                // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30C[0x74];                                     // 0x030C(0x0074)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetAxisValue(const struct FKey& InKey, float InAxisValue);
	void SetIsPress(bool InIsPress);
	void SetMousePos(const struct FVector2D& InMousePos);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSInputDisplayWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSInputDisplayWidget")
	}
	static class UGSInputDisplayWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSInputDisplayWidget>();
	}
};
DUMPER7_ASSERTS_UGSInputDisplayWidget;

// Class GSInput.GSInputActionIcon
// 0x0120 (0x03B0 - 0x0290)
class UGSInputActionIcon final : public UImage
{
public:
	uint8                                         Pad_290[0x8];                                      // 0x0290(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SpeedRatioOnStopHold;                              // 0x0298(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             InputIconTexture;                                  // 0x02A0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<EGSInputActionIconSupportedPlatform, class UTexture2D*> PlatformInputIconTextures;          // 0x02A8(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class UInputAction*                           InputAction;                                       // 0x02F8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UInputAction*>                   ExtraInputActions;                                 // 0x0300(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	EGSInputIconShowType                          IconShowType;                                      // 0x0310(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShouldApplyOffset;                                // 0x0311(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_312[0x2];                                      // 0x0312(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         IconScale;                                         // 0x0314(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EGSComboOnlyShowOneType                       ComboIconOnlyShowOneType;                          // 0x0318(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_319[0x97];                                     // 0x0319(0x0097)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BeginHold(const float InTotalTime);
	void OpenPercentBg(bool bOpen);
	void Reset();
	void SetInputAction(class UInputAction* InputAction_0);
	void SetPercent(const float InPercent);
	void StopHold();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSInputActionIcon")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSInputActionIcon")
	}
	static class UGSInputActionIcon* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSInputActionIcon>();
	}
};
DUMPER7_ASSERTS_UGSInputActionIcon;

// Class GSInput.GSInputGameViewportClient
// 0x0000 (0x03A0 - 0x03A0)
class UGSInputGameViewportClient final : public UGameViewportClient
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSInputGameViewportClient")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSInputGameViewportClient")
	}
	static class UGSInputGameViewportClient* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSInputGameViewportClient>();
	}
};
DUMPER7_ASSERTS_UGSInputGameViewportClient;

// Class GSInput.GSInputComponent
// 0x0000 (0x0178 - 0x0178)
class UGSInputComponent final : public UEnhancedInputComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSInputComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSInputComponent")
	}
	static class UGSInputComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSInputComponent>();
	}
};
DUMPER7_ASSERTS_UGSInputComponent;

// Class GSInput.GSInputDisplayPreProc
// 0x0080 (0x00A8 - 0x0028)
class UGSInputDisplayPreProc final : public UObject
{
public:
	TMulticastInlineDelegate<void(const struct FKey& InKey)> OnInputKeyDownDelegate;                 // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FKey& InKey)> OnInputKeyUpDelegate;                   // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FKey& InKey, float InAxisValue)> OnInputAxisChangeDelegate; // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FVector2D& InMousePos)> OnInputMouseMoveDelegate;     // 0x0058(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FKey& InKey)> OnInputMouseButtonDownDelegate;         // 0x0068(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FKey& InKey)> OnInputMouseButtonUpDelegate;           // 0x0078(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FKey& InKey)> OnInputMouseButtonDoubleClickDelegate;  // 0x0088(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(float InWheelDelta)> OnInputMouseWheelOrGestureDelegate;           // 0x0098(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSInputDisplayPreProc")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSInputDisplayPreProc")
	}
	static class UGSInputDisplayPreProc* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSInputDisplayPreProc>();
	}
};
DUMPER7_ASSERTS_UGSInputDisplayPreProc;

// Class GSInput.GSInputDisplayUI
// 0x0148 (0x03E0 - 0x0298)
class UGSInputDisplayUI final : public UUserWidget
{
public:
	bool                                          IsCanSetting;                                      // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              NormalSize;                                        // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ChangeScaleSpeed;                                  // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxScaleRate;                                      // 0x02B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinScaleRate;                                      // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanel*                           PosCon;                                            // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCanvasPanel*                           GamepadCon;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCanvasPanel*                           KeyboardCon;                                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D8[0x108];                                    // 0x02D8(0x0108)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnInputAxisChange(const struct FKey& InKey, float InAxisValue);
	void OnInputKeyDown(const struct FKey& InKey);
	void OnInputKeyUp(const struct FKey& InKey);
	void OnInputMouseButtonDoubleClick(const struct FKey& InKey);
	void OnInputMouseButtonDown(const struct FKey& InKey);
	void OnInputMouseButtonUp(const struct FKey& InKey);
	void OnInputMouseMove(const struct FVector2D& InMousePos);
	void OnInputMouseWheelOrGesture(float InWheelDelta);
	void ResetSetting();
	void SetIsShow(bool IsShow);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSInputDisplayUI")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSInputDisplayUI")
	}
	static class UGSInputDisplayUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSInputDisplayUI>();
	}
};
DUMPER7_ASSERTS_UGSInputDisplayUI;

// Class GSInput.GSInputModifierForceSetValue
// 0x0020 (0x0048 - 0x0028)
class UGSInputModifierForceSetValue final : public UInputModifier
{
public:
	EInputActionValueType                         Type;                                              // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Value;                                             // 0x0030(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSInputModifierForceSetValue")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSInputModifierForceSetValue")
	}
	static class UGSInputModifierForceSetValue* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSInputModifierForceSetValue>();
	}
};
DUMPER7_ASSERTS_UGSInputModifierForceSetValue;

// Class GSInput.GSInputPreProc
// 0x00B0 (0x00D8 - 0x0028)
class UGSInputPreProc final : public UObject
{
public:
	TMulticastInlineDelegate<void(EGSInputType InputType)> OnInputTrigger;                           // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(EGSInputType InputType)> OnInputTypeChangeTrigger;                 // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FKeyEvent& InKeyEvent)> OnKeyDownEvent;               // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FKeyEvent& InKeyEvent)> OnKeyUpEvent;                 // 0x0058(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FAnalogInputEvent& InAnalogInputEvent)> OnAnalogInputEvent; // 0x0068(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FPointerEvent& InMouseEvent)> OnMouseMoveEvent;       // 0x0078(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FPointerEvent& InMouseEvent)> OnMouseButtonDownEvent; // 0x0088(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FPointerEvent& InMouseEvent)> OnMouseButtonUpEvent;   // 0x0098(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FPointerEvent& InMouseEvent)> OnMouseButtonDoubleClickEvent; // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FPointerEvent& InWheelEvent)> OnMouseWheelEvent;      // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FKey& Key)> OnAnyKeyTriggerEvent;                     // 0x00C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSInputPreProc")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSInputPreProc")
	}
	static class UGSInputPreProc* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSInputPreProc>();
	}
};
DUMPER7_ASSERTS_UGSInputPreProc;

// Class GSInput.GSInputSettingPreProc
// 0x0040 (0x0068 - 0x0028)
class UGSInputSettingPreProc final : public UObject
{
public:
	TMulticastInlineDelegate<void(const struct FKeyEvent& InKeyEvent)> OnKeyDownEvent;               // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FKeyEvent& InKeyEvent)> OnKeyUpEvent;                 // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FPointerEvent& InMouseEvent)> OnMouseButtonDownEvent; // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FPointerEvent& InMouseEvent)> OnMouseButtonUpEvent;   // 0x0058(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSInputSettingPreProc")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSInputSettingPreProc")
	}
	static class UGSInputSettingPreProc* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSInputSettingPreProc>();
	}
};
DUMPER7_ASSERTS_UGSInputSettingPreProc;

// Class GSInput.GSInputRichTextBlock
// 0x0000 (0x08C0 - 0x08C0)
class UGSInputRichTextBlock final : public URichTextBlock
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSInputRichTextBlock")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSInputRichTextBlock")
	}
	static class UGSInputRichTextBlock* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSInputRichTextBlock>();
	}
};
DUMPER7_ASSERTS_UGSInputRichTextBlock;

// Class GSInput.GSInputSettings
// 0x0008 (0x0038 - 0x0030)
class UGSInputSettings final : public UDataAsset
{
public:
	float                                         KeyboardMouseDeadZoneThreshold;                    // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GamepadDeadZoneThreshold;                          // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSInputSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSInputSettings")
	}
	static class UGSInputSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSInputSettings>();
	}
};
DUMPER7_ASSERTS_UGSInputSettings;

// Class GSInput.GSInputTargetBinding
// 0x0000 (0x0028 - 0x0028)
class UGSInputTargetBinding : public UObject
{
public:
	void ActionListener(const struct FInputActionInstance& ActionInstance);
	void CanceledActionListener(const struct FInputActionInstance& ActionInstance);
	void CompletedActionListener(const struct FInputActionInstance& ActionInstance);
	void FetchDebugInfo(TArray<class FString>* DebugLines, TArray<struct FColor>* DebugColors);
	void GetRichTextInlineIconInfo(int32* BasePixelHeight, int32* BaselineOffset, int32* ConnectIconOffset);
	void InputActionTrigger(const class FString& ActionName, ETriggerEvent TriggerEvent, EInputActionValueType InputActionValueType, const struct FVector& InputActionValue);
	bool IsInputDebuggerOpen();
	void OngoingActionListener(const struct FInputActionInstance& ActionInstance);
	void PostApplicationActivationChanged(bool IsActive);
	void PostConsoleActivationStateChanged(bool IsActive);
	void StartedActionListener(const struct FInputActionInstance& ActionInstance);
	void TriggeredActionListener(const struct FInputActionInstance& ActionInstance);
	bool TryGetInlineTexture(const class FString& ActionTag, const EGSInputRichTextMarkUpType MarkUpType, class UTexture2D** InlineTexture, class UTexture2D** InlineChordTexture, class UTexture2D** ConnectTexture);
	bool TryGetTextureByAction(class UInputAction* InputAction, float* Offset, class UTexture2D** Texture, int32* BgType, float* ChordOffset, class UTexture2D** ChordTexture, class UTexture2D** ConnectTexture, class UTexture2D** NoneTexture);
	bool TryGetTextureInfoByName(const class FString& Name_0, float* Offset, int32* BgType);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSInputTargetBinding")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSInputTargetBinding")
	}
	static class UGSInputTargetBinding* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSInputTargetBinding>();
	}
};
DUMPER7_ASSERTS_UGSInputTargetBinding;

// Class GSInput.GSInputTriggerHold
// 0x0008 (0x0060 - 0x0058)
class UGSInputTriggerHold final : public UInputTriggerTimedBase
{
public:
	float                                         HoldTimeThreshold;                                 // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSInputTriggerHold")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSInputTriggerHold")
	}
	static class UGSInputTriggerHold* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSInputTriggerHold>();
	}
};
DUMPER7_ASSERTS_UGSInputTriggerHold;

// Class GSInput.GSInputTriggerChordHold
// 0x0008 (0x0058 - 0x0050)
class UGSInputTriggerChordHold final : public UInputTrigger
{
public:
	uint8                                         Pad_50[0x4];                                       // 0x0050(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HoldTimeThreshold;                                 // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSInputTriggerChordHold")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSInputTriggerChordHold")
	}
	static class UGSInputTriggerChordHold* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSInputTriggerChordHold>();
	}
};
DUMPER7_ASSERTS_UGSInputTriggerChordHold;

// Class GSInput.GSInputTriggerRepeatPressed
// 0x0018 (0x0068 - 0x0050)
class UGSInputTriggerRepeatPressed final : public UInputTrigger
{
public:
	uint8                                         Pad_50[0x10];                                      // 0x0050(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         interval;                                          // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RepeatedPressedTriggerCount;                       // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSInputTriggerRepeatPressed")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSInputTriggerRepeatPressed")
	}
	static class UGSInputTriggerRepeatPressed* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSInputTriggerRepeatPressed>();
	}
};
DUMPER7_ASSERTS_UGSInputTriggerRepeatPressed;

// Class GSInput.GSInputTriggerWiggle
// 0x0068 (0x00C0 - 0x0058)
class UGSInputTriggerWiggle final : public UInputTriggerTimedBase
{
public:
	int32                                         AreaCount;                                         // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IntervalAreaDistance;                              // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InnerRadius;                                       // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EffectiveCrossDuration;                            // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x58];                                      // 0x0068(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSInputTriggerWiggle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSInputTriggerWiggle")
	}
	static class UGSInputTriggerWiggle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSInputTriggerWiggle>();
	}
};
DUMPER7_ASSERTS_UGSInputTriggerWiggle;

// Class GSInput.GSInputTriggerChordAction
// 0x0018 (0x0068 - 0x0050)
class UGSInputTriggerChordAction final : public UInputTrigger
{
public:
	class UInputAction*                           ChordAction;                                       // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsConsiderHoldTime;                                // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HoldTimeThreshold;                                 // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_60[0x8];                                       // 0x0060(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSInputTriggerChordAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSInputTriggerChordAction")
	}
	static class UGSInputTriggerChordAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSInputTriggerChordAction>();
	}
};
DUMPER7_ASSERTS_UGSInputTriggerChordAction;

// Class GSInput.GSInputWidget
// 0x0000 (0x0298 - 0x0298)
class UGSInputWidget : public UUserWidget
{
public:
	bool IsChildGSWidgetOf(class UWidget* PossibleParent);
	void OnFocusChanging(const struct FFocusEvent& InFocusEvent);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSInputWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSInputWidget")
	}
	static class UGSInputWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSInputWidget>();
	}
};
DUMPER7_ASSERTS_UGSInputWidget;

// Class GSInput.GSNavigationInputAction
// 0x0010 (0x0068 - 0x0058)
class UGSNavigationInputAction final : public UInputAction
{
public:
	TArray<EUINavigation>                         FirstTriggerNavigations;                           // 0x0058(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSNavigationInputAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSNavigationInputAction")
	}
	static class UGSNavigationInputAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSNavigationInputAction>();
	}
};
DUMPER7_ASSERTS_UGSNavigationInputAction;

// Class GSInput.GSOverlay
// 0x0000 (0x0158 - 0x0158)
class UGSOverlay : public UOverlay
{
public:
	class UOverlaySlot* AddChildToGSOverlay(class UWidget* Content);
	void OnChildAddToGSOverlayCS(class UWidget* Widget);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSOverlay")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSOverlay")
	}
	static class UGSOverlay* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSOverlay>();
	}
};
DUMPER7_ASSERTS_UGSOverlay;

// Class GSInput.GSPlayerInput
// 0x0100 (0x07F0 - 0x06F0)
class UGSPlayerInput final : public UEnhancedPlayerInput
{
public:
	uint8                                         Pad_6F0[0x100];                                    // 0x06F0(0x0100)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSPlayerInput")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSPlayerInput")
	}
	static class UGSPlayerInput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSPlayerInput>();
	}
};
DUMPER7_ASSERTS_UGSPlayerInput;

}

