#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GSNiagara

#include "Basic.hpp"

#include "GSNiagara_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GSNiagara.GSNiagaraBatchingSpriteConfigDA.InitGSParticlesConfigInfo
// 0x0002 (0x0002 - 0x0000)
struct GSNiagaraBatchingSpriteConfigDA_InitGSParticlesConfigInfo final
{
public:
	bool                                          bForceSet;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSNiagaraBatchingSpriteConfigDA_InitGSParticlesConfigInfo;

// Function GSNiagara.GSNiagaraArrayData.AddParticle
// 0x0058 (0x0058 - 0x0000)
struct GSNiagaraArrayData_AddParticle final
{
public:
	struct FGSNiagaraParticleInfo                 Info;                                              // 0x0000(0x0050)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSNiagaraArrayData_AddParticle;

// Function GSNiagara.GSNiagaraArrayData.ForceSetParticlePos
// 0x0010 (0x0010 - 0x0000)
struct GSNiagaraArrayData_ForceSetParticlePos final
{
public:
	TArray<struct FVector>                        TargetPosArray;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSNiagaraArrayData_ForceSetParticlePos;

// Function GSNiagara.GSNiagaraArrayData.ForceSetParticleSize
// 0x0010 (0x0010 - 0x0000)
struct GSNiagaraArrayData_ForceSetParticleSize final
{
public:
	TArray<float>                                 TargetSizeArray;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSNiagaraArrayData_ForceSetParticleSize;

// Function GSNiagara.GSNiagaraArrayData.RemoveParticle
// 0x0058 (0x0058 - 0x0000)
struct GSNiagaraArrayData_RemoveParticle final
{
public:
	struct FGSNiagaraParticleInfo                 Info;                                              // 0x0000(0x0050)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSNiagaraArrayData_RemoveParticle;

// Function GSNiagara.GSNiagaraArrayData.UpdateParticle
// 0x0010 (0x0010 - 0x0000)
struct GSNiagaraArrayData_UpdateParticle final
{
public:
	TArray<struct FGSNiagaraParticleInfo>         InParticleInfoArray;                               // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSNiagaraArrayData_UpdateParticle;

}

