#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GSNiagara

#include "Basic.hpp"

#include "Niagara_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "GSNiagara_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class GSNiagara.GSNiagaraBatchingSpriteConfig
// 0x0008 (0x0040 - 0x0038)
class UGSNiagaraBatchingSpriteConfig final : public UNiagaraDataInterface
{
public:
	class UGSNiagaraBatchingSpriteConfigDA*       ConfigInfo;                                        // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSNiagaraBatchingSpriteConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSNiagaraBatchingSpriteConfig")
	}
	static class UGSNiagaraBatchingSpriteConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSNiagaraBatchingSpriteConfig>();
	}
};
DUMPER7_ASSERTS_UGSNiagaraBatchingSpriteConfig;

// Class GSNiagara.GSNiagaraBatchingSpriteConfigDA
// 0x0060 (0x0090 - 0x0030)
class UGSNiagaraBatchingSpriteConfigDA final : public UPrimaryDataAsset
{
public:
	class FString                                 AtlasConfigFilePath;                               // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              AltasTextureSize;                                  // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGSNiagaraParticleInfoConfig>   ParticleInfoConfigArray;                           // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGSNiagaraParticleSpriteMapping> ParticleSpriteMappingConfig;                      // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_70[0x20];                                      // 0x0070(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClearPaticleConfigData();
	bool InitGSParticlesConfigInfo(bool bForceSet);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSNiagaraBatchingSpriteConfigDA")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSNiagaraBatchingSpriteConfigDA")
	}
	static class UGSNiagaraBatchingSpriteConfigDA* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSNiagaraBatchingSpriteConfigDA>();
	}
};
DUMPER7_ASSERTS_UGSNiagaraBatchingSpriteConfigDA;

// Class GSNiagara.GSNiagaraArrayData
// 0x0038 (0x0068 - 0x0030)
class UGSNiagaraArrayData final : public UPrimaryDataAsset
{
public:
	TArray<struct FGSNiagaraParticleInfo>         ParticleInfoArray;                                 // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x28];                                      // 0x0040(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool AddParticle(const struct FGSNiagaraParticleInfo& Info);
	void ClearParticleArrayData();
	void ForceSetParticlePos(const TArray<struct FVector>& TargetPosArray);
	void ForceSetParticleSize(const TArray<float>& TargetSizeArray);
	bool RemoveParticle(const struct FGSNiagaraParticleInfo& Info);
	void UpdateParticle(const TArray<struct FGSNiagaraParticleInfo>& InParticleInfoArray);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSNiagaraArrayData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSNiagaraArrayData")
	}
	static class UGSNiagaraArrayData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSNiagaraArrayData>();
	}
};
DUMPER7_ASSERTS_UGSNiagaraArrayData;

// Class GSNiagara.GSNiagaraParticleArrayData
// 0x0008 (0x0040 - 0x0038)
class UGSNiagaraParticleArrayData final : public UNiagaraDataInterface
{
public:
	class UGSNiagaraArrayData*                    ArrayData;                                         // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSNiagaraParticleArrayData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSNiagaraParticleArrayData")
	}
	static class UGSNiagaraParticleArrayData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSNiagaraParticleArrayData>();
	}
};
DUMPER7_ASSERTS_UGSNiagaraParticleArrayData;

// Class GSNiagara.GSNiagaraRVTSampler
// 0x0008 (0x0040 - 0x0038)
class UGSNiagaraRVTSampler final : public UNiagaraDataInterface
{
public:
	class URuntimeVirtualTexture*                 VirtualTexture;                                    // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSNiagaraRVTSampler")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSNiagaraRVTSampler")
	}
	static class UGSNiagaraRVTSampler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSNiagaraRVTSampler>();
	}
};
DUMPER7_ASSERTS_UGSNiagaraRVTSampler;

// Class GSNiagara.VATAnimClipsNiagaraData
// 0x0028 (0x0058 - 0x0030)
class UVATAnimClipsNiagaraData final : public UPrimaryDataAsset
{
public:
	struct FVector2D                              GlobalInputDirection;                              // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GlobalInputIntensity;                              // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector2D>                      CachedDirs;                                        // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("VATAnimClipsNiagaraData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VATAnimClipsNiagaraData")
	}
	static class UVATAnimClipsNiagaraData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVATAnimClipsNiagaraData>();
	}
};
DUMPER7_ASSERTS_UVATAnimClipsNiagaraData;

// Class GSNiagara.GSNiagaraVATAnimMachine
// 0x0008 (0x0040 - 0x0038)
class UGSNiagaraVATAnimMachine final : public UNiagaraDataInterface
{
public:
	class UVATAnimClipsNiagaraData*               VATNiagaraDataContainer;                           // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSNiagaraVATAnimMachine")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSNiagaraVATAnimMachine")
	}
	static class UGSNiagaraVATAnimMachine* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSNiagaraVATAnimMachine>();
	}
};
DUMPER7_ASSERTS_UGSNiagaraVATAnimMachine;

}

