#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GSReplaySystem

#include "Basic.hpp"


namespace SDK::Params
{

// Function GSReplaySystem.GSReplayCSharpFuncLib.GSNetworkRemapPath
// 0x0018 (0x0018 - 0x0000)
struct GSReplayCSharpFuncLib_GSNetworkRemapPath final
{
public:
	const class UObject*                          Outer_0;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name_0;                                            // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSReplayCSharpFuncLib_GSNetworkRemapPath;

// Function GSReplaySystem.GSReplayCSharpFuncLib.GSNetworkRemapPathCS
// 0x0028 (0x0028 - 0x0000)
struct GSReplayCSharpFuncLib_GSNetworkRemapPathCS final
{
public:
	const class UObject*                          Outer_0;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OriginName;                                        // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name_0;                                            // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSReplayCSharpFuncLib_GSNetworkRemapPathCS;

// Function GSReplaySystem.GSReplayCSharpFuncLib.OnPreScrub
// 0x0008 (0x0008 - 0x0000)
struct GSReplayCSharpFuncLib_OnPreScrub final
{
public:
	class UWorld*                                 World;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSReplayCSharpFuncLib_OnPreScrub;

// Function GSReplaySystem.GSReplayCSharpFuncLib.OnProcessGameSpecificDemoHeader
// 0x0020 (0x0020 - 0x0000)
struct GSReplayCSharpFuncLib_OnProcessGameSpecificDemoHeader final
{
public:
	TArray<class FString>                         GameSpecificData;                                  // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 Error;                                             // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSReplayCSharpFuncLib_OnProcessGameSpecificDemoHeader;

// Function GSReplaySystem.GSReplayCSharpFuncLib.OnReplayScrubComplete
// 0x0008 (0x0008 - 0x0000)
struct GSReplayCSharpFuncLib_OnReplayScrubComplete final
{
public:
	class UWorld*                                 World;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSReplayCSharpFuncLib_OnReplayScrubComplete;

// Function GSReplaySystem.GSReplayCSharpFuncLib.OnReplaySeverConnectionInit
// 0x0010 (0x0010 - 0x0000)
struct GSReplayCSharpFuncLib_OnReplaySeverConnectionInit final
{
public:
	class UWorld*                                 World;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNetConnection*                         SeverConnection;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSReplayCSharpFuncLib_OnReplaySeverConnectionInit;

// Function GSReplaySystem.GSReplayCSharpFuncLib.OnReplayStarted
// 0x0008 (0x0008 - 0x0000)
struct GSReplayCSharpFuncLib_OnReplayStarted final
{
public:
	class UWorld*                                 World;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSReplayCSharpFuncLib_OnReplayStarted;

// Function GSReplaySystem.GSReplayCSharpFuncLib.OnWriteGameSpecificDemoHeader
// 0x0010 (0x0010 - 0x0000)
struct GSReplayCSharpFuncLib_OnWriteGameSpecificDemoHeader final
{
public:
	TArray<class FString>                         GameSpecificData;                                  // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSReplayCSharpFuncLib_OnWriteGameSpecificDemoHeader;

// Function GSReplaySystem.GSReplayCSharpFuncLib.ProcessGameSpecificDemoHeaderCS
// 0x0020 (0x0020 - 0x0000)
struct GSReplayCSharpFuncLib_ProcessGameSpecificDemoHeaderCS final
{
public:
	class FString                                 GameSpecificData;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Error;                                             // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSReplayCSharpFuncLib_ProcessGameSpecificDemoHeaderCS;

// Function GSReplaySystem.GSReplayCSharpFuncLib.SetDemoCurrentTime
// 0x0004 (0x0004 - 0x0000)
struct GSReplayCSharpFuncLib_SetDemoCurrentTime final
{
public:
	float                                         InTimeToSet;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSReplayCSharpFuncLib_SetDemoCurrentTime;

// Function GSReplaySystem.GSReplayCSharpFuncLib.SetViewTargetPlayer
// 0x0008 (0x0008 - 0x0000)
struct GSReplayCSharpFuncLib_SetViewTargetPlayer final
{
public:
	int32                                         PlayerId;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSReplayCSharpFuncLib_SetViewTargetPlayer;

// Function GSReplaySystem.GSReplayCSharpFuncLib.WriteGameSpecificDemoHeaderCS
// 0x0010 (0x0010 - 0x0000)
struct GSReplayCSharpFuncLib_WriteGameSpecificDemoHeaderCS final
{
public:
	TArray<class FString>                         GameSpecificData;                                  // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSReplayCSharpFuncLib_WriteGameSpecificDemoHeaderCS;

// Function GSReplaySystem.GSReplayFuncLib.GetDemoCurrentTime
// 0x0010 (0x0010 - 0x0000)
struct GSReplayFuncLib_GetDemoCurrentTime final
{
public:
	const class UObject*                          WorldContext;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSReplayFuncLib_GetDemoCurrentTime;

// Function GSReplaySystem.GSReplayFuncLib.GetDemoPlayTimeDilation
// 0x0010 (0x0010 - 0x0000)
struct GSReplayFuncLib_GetDemoPlayTimeDilation final
{
public:
	const class UObject*                          WorldContext;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSReplayFuncLib_GetDemoPlayTimeDilation;

// Function GSReplaySystem.GSReplayFuncLib.GetDemoTotalTime
// 0x0010 (0x0010 - 0x0000)
struct GSReplayFuncLib_GetDemoTotalTime final
{
public:
	const class UObject*                          WorldContext;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSReplayFuncLib_GetDemoTotalTime;

// Function GSReplaySystem.GSReplayFuncLib.GetLastCheckpointTime
// 0x0010 (0x0010 - 0x0000)
struct GSReplayFuncLib_GetLastCheckpointTime final
{
public:
	const class UObject*                          WorldContext;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSReplayFuncLib_GetLastCheckpointTime;

// Function GSReplaySystem.GSReplayFuncLib.IsLoadingCheckpoint
// 0x0010 (0x0010 - 0x0000)
struct GSReplayFuncLib_IsLoadingCheckpoint final
{
public:
	const class UObject*                          WorldContext;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSReplayFuncLib_IsLoadingCheckpoint;

// Function GSReplaySystem.GSReplayFuncLib.IsPlayingReplay
// 0x0010 (0x0010 - 0x0000)
struct GSReplayFuncLib_IsPlayingReplay final
{
public:
	const class UObject*                          WorldContext;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSReplayFuncLib_IsPlayingReplay;

// Function GSReplaySystem.GSReplayFuncLib.IsRecordingReplay
// 0x0010 (0x0010 - 0x0000)
struct GSReplayFuncLib_IsRecordingReplay final
{
public:
	const class UObject*                          WorldContext;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSReplayFuncLib_IsRecordingReplay;

// Function GSReplaySystem.GSReplayFuncLib.IsReplayPause
// 0x0010 (0x0010 - 0x0000)
struct GSReplayFuncLib_IsReplayPause final
{
public:
	const class UObject*                          WorldContext;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSReplayFuncLib_IsReplayPause;

// Function GSReplaySystem.GSReplayFuncLib.PauseReplay
// 0x0010 (0x0010 - 0x0000)
struct GSReplayFuncLib_PauseReplay final
{
public:
	const class UObject*                          WorldContext;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPause;                                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSReplayFuncLib_PauseReplay;

// Function GSReplaySystem.GSReplayFuncLib.PlayReplayFromLocalFile
// 0x0028 (0x0028 - 0x0000)
struct GSReplayFuncLib_PlayReplayFromLocalFile final
{
public:
	const class UObject*                          WorldContext;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name_0;                                            // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         InOptions;                                         // 0x0018(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSReplayFuncLib_PlayReplayFromLocalFile;

// Function GSReplaySystem.GSReplayFuncLib.RecordReplayToLocalFile
// 0x0038 (0x0038 - 0x0000)
struct GSReplayFuncLib_RecordReplayToLocalFile final
{
public:
	const class UObject*                          WorldContext;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name_0;                                            // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FriendlyName;                                      // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         InOptions;                                         // 0x0028(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSReplayFuncLib_RecordReplayToLocalFile;

// Function GSReplaySystem.GSReplayFuncLib.RegisterCSharpFuncLibObj
// 0x0010 (0x0010 - 0x0000)
struct GSReplayFuncLib_RegisterCSharpFuncLibObj final
{
public:
	const class UObject*                          WorldContext;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGSReplayCSharpFuncLib*                 CSharpFuncLibObj;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSReplayFuncLib_RegisterCSharpFuncLibObj;

// Function GSReplaySystem.GSReplayFuncLib.RegisterNetworkRemapPath
// 0x0010 (0x0010 - 0x0000)
struct GSReplayFuncLib_RegisterNetworkRemapPath final
{
public:
	const class UObject*                          WorldContext;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSReplayFuncLib_RegisterNetworkRemapPath;

// Function GSReplaySystem.GSReplayFuncLib.RequestCheckpoint
// 0x0008 (0x0008 - 0x0000)
struct GSReplayFuncLib_RequestCheckpoint final
{
public:
	const class UObject*                          WorldContext;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSReplayFuncLib_RequestCheckpoint;

// Function GSReplaySystem.GSReplayFuncLib.SetActorPrioritizationEnabled
// 0x0010 (0x0010 - 0x0000)
struct GSReplayFuncLib_SetActorPrioritizationEnabled final
{
public:
	const class UObject*                          WorldContext;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInPrioritizeActors;                               // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSReplayFuncLib_SetActorPrioritizationEnabled;

// Function GSReplaySystem.GSReplayFuncLib.SetDemoCurrentTime
// 0x0010 (0x0010 - 0x0000)
struct GSReplayFuncLib_SetDemoCurrentTime final
{
public:
	const class UObject*                          WorldContext;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentTime;                                       // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSReplayFuncLib_SetDemoCurrentTime;

// Function GSReplaySystem.GSReplayFuncLib.SetDemoPlayTimeDilation
// 0x0010 (0x0010 - 0x0000)
struct GSReplayFuncLib_SetDemoPlayTimeDilation final
{
public:
	const class UObject*                          WorldContext;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InDemoPlayTimeDilation;                            // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSReplayFuncLib_SetDemoPlayTimeDilation;

// Function GSReplaySystem.GSReplayFuncLib.SkipTime
// 0x0010 (0x0010 - 0x0000)
struct GSReplayFuncLib_SkipTime final
{
public:
	const class UObject*                          WorldContext;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InTimeToSkip;                                      // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSReplayFuncLib_SkipTime;

// Function GSReplaySystem.GSReplayFuncLib.StopReplay
// 0x0008 (0x0008 - 0x0000)
struct GSReplayFuncLib_StopReplay final
{
public:
	const class UObject*                          WorldContext;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSReplayFuncLib_StopReplay;

// Function GSReplaySystem.GSReplayFuncLib.UnregisterCSharpFuncLibObj
// 0x0008 (0x0008 - 0x0000)
struct GSReplayFuncLib_UnregisterCSharpFuncLibObj final
{
public:
	const class UObject*                          WorldContext;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSReplayFuncLib_UnregisterCSharpFuncLibObj;

// Function GSReplaySystem.GSReplayFuncLib.UnRegisterNetworkRemapPath
// 0x0008 (0x0008 - 0x0000)
struct GSReplayFuncLib_UnRegisterNetworkRemapPath final
{
public:
	const class UObject*                          WorldContext;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSReplayFuncLib_UnRegisterNetworkRemapPath;

}

