#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GSUMGExt

#include "Basic.hpp"

#include "GSUMGExt_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class GSUMGExt.GCTestB
// 0x0010 (0x0038 - 0x0028)
class UGCTestB final : public UObject
{
public:
	float                                         TestValueB;                                        // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCSTestC*                               ObjTestC;                                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void TestInit();
	void TestLog();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GCTestB")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GCTestB")
	}
	static class UGCTestB* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGCTestB>();
	}
};
DUMPER7_ASSERTS_UGCTestB;

// Class GSUMGExt.GSRichTextBlockZhuYinDecorator
// 0x0008 (0x0030 - 0x0028)
class UGSRichTextBlockZhuYinDecorator : public URichTextBlockDecorator
{
public:
	class UDataTable*                             ZhuYinSet;                                         // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSRichTextBlockZhuYinDecorator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSRichTextBlockZhuYinDecorator")
	}
	static class UGSRichTextBlockZhuYinDecorator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSRichTextBlockZhuYinDecorator>();
	}
};
DUMPER7_ASSERTS_UGSRichTextBlockZhuYinDecorator;

// Class GSUMGExt.GSSearchBox
// 0x0020 (0x0150 - 0x0130)
class UGSSearchBox final : public UWidget
{
public:
	TMulticastInlineDelegate<void(const class FText& Text)> OnSearchTextChanged;                     // 0x0130(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_140[0x10];                                     // 0x0140(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class FText GetText() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSSearchBox")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSSearchBox")
	}
	static class UGSSearchBox* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSSearchBox>();
	}
};
DUMPER7_ASSERTS_UGSSearchBox;

// Class GSUMGExt.GSSplitterBoxSlot
// 0x0010 (0x0048 - 0x0038)
class UGSSplitterBoxSlot final : public UPanelSlot
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Size;                                              // 0x0040(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetSize(float InSize);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSSplitterBoxSlot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSSplitterBoxSlot")
	}
	static class UGSSplitterBoxSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSSplitterBoxSlot>();
	}
};
DUMPER7_ASSERTS_UGSSplitterBoxSlot;

// Class GSUMGExt.GSSplitterBox
// 0x0028 (0x0170 - 0x0148)
class UGSSplitterBox final : public UPanelWidget
{
public:
	TMulticastInlineDelegate<void()>              OnSplitterFinishedResizing;                        // 0x0148(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	EOrientation                                  Orientation;                                       // 0x0158(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_159[0x17];                                     // 0x0159(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UGSSplitterBoxSlot* AddChildToSplitterBox(class UWidget* Content);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSSplitterBox")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSSplitterBox")
	}
	static class UGSSplitterBox* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSSplitterBox>();
	}
};
DUMPER7_ASSERTS_UGSSplitterBox;

// Class GSUMGExt.UMGExtFuncLib
// 0x0000 (0x0028 - 0x0028)
class UUMGExtFuncLib final : public UBlueprintFunctionLibrary
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UMGExtFuncLib")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UMGExtFuncLib")
	}
	static class UUMGExtFuncLib* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMGExtFuncLib>();
	}
};
DUMPER7_ASSERTS_UUMGExtFuncLib;

// Class GSUMGExt.GCTestA
// 0x0008 (0x0030 - 0x0028)
class UGCTestA final : public UObject
{
public:
	float                                         TestValueA;                                        // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GCTestA")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GCTestA")
	}
	static class UGCTestA* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGCTestA>();
	}
};
DUMPER7_ASSERTS_UGCTestA;

// Class GSUMGExt.CSTestC
// 0x0058 (0x0080 - 0x0028)
class UCSTestC final : public UObject
{
public:
	int32                                         TestCValue;                                        // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, struct FTestTmp>            MapTestA;                                          // 0x0030(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CSTestC")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CSTestC")
	}
	static class UCSTestC* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCSTestC>();
	}
};
DUMPER7_ASSERTS_UCSTestC;

}

