#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HairStrandsCore

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "HairStrandsCore_structs.hpp"
#include "MovieScene_classes.hpp"
#include "Niagara_structs.hpp"
#include "Niagara_classes.hpp"


namespace SDK
{

// Class HairStrandsCore.GroomActor
// 0x0008 (0x0290 - 0x0288)
class AGroomActor final : public AActor
{
public:
	class UGroomComponent*                        GroomComponent;                                    // 0x0288(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GroomActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GroomActor")
	}
	static class AGroomActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGroomActor>();
	}
};
DUMPER7_ASSERTS_AGroomActor;

// Class HairStrandsCore.GroomAsset
// 0x00D0 (0x00F8 - 0x0028)
class UGroomAsset final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHairGroupInfoWithVisibility>   HairGroupsInfo;                                    // 0x0030(0x0010)(Edit, EditFixedSize, ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<struct FHairGroupsRendering>           HairGroupsRendering;                               // 0x0040(0x0010)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FHairGroupsPhysics>             HairGroupsPhysics;                                 // 0x0050(0x0010)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FHairGroupsInterpolation>       HairGroupsInterpolation;                           // 0x0060(0x0010)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FHairGroupsLOD>                 HairGroupsLOD;                                     // 0x0070(0x0010)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FHairGroupsCardsSourceDescription> HairGroupsCards;                                // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FHairGroupsMeshesSourceDescription> HairGroupsMeshes;                              // 0x0090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FHairGroupsMaterial>            HairGroupsMaterials;                               // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_B0[0x10];                                      // 0x00B0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          EnableGlobalInterpolation;                         // 0x00C0(0x0001)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGroomInterpolationType                       HairInterpolationType;                             // 0x00C1(0x0001)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPerPlatformInt                        MinLOD;                                            // 0x00C4(0x0004)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FPerPlatformBool                       DisableBelowMinLodStripping;                       // 0x00C8(0x0001)(Edit, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 EffectiveLODBias;                                  // 0x00D0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UAssetUserData*>                 AssetUserData;                                     // 0x00E0(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, AdvancedDisplay, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_F0[0x8];                                       // 0x00F0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GroomAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GroomAsset")
	}
	static class UGroomAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomAsset>();
	}
};
DUMPER7_ASSERTS_UGroomAsset;

// Class HairStrandsCore.GroomAssetImportData
// 0x0008 (0x0030 - 0x0028)
class UGroomAssetImportData final : public UAssetImportData
{
public:
	class UGroomImportOptions*                    ImportOptions;                                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GroomAssetImportData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GroomAssetImportData")
	}
	static class UGroomAssetImportData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomAssetImportData>();
	}
};
DUMPER7_ASSERTS_UGroomAssetImportData;

// Class HairStrandsCore.GroomBindingAsset
// 0x0088 (0x00B0 - 0x0028)
class alignas(0x10) UGroomBindingAsset final : public UObject
{
public:
	EGroomBindingMeshType                         GroomBindingType;                                  // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGroomAsset*                            Groom;                                             // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          SourceSkeletalMesh;                                // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          TargetSkeletalMesh;                                // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGeometryCache*                         SourceGeometryCache;                               // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGeometryCache*                         TargetGeometryCache;                               // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumInterpolationPoints;                            // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MatchingSection;                                   // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGoomBindingGroupInfo>          GroupInfos;                                        // 0x0060(0x0010)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_70[0x40];                                      // 0x0070(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GroomBindingAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GroomBindingAsset")
	}
	static class UGroomBindingAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomBindingAsset>();
	}
};
DUMPER7_ASSERTS_UGroomBindingAsset;

// Class HairStrandsCore.GroomBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UGroomBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class UGroomBindingAsset* CreateNewGeometryCacheGroomBindingAsset(class UGroomAsset* GroomAsset, class UGeometryCache* GeometryCache, int32 NumInterpolationPoints, class UGeometryCache* SourceGeometryCacheForTransfer, int32 MatchingSection);
	static class UGroomBindingAsset* CreateNewGeometryCacheGroomBindingAssetWithPath(const class FString& DesiredPackagePath, class UGroomAsset* GroomAsset, class UGeometryCache* GeometryCache, int32 NumInterpolationPoints, class UGeometryCache* SourceGeometryCacheForTransfer, int32 MatchingSection);
	static class UGroomBindingAsset* CreateNewGroomBindingAsset(class UGroomAsset* InGroomAsset, class USkeletalMesh* InSkeletalMesh, int32 InNumInterpolationPoints, class USkeletalMesh* InSourceSkeletalMeshForTransfer, int32 InMatchingSection);
	static class UGroomBindingAsset* CreateNewGroomBindingAssetWithPath(const class FString& InDesiredPackagePath, class UGroomAsset* InGroomAsset, class USkeletalMesh* InSkeletalMesh, int32 InNumInterpolationPoints, class USkeletalMesh* InSourceSkeletalMeshForTransfer, int32 InMatchingSection);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GroomBlueprintLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GroomBlueprintLibrary")
	}
	static class UGroomBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomBlueprintLibrary>();
	}
};
DUMPER7_ASSERTS_UGroomBlueprintLibrary;

// Class HairStrandsCore.GroomCache
// 0x0040 (0x0068 - 0x0028)
class UGroomCache final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGroomCacheInfo                        GroomCacheInfo;                                    // 0x0030(0x0028)(Edit, EditConst, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GroomCache")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GroomCache")
	}
	static class UGroomCache* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomCache>();
	}
};
DUMPER7_ASSERTS_UGroomCache;

// Class HairStrandsCore.GroomCacheImportOptions
// 0x0028 (0x0050 - 0x0028)
class UGroomCacheImportOptions final : public UObject
{
public:
	struct FGroomCacheImportSettings              ImportSettings;                                    // 0x0028(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GroomCacheImportOptions")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GroomCacheImportOptions")
	}
	static class UGroomCacheImportOptions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomCacheImportOptions>();
	}
};
DUMPER7_ASSERTS_UGroomCacheImportOptions;

// Class HairStrandsCore.GroomCacheImportData
// 0x0028 (0x0050 - 0x0028)
class UGroomCacheImportData final : public UAssetImportData
{
public:
	struct FGroomCacheImportSettings              Settings;                                          // 0x0028(0x0028)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GroomCacheImportData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GroomCacheImportData")
	}
	static class UGroomCacheImportData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomCacheImportData>();
	}
};
DUMPER7_ASSERTS_UGroomCacheImportData;

// Class HairStrandsCore.GroomComponent
// 0x0240 (0x07D0 - 0x0590)
class UGroomComponent final : public UMeshComponent
{
public:
	uint8                                         Pad_590[0x8];                                      // 0x0590(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UGroomAsset*                            GroomAsset;                                        // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGroomCache*                            GroomCache;                                        // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UNiagaraComponent*>              NiagaraComponents;                                 // 0x05A8(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          SourceSkeletalMesh;                                // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGroomBindingAsset*                     BindingAsset;                                      // 0x05C0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPhysicsAsset*                          PhysicsAsset;                                      // 0x05C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5D0[0x10];                                     // 0x05D0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHairSimulationSettings                SimulationSettings;                                // 0x05E0(0x0090)(Edit, BlueprintVisible, Interp, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     Strands_DebugMaterial;                             // 0x0670(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     Strands_DefaultMaterial;                           // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     Cards_DefaultMaterial;                             // 0x0680(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     Meshes_DefaultMaterial;                            // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraSystem*                         AngularSpringsSystem;                              // 0x0690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraSystem*                         CosseratRodsSystem;                                // 0x0698(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AttachmentName;                                    // 0x06A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Interp, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6B0[0x90];                                     // 0x06B0(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHairGroupDesc>                 GroomGroupsDesc;                                   // 0x0740(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bUseCards;                                         // 0x0750(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRunning;                                          // 0x0751(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bLooping;                                          // 0x0752(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bManualTick;                                       // 0x0753(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         ElapsedTime;                                       // 0x0754(0x0004)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_758[0x78];                                     // 0x0758(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddCollisionComponent(class USkeletalMeshComponent* SkeletalMeshComponent);
	bool GetIsHairLengthScaleEnabled();
	void ResetCollisionComponents();
	void ResetSimulation();
	void SetBindingAsset(class UGroomBindingAsset* InBinding);
	void SetEnableSimulation(bool bInEnableSimulation);
	void SetGroomAsset(class UGroomAsset* Asset);
	void SetHairLengthScale(float Scale);
	void SetHairLengthScaleEnable(bool bEnable);
	void SetPhysicsAsset(class UPhysicsAsset* InPhysicsAsset);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GroomComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GroomComponent")
	}
	static class UGroomComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomComponent>();
	}
};
DUMPER7_ASSERTS_UGroomComponent;

// Class HairStrandsCore.GroomCreateBindingOptions
// 0x0030 (0x0058 - 0x0028)
class UGroomCreateBindingOptions final : public UObject
{
public:
	EGroomBindingMeshType                         GroomBindingType;                                  // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          SourceSkeletalMesh;                                // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          TargetSkeletalMesh;                                // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGeometryCache*                         SourceGeometryCache;                               // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGeometryCache*                         TargetGeometryCache;                               // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumInterpolationPoints;                            // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MatchingSection;                                   // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GroomCreateBindingOptions")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GroomCreateBindingOptions")
	}
	static class UGroomCreateBindingOptions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomCreateBindingOptions>();
	}
};
DUMPER7_ASSERTS_UGroomCreateBindingOptions;

// Class HairStrandsCore.GroomCreateFollicleMaskOptions
// 0x0018 (0x0040 - 0x0028)
class UGroomCreateFollicleMaskOptions final : public UObject
{
public:
	int32                                         Resolution;                                        // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RootRadius;                                        // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FFollicleMaskOptions>           Grooms;                                            // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GroomCreateFollicleMaskOptions")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GroomCreateFollicleMaskOptions")
	}
	static class UGroomCreateFollicleMaskOptions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomCreateFollicleMaskOptions>();
	}
};
DUMPER7_ASSERTS_UGroomCreateFollicleMaskOptions;

// Class HairStrandsCore.GroomCreateStrandsTexturesOptions
// 0x0040 (0x0068 - 0x0028)
class UGroomCreateStrandsTexturesOptions final : public UObject
{
public:
	int32                                         Resolution;                                        // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStrandsTexturesTraceType                     TraceType;                                         // 0x002C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TraceDistance;                                     // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStrandsTexturesMeshType                      MeshType;                                          // 0x0034(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            StaticMesh;                                        // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          SkeletalMesh;                                      // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LODIndex;                                          // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SectionIndex;                                      // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UVChannelIndex;                                    // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 GroupIndex;                                        // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GroomCreateStrandsTexturesOptions")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GroomCreateStrandsTexturesOptions")
	}
	static class UGroomCreateStrandsTexturesOptions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomCreateStrandsTexturesOptions>();
	}
};
DUMPER7_ASSERTS_UGroomCreateStrandsTexturesOptions;

// Class HairStrandsCore.GroomImportOptions
// 0x0040 (0x0068 - 0x0028)
class UGroomImportOptions final : public UObject
{
public:
	struct FGroomConversionSettings               ConversionSettings;                                // 0x0028(0x0030)(Edit, BlueprintVisible, Config, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FHairGroupsInterpolation>       InterpolationSettings;                             // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GroomImportOptions")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GroomImportOptions")
	}
	static class UGroomImportOptions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomImportOptions>();
	}
};
DUMPER7_ASSERTS_UGroomImportOptions;

// Class HairStrandsCore.GroomHairGroupsPreview
// 0x0010 (0x0038 - 0x0028)
class UGroomHairGroupsPreview final : public UObject
{
public:
	TArray<struct FGroomHairGroupPreview>         Groups;                                            // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GroomHairGroupsPreview")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GroomHairGroupsPreview")
	}
	static class UGroomHairGroupsPreview* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomHairGroupsPreview>();
	}
};
DUMPER7_ASSERTS_UGroomHairGroupsPreview;

// Class HairStrandsCore.GroomPluginSettings
// 0x0008 (0x0030 - 0x0028)
class UGroomPluginSettings final : public UObject
{
public:
	float                                         GroomCacheLookAheadBuffer;                         // 0x0028(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GroomPluginSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GroomPluginSettings")
	}
	static class UGroomPluginSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomPluginSettings>();
	}
};
DUMPER7_ASSERTS_UGroomPluginSettings;

// Class HairStrandsCore.MovieSceneGroomCacheSection
// 0x0020 (0x0108 - 0x00E8)
class UMovieSceneGroomCacheSection final : public UMovieSceneSection
{
public:
	struct FMovieSceneGroomCacheParams            Params_0;                                          // 0x00E8(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneGroomCacheSection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneGroomCacheSection")
	}
	static class UMovieSceneGroomCacheSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneGroomCacheSection>();
	}
};
DUMPER7_ASSERTS_UMovieSceneGroomCacheSection;

// Class HairStrandsCore.MovieSceneGroomCacheTrack
// 0x0018 (0x00A8 - 0x0090)
class UMovieSceneGroomCacheTrack final : public UMovieSceneNameableTrack
{
public:
	uint8                                         Pad_90[0x8];                                       // 0x0090(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMovieSceneSection*>             AnimationSections;                                 // 0x0098(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneGroomCacheTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneGroomCacheTrack")
	}
	static class UMovieSceneGroomCacheTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneGroomCacheTrack>();
	}
};
DUMPER7_ASSERTS_UMovieSceneGroomCacheTrack;

// Class HairStrandsCore.NiagaraDataInterfaceHairStrands
// 0x0018 (0x0050 - 0x0038)
class UNiagaraDataInterfaceHairStrands final : public UNiagaraDataInterface
{
public:
	class UGroomAsset*                            DefaultSource;                                     // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 SourceActor;                                       // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataInterfaceHairStrands")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataInterfaceHairStrands")
	}
	static class UNiagaraDataInterfaceHairStrands* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceHairStrands>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataInterfaceHairStrands;

// Class HairStrandsCore.NiagaraDataInterfacePhysicsAsset
// 0x0050 (0x0088 - 0x0038)
class UNiagaraDataInterfacePhysicsAsset final : public UNiagaraDataInterface
{
public:
	class UPhysicsAsset*                          DefaultSource;                                     // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 SourceActor;                                       // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNiagaraUserParameterBinding           MeshUserParameter;                                 // 0x0048(0x0020)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x20];                                      // 0x0068(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataInterfacePhysicsAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataInterfacePhysicsAsset")
	}
	static class UNiagaraDataInterfacePhysicsAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfacePhysicsAsset>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataInterfacePhysicsAsset;

// Class HairStrandsCore.NiagaraDataInterfaceVelocityGrid
// 0x0010 (0x0048 - 0x0038)
class UNiagaraDataInterfaceVelocityGrid : public UNiagaraDataInterfaceRWBase
{
public:
	struct FIntVector                             GridSize;                                          // 0x0038(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataInterfaceVelocityGrid")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataInterfaceVelocityGrid")
	}
	static class UNiagaraDataInterfaceVelocityGrid* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceVelocityGrid>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataInterfaceVelocityGrid;

// Class HairStrandsCore.NiagaraDataInterfacePressureGrid
// 0x0000 (0x0048 - 0x0048)
class UNiagaraDataInterfacePressureGrid final : public UNiagaraDataInterfaceVelocityGrid
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataInterfacePressureGrid")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataInterfacePressureGrid")
	}
	static class UNiagaraDataInterfacePressureGrid* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfacePressureGrid>();
	}
};
