#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HGS_Weapon_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "b1_Managed_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass HGS_Weapon_Base.HGS_Weapon_Base_C
// 0x0028 (0x0340 - 0x0318)
class AHGS_Weapon_Base_C : public ABGUWeaponBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         DisData_dis_5955D6C5427E88E46A4BE0AFBF4B00A9;      // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            DisData__Direction_5955D6C5427E88E46A4BE0AFBF4B00A9; // 0x0324(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_325[0x3];                                      // 0x0325(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     DisData;                                           // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            DisolveCurve;                                      // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DisolvedDelayTimeToDestory;                        // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_HGS_Weapon_Base(int32 EntryPoint);
	void DisData__UpdateFunc();
	void DisData__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("HGS_Weapon_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HGS_Weapon_Base_C")
	}
	static class AHGS_Weapon_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHGS_Weapon_Base_C>();
	}
};
DUMPER7_ASSERTS_AHGS_Weapon_Base_C;

}

