#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JavascriptUMG

#include "Basic.hpp"


namespace SDK
{

// Enum JavascriptUMG.EJavasrciptUserInterfaceActionType
// NumValues: 0x0007
enum class EJavasrciptUserInterfaceActionType : uint8
{
	None                                     = 0,
	Button                                   = 1,
	ToggleButton                             = 2,
	RadioButton                              = 3,
	Check                                    = 4,
	CollapsedButton                          = 5,
	EJavasrciptUserInterfaceActionType_MAX   = 6,
};

// Enum JavascriptUMG.EJavascriptSizingRule
// NumValues: 0x0004
enum class EJavascriptSizingRule : uint8
{
	FixedSize                                = 0,
	Autosized                                = 1,
	UserSized                                = 2,
	EJavascriptSizingRule_MAX                = 3,
};

// Enum JavascriptUMG.EJavascriptWindowTransparency
// NumValues: 0x0003
enum class EJavascriptWindowTransparency : uint8
{
	None                                     = 0,
	PerWindow                                = 1,
	EJavascriptWindowTransparency_MAX        = 2,
};

// Enum JavascriptUMG.EJavascriptAutoCenter
// NumValues: 0x0004
enum class EJavascriptAutoCenter : uint8
{
	None                                     = 0,
	PrimaryWorkArea                          = 1,
	PreferredWorkArea                        = 2,
	EJavascriptAutoCenter_MAX                = 3,
};

// Enum JavascriptUMG.EJavascriptWindowType
// NumValues: 0x0006
enum class EJavascriptWindowType : uint8
{
	Normal                                   = 0,
	Menu                                     = 1,
	ToolTip                                  = 2,
	Notification                             = 3,
	CursorDecorator                          = 4,
	EJavascriptWindowType_MAX                = 5,
};

// ScriptStruct JavascriptUMG.JavascriptTextLayout
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FJavascriptTextLayout final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FJavascriptTextLayout;

// ScriptStruct JavascriptUMG.JavascriptSlateWidget
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FJavascriptSlateWidget final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FJavascriptSlateWidget;

// ScriptStruct JavascriptUMG.JavascriptSlateIcon
// 0x0018 (0x0018 - 0x0000)
struct FJavascriptSlateIcon final
{
public:
	class FName                                   StyleSetName;                                      // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   StyleName;                                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SmallStyleName;                                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJavascriptSlateIcon;

// ScriptStruct JavascriptUMG.JavascriptStyleSet
// 0x0008 (0x0008 - 0x0000)
struct FJavascriptStyleSet final
{
public:
	class FName                                   StyleSetName;                                      // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJavascriptStyleSet;

// ScriptStruct JavascriptUMG.JavascriptColumn
// 0x0020 (0x0020 - 0x0000)
struct FJavascriptColumn final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Width;                                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                Widget;                                            // 0x0018(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJavascriptColumn;

// ScriptStruct JavascriptUMG.JavascriptSlateTextRun
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FJavascriptSlateTextRun final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FJavascriptSlateTextRun;

// ScriptStruct JavascriptUMG.JavascriptSlateStyle
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FJavascriptSlateStyle final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FJavascriptSlateStyle;

}

