#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JavascriptWebSocket

#include "Basic.hpp"


namespace SDK::Params
{

// Function JavascriptWebSocket.JavascriptWebSocket.Connect
// 0x0018 (0x0018 - 0x0000)
struct JavascriptWebSocket_Connect final
{
public:
	class FString                                 Endpoint;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UJavascriptWebSocket*                   ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptWebSocket_Connect;

// Function JavascriptWebSocket.JavascriptWebSocket.GetReceivedBytes
// 0x0004 (0x0004 - 0x0000)
struct JavascriptWebSocket_GetReceivedBytes final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptWebSocket_GetReceivedBytes;

// Function JavascriptWebSocket.JavascriptWebSocket.LocalEndPoint
// 0x0018 (0x0018 - 0x0000)
struct JavascriptWebSocket_LocalEndPoint final
{
public:
	bool                                          bAppendPort;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptWebSocket_LocalEndPoint;

// Function JavascriptWebSocket.JavascriptWebSocket.RemoteEndPoint
// 0x0018 (0x0018 - 0x0000)
struct JavascriptWebSocket_RemoteEndPoint final
{
public:
	bool                                          bAppendPort;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptWebSocket_RemoteEndPoint;

// Function JavascriptWebSocket.JavascriptWebSocket.SendMemory
// 0x0004 (0x0004 - 0x0000)
struct JavascriptWebSocket_SendMemory final
{
public:
	int32                                         NumBytes;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptWebSocket_SendMemory;

// Function JavascriptWebSocket.JavascriptWebSocketServer.Create
// 0x0010 (0x0010 - 0x0000)
struct JavascriptWebSocketServer_Create final
{
public:
	int32                                         Port;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UJavascriptWebSocketServer*             ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptWebSocketServer_Create;

// Function JavascriptWebSocket.JavascriptWebSocketServer.Info
// 0x0010 (0x0010 - 0x0000)
struct JavascriptWebSocketServer_Info final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptWebSocketServer_Info;

}

