#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LSP_niumowang

#include "Basic.hpp"

#include "b1_Managed_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass LSP_niumowang.LSP_niumowang_C
// 0x0040 (0x0380 - 0x0340)
class ALSP_niumowang_C final : public ABGUPerformerActorCS
{
public:
	class UTressFXComponent*                      HAIR_body_belly_baseshort;                         // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTressFXComponent*                      HAIR_head_back_baseshort;                          // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTressFXComponent*                      HAIR_top_long;                                     // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTressFXComponent*                      HAIR_head_short;                                   // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTressFXComponent*                      HAIR_head_longbeard;                               // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTressFXComponent*                      HAIR_head_back_long;                               // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTressFXComponent*                      HAIR_body_belly_long;                              // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTressFXComponent*                      HAIR_body_arm;                                     // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("LSP_niumowang_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LSP_niumowang_C")
	}
	static class ALSP_niumowang_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALSP_niumowang_C>();
	}
};
DUMPER7_ASSERTS_ALSP_niumowang_C;

}

