#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mesh_Caustics_Parameters

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Mesh_Caustics_Parameters.Mesh_Caustics_Parameters
// 0x0160 (0x0160 - 0x0000)
struct FMesh_Caustics_Parameters final
{
public:
	class FString                                 EnableMeshCaustics_11_EF17A54E4000730673FD55AFA7851310; // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 MeshCausticsResolution_12_8CBAF5AD40511B86FFECDBBE10551070; // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 MeshCausticsBufferScale_13_82AC6AEE4DE3DABA0E6EF8AFC173099A; // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 MeshCausticsTemporalStrength_14_53019FA5437B781E8F3DCDA3EAA12347; // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 MeshCausticsJitter_15_A7EFA23F493F73491A338F833DD71740; // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 MeshCausticsEnableDispersion_16_D1059E664DB569A0DCD2868ED0E410C0; // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 MeshCausticsTranslucentReflectionMode_57_234A3311428BB4FD6186D485A258D216; // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 MeshCausticsMaxTraceDepth_18_E5DFC534448262757F618C984430031B; // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 MeshCausticsAdaptivePhotonSize_19_75A570FD45DDB1FFB198EAB522F1327C; // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 MeshCausticsEnableTemporalFilter_20_B10DF55042CC5EB4BBBD3C9029E72D25; // 0x0090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 MeshCausticsAdaptiveSmooth_26_B237A3464D57ACD60A63CEB0E381F8AF; // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 MeshCausticsAdaptiveUpdateSpeed_27_EBAA130A425D904E6219BC847C5D4E7E; // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 MeshCausticsAdaptiveVarianceGain_28_D612A8F64E9A6BB74AD5D0A9FC85241B; // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 MeshCausticsFixedLight_29_9C6912304FA41791E112799EF9B09B26; // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 MeshCausticsMaxIntensity_30_0571085B49EBB70A2506CC898A54B72E; // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 MeshCausticsSoftCausticsSample_34_23B75C3A4673EC4C06FB7380A1AFC77B; // 0x00F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 MeshCausticsEnableAdvancedSoftCaustics_40_EF539D7E4B254D3FF7354499EA1ADA17; // 0x0100(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 MeshCausticsMidCullColorThreshold_46_603884CE4A61EB477D7D2C82EFE3E844; // 0x0110(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 MeshCausticsFinalCullColorThreshold_47_ADE4A81B4FC53161666873B6CE1C1E16; // 0x0120(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 MeshCausticsIntensity_50_8E96F81D40BC087613695CBE1946AD28; // 0x0130(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 MeshCausticsMaxRayDistance_53_7A78E57D4BA078EDB6381A846432F21C; // 0x0140(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 MeshCausticsTemporalColorTolerance_56_C9E20A13401A4696C5D960922F2ED319; // 0x0150(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FMesh_Caustics_Parameters;

}

