#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ModelingComponents

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK
{

// Enum ModelingComponents.EBaseCreateFromSelectedTargetType
// NumValues: 0x0004
enum class EBaseCreateFromSelectedTargetType : uint32
{
	NewObject                                = 0,
	FirstInputObject                         = 1,
	LastInputObject                          = 2,
	EBaseCreateFromSelectedTargetType_MAX    = 3,
};

// Enum ModelingComponents.ECreateModelingObjectResult
// NumValues: 0x0009
enum class ECreateModelingObjectResult : uint8
{
	Ok                                       = 0,
	Cancelled                                = 1,
	Failed_Unknown                           = 2,
	Failed_NoAPIFound                        = 3,
	Failed_InvalidWorld                      = 4,
	Failed_InvalidMesh                       = 5,
	Failed_InvalidTexture                    = 6,
	Failed_AssetCreationFailed               = 7,
	ECreateModelingObjectResult_MAX          = 8,
};

// Enum ModelingComponents.ECreateMeshObjectSourceMeshType
// NumValues: 0x0003
enum class ECreateMeshObjectSourceMeshType : uint8
{
	MeshDescription                          = 0,
	DynamicMesh                              = 1,
	ECreateMeshObjectSourceMeshType_MAX      = 2,
};

// Enum ModelingComponents.ECreateObjectTypeHint
// NumValues: 0x0005
enum class ECreateObjectTypeHint : uint8
{
	Undefined                                = 0,
	StaticMesh                               = 1,
	Volume                                   = 2,
	DynamicMeshActor                         = 3,
	ECreateObjectTypeHint_MAX                = 4,
};

// Enum ModelingComponents.EMultiTransformerMode
// NumValues: 0x0003
enum class EMultiTransformerMode : uint8
{
	DefaultGizmo                             = 1,
	QuickAxisTranslation                     = 2,
	EMultiTransformerMode_MAX                = 3,
};

// Enum ModelingComponents.EHandleSourcesMethod
// NumValues: 0x0006
enum class EHandleSourcesMethod : uint8
{
	DeleteSources                            = 0,
	HideSources                              = 1,
	KeepSources                              = 2,
	KeepFirstSource                          = 3,
	KeepLastSource                           = 4,
	EHandleSourcesMethod_MAX                 = 5,
};

// Enum ModelingComponents.ESpaceCurveControlPointTransformMode
// NumValues: 0x0003
enum class ESpaceCurveControlPointTransformMode : uint32
{
	Shared                                   = 0,
	PerVertex                                = 1,
	ESpaceCurveControlPointTransformMode_MAX = 2,
};

// Enum ModelingComponents.ESpaceCurveControlPointOriginMode
// NumValues: 0x0004
enum class ESpaceCurveControlPointOriginMode : uint32
{
	Shared                                   = 0,
	First                                    = 1,
	Last                                     = 2,
	ESpaceCurveControlPointOriginMode_MAX    = 3,
};

// Enum ModelingComponents.ESpaceCurveControlPointFalloffType
// NumValues: 0x0003
enum class ESpaceCurveControlPointFalloffType : uint32
{
	Linear                                   = 0,
	Smooth                                   = 1,
	ESpaceCurveControlPointFalloffType_MAX   = 2,
};

// Enum ModelingComponents.EUVLayoutPreviewSide
// NumValues: 0x0003
enum class EUVLayoutPreviewSide : uint32
{
	Left                                     = 0,
	Right                                    = 1,
	EUVLayoutPreviewSide_MAX                 = 2,
};

// ScriptStruct ModelingComponents.ModelingToolsAxisFilter
// 0x0003 (0x0003 - 0x0000)
struct FModelingToolsAxisFilter final
{
public:
	bool                                          bAxisX;                                            // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAxisY;                                            // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAxisZ;                                            // 0x0002(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FModelingToolsAxisFilter;

// ScriptStruct ModelingComponents.CreateMeshObjectParams
// 0x05C0 (0x05C0 - 0x0000)
struct FCreateMeshObjectParams final
{
public:
	class UPrimitiveComponent*                    SourceComponent;                                   // 0x0000(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECreateObjectTypeHint                         TypeHint;                                          // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    TypeHintClass;                                     // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TypeHintExtended;                                  // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWorld*                                 TargetWorld;                                       // 0x0020(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0030(0x0060)(Edit, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 BaseName;                                          // 0x0090(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMaterialInterface*>             Materials;                                         // 0x00A0(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UMaterialInterface*>             AssetMaterials;                                    // 0x00B0(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                          bEnableCollision;                                  // 0x00C0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionTraceFlag                           CollisionMode;                                     // 0x00C1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableRaytracingSupport;                          // 0x00C2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableRecomputeNormals;                           // 0x00C3(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableRecomputeTangents;                          // 0x00C4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableNanite;                                     // 0x00C5(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C6[0x2];                                       // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         NaniteProxyTrianglePercent;                        // 0x00C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CC[0x4F4];                                     // 0x00CC(0x04F4)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCreateMeshObjectParams;

// ScriptStruct ModelingComponents.CreateMeshObjectResult
// 0x0020 (0x0020 - 0x0000)
struct FCreateMeshObjectResult final
{
public:
	ECreateModelingObjectResult                   ResultCode;                                        // 0x0000(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 NewActor;                                          // 0x0008(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    NewComponent;                                      // 0x0010(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                NewAsset;                                          // 0x0018(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCreateMeshObjectResult;

// ScriptStruct ModelingComponents.CreateTextureObjectParams
// 0x0030 (0x0030 - 0x0000)
struct FCreateTextureObjectParams final
{
public:
	int32                                         TypeHintExtended;                                  // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWorld*                                 TargetWorld;                                       // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                StoreRelativeToObject;                             // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BaseName;                                          // 0x0018(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             GeneratedTransientTexture;                         // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCreateTextureObjectParams;

// ScriptStruct ModelingComponents.CreateTextureObjectResult
// 0x0010 (0x0010 - 0x0000)
struct FCreateTextureObjectResult final
{
public:
	ECreateModelingObjectResult                   ResultCode;                                        // 0x0000(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                NewAsset;                                          // 0x0008(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCreateTextureObjectResult;

// ScriptStruct ModelingComponents.RenderableTriangleVertex
// 0x0048 (0x0048 - 0x0000)
struct FRenderableTriangleVertex final
{
public:
	struct FVector                                position;                                          // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              UV;                                                // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Normal;                                            // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 Color;                                             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRenderableTriangleVertex;

// ScriptStruct ModelingComponents.RenderableTriangle
// 0x00E0 (0x00E0 - 0x0000)
struct FRenderableTriangle final
{
public:
	class UMaterialInterface*                     Material;                                          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRenderableTriangleVertex              Vertex0;                                           // 0x0008(0x0048)(NoDestructor, NativeAccessSpecifierPublic)
	struct FRenderableTriangleVertex              Vertex1;                                           // 0x0050(0x0048)(NoDestructor, NativeAccessSpecifierPublic)
	struct FRenderableTriangleVertex              Vertex2;                                           // 0x0098(0x0048)(NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRenderableTriangle;

}

