#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OpacityMicroMap

#include "Basic.hpp"

#include "OpacityMicroMap_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class OpacityMicroMap.OpacityMicroMapData
// 0x0070 (0x0098 - 0x0028)
class UOpacityMicroMapData final : public UObject
{
public:
	TArray<uint8>                                 ArrayData;                                         // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint8>                                 DescArrayData;                                     // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FOpacityMicromapUsageCount>     DescArrayHistogram;                                // 0x0048(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint8>                                 IndexBuffer;                                       // 0x0058(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          Is16BitIndexBuffer;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FOpacityMicromapUsageCount>     IndexHistogram;                                    // 0x0070(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         VersionHash[0x14];                                 // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OpacityMicroMapData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OpacityMicroMapData")
	}
	static class UOpacityMicroMapData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOpacityMicroMapData>();
	}
};
DUMPER7_ASSERTS_UOpacityMicroMapData;

// Class OpacityMicroMap.OpacityMicroMapCollection
// 0x0050 (0x0078 - 0x0028)
class UOpacityMicroMapCollection final : public UObject
{
public:
	TMap<uint64, class UOpacityMicroMapData*>     Collection;                                        // 0x0028(0x0050)(UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OpacityMicroMapCollection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OpacityMicroMapCollection")
	}
	static class UOpacityMicroMapCollection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOpacityMicroMapCollection>();
	}
};
DUMPER7_ASSERTS_UOpacityMicroMapCollection;

// Class OpacityMicroMap.OpacityMicroMapAsset
// 0x0008 (0x0030 - 0x0028)
class UOpacityMicroMapAsset final : public UAssetUserData
{
public:
	class UOpacityMicroMapCollection*             Collection;                                        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OpacityMicroMapAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OpacityMicroMapAsset")
	}
	static class UOpacityMicroMapAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOpacityMicroMapAsset>();
	}
};
DUMPER7_ASSERTS_UOpacityMicroMapAsset;

// Class OpacityMicroMap.OMMBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UOMMBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void BuildAllStaticMesh(const class UObject* WorldContextObject);
	static float CalculateCurrentWorldOMMTotalDataSize(const class UObject* WorldContextObject);
	static bool IsThisDeviceSupportOMM(const class UObject* WorldContextObject);
	static void RemoveOMMUserData(class UStaticMesh* StaticMesh);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OMMBlueprintLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OMMBlueprintLibrary")
	}
	static class UOMMBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOMMBlueprintLibrary>();
	}
};
DUMPER7_ASSERTS_UOMMBlueprintLibrary;

}

