#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OpacityMicroMap

#include "Basic.hpp"


namespace SDK::Params
{

// Function OpacityMicroMap.OMMBlueprintLibrary.BuildAllStaticMesh
// 0x0008 (0x0008 - 0x0000)
struct OMMBlueprintLibrary_BuildAllStaticMesh final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OMMBlueprintLibrary_BuildAllStaticMesh;

// Function OpacityMicroMap.OMMBlueprintLibrary.CalculateCurrentWorldOMMTotalDataSize
// 0x0010 (0x0010 - 0x0000)
struct OMMBlueprintLibrary_CalculateCurrentWorldOMMTotalDataSize final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OMMBlueprintLibrary_CalculateCurrentWorldOMMTotalDataSize;

// Function OpacityMicroMap.OMMBlueprintLibrary.IsThisDeviceSupportOMM
// 0x0010 (0x0010 - 0x0000)
struct OMMBlueprintLibrary_IsThisDeviceSupportOMM final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OMMBlueprintLibrary_IsThisDeviceSupportOMM;

// Function OpacityMicroMap.OMMBlueprintLibrary.RemoveOMMUserData
// 0x0008 (0x0008 - 0x0000)
struct OMMBlueprintLibrary_RemoveOMMUserData final
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OMMBlueprintLibrary_RemoveOMMUserData;

}

