#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OSC

#include "Basic.hpp"

#include "OSC_structs.hpp"


namespace SDK::Params
{

// Function OSC.OSCClient.GetSendIPAddress
// 0x0018 (0x0018 - 0x0000)
struct OSCClient_GetSendIPAddress final
{
public:
	class FString                                 IPAddress;                                         // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Port;                                              // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OSCClient_GetSendIPAddress;

// Function OSC.OSCClient.SendOSCBundle
// 0x0010 (0x0010 - 0x0000)
struct OSCClient_SendOSCBundle final
{
public:
	struct FOSCBundle                             Bundle;                                            // 0x0000(0x0010)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCClient_SendOSCBundle;

// Function OSC.OSCClient.SendOSCMessage
// 0x0010 (0x0010 - 0x0000)
struct OSCClient_SendOSCMessage final
{
public:
	struct FOSCMessage                            Message;                                           // 0x0000(0x0010)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCClient_SendOSCMessage;

// Function OSC.OSCClient.SetSendIPAddress
// 0x0018 (0x0018 - 0x0000)
struct OSCClient_SetSendIPAddress final
{
public:
	class FString                                 IPAddress;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Port;                                              // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OSCClient_SetSendIPAddress;

// Function OSC.OSCManager.AddAddress
// 0x0048 (0x0048 - 0x0000)
struct OSCManager_AddAddress final
{
public:
	struct FOSCMessage                            Message;                                           // 0x0000(0x0010)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FOSCAddress                            Value;                                             // 0x0010(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOSCMessage                            ReturnValue;                                       // 0x0038(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCManager_AddAddress;

// Function OSC.OSCManager.AddBlob
// 0x0030 (0x0030 - 0x0000)
struct OSCManager_AddBlob final
{
public:
	struct FOSCMessage                            Message;                                           // 0x0000(0x0010)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<uint8>                                 Value;                                             // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FOSCMessage                            ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCManager_AddBlob;

// Function OSC.OSCManager.AddBool
// 0x0028 (0x0028 - 0x0000)
struct OSCManager_AddBool final
{
public:
	struct FOSCMessage                            Message;                                           // 0x0000(0x0010)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          Value;                                             // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOSCMessage                            ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCManager_AddBool;

// Function OSC.OSCManager.AddBundleToBundle
// 0x0030 (0x0030 - 0x0000)
struct OSCManager_AddBundleToBundle final
{
public:
	struct FOSCBundle                             InBundle;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FOSCBundle                             OutBundle;                                         // 0x0010(0x0010)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FOSCBundle                             ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCManager_AddBundleToBundle;

// Function OSC.OSCManager.AddFloat
// 0x0028 (0x0028 - 0x0000)
struct OSCManager_AddFloat final
{
public:
	struct FOSCMessage                            Message;                                           // 0x0000(0x0010)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOSCMessage                            ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCManager_AddFloat;

// Function OSC.OSCManager.AddInt32
// 0x0028 (0x0028 - 0x0000)
struct OSCManager_AddInt32 final
{
public:
	struct FOSCMessage                            Message;                                           // 0x0000(0x0010)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         Value;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOSCMessage                            ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCManager_AddInt32;

// Function OSC.OSCManager.AddInt64
// 0x0028 (0x0028 - 0x0000)
struct OSCManager_AddInt64 final
{
public:
	struct FOSCMessage                            Message;                                           // 0x0000(0x0010)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int64                                         Value;                                             // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOSCMessage                            ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCManager_AddInt64;

// Function OSC.OSCManager.AddMessageToBundle
// 0x0030 (0x0030 - 0x0000)
struct OSCManager_AddMessageToBundle final
{
public:
	struct FOSCMessage                            Message;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FOSCBundle                             Bundle;                                            // 0x0010(0x0010)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FOSCBundle                             ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCManager_AddMessageToBundle;

// Function OSC.OSCManager.AddString
// 0x0030 (0x0030 - 0x0000)
struct OSCManager_AddString final
{
public:
	struct FOSCMessage                            Message;                                           // 0x0000(0x0010)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOSCMessage                            ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCManager_AddString;

// Function OSC.OSCManager.ClearBundle
// 0x0020 (0x0020 - 0x0000)
struct OSCManager_ClearBundle final
{
public:
	struct FOSCBundle                             Bundle;                                            // 0x0000(0x0010)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FOSCBundle                             ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCManager_ClearBundle;

// Function OSC.OSCManager.ClearMessage
// 0x0020 (0x0020 - 0x0000)
struct OSCManager_ClearMessage final
{
public:
	struct FOSCMessage                            Message;                                           // 0x0000(0x0010)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FOSCMessage                            ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCManager_ClearMessage;

// Function OSC.OSCManager.ClearOSCAddressContainers
// 0x0050 (0x0050 - 0x0000)
struct OSCManager_ClearOSCAddressContainers final
{
public:
	struct FOSCAddress                            Address;                                           // 0x0000(0x0028)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOSCAddress                            ReturnValue;                                       // 0x0028(0x0028)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCManager_ClearOSCAddressContainers;

// Function OSC.OSCManager.ConvertStringToOSCAddress
// 0x0038 (0x0038 - 0x0000)
struct OSCManager_ConvertStringToOSCAddress final
{
public:
	class FString                                 String;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOSCAddress                            ReturnValue;                                       // 0x0010(0x0028)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCManager_ConvertStringToOSCAddress;

// Function OSC.OSCManager.CreateOSCClient
// 0x0038 (0x0038 - 0x0000)
struct OSCManager_CreateOSCClient final
{
public:
	class FString                                 SendIPAddress;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Port;                                              // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ClientName;                                        // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                Outer_0;                                           // 0x0028(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOSCClient*                             ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCManager_CreateOSCClient;

// Function OSC.OSCManager.CreateOSCServer
// 0x0038 (0x0038 - 0x0000)
struct OSCManager_CreateOSCServer final
{
public:
	class FString                                 ReceiveIPAddress;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Port;                                              // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMulticastLoopback;                                // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStartListening;                                   // 0x0015(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ServerName;                                        // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                Outer_0;                                           // 0x0028(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOSCServer*                             ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCManager_CreateOSCServer;

// Function OSC.OSCManager.FindObjectAtOSCAddress
// 0x0030 (0x0030 - 0x0000)
struct OSCManager_FindObjectAtOSCAddress final
{
public:
	struct FOSCAddress                            Address;                                           // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCManager_FindObjectAtOSCAddress;

// Function OSC.OSCManager.GetAddress
// 0x0048 (0x0048 - 0x0000)
struct OSCManager_GetAddress final
{
public:
	struct FOSCMessage                            Message;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOSCAddress                            Value;                                             // 0x0018(0x0028)(Parm, OutParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OSCManager_GetAddress;

// Function OSC.OSCManager.GetAllAddresses
// 0x0020 (0x0020 - 0x0000)
struct OSCManager_GetAllAddresses final
{
public:
	struct FOSCMessage                            Message;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FOSCAddress>                    Values;                                            // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCManager_GetAllAddresses;

// Function OSC.OSCManager.GetAllBools
// 0x0020 (0x0020 - 0x0000)
struct OSCManager_GetAllBools final
{
public:
	struct FOSCMessage                            Message;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<bool>                                  Values;                                            // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCManager_GetAllBools;

// Function OSC.OSCManager.GetAllFloats
// 0x0020 (0x0020 - 0x0000)
struct OSCManager_GetAllFloats final
{
public:
	struct FOSCMessage                            Message;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<float>                                 Values;                                            // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCManager_GetAllFloats;

// Function OSC.OSCManager.GetAllInt32s
// 0x0020 (0x0020 - 0x0000)
struct OSCManager_GetAllInt32s final
{
public:
	struct FOSCMessage                            Message;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<int32>                                 Values;                                            // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCManager_GetAllInt32s;

// Function OSC.OSCManager.GetAllInt64s
// 0x0020 (0x0020 - 0x0000)
struct OSCManager_GetAllInt64s final
{
public:
	struct FOSCMessage                            Message;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<int64>                                 Values;                                            // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCManager_GetAllInt64s;

// Function OSC.OSCManager.GetAllStrings
// 0x0020 (0x0020 - 0x0000)
struct OSCManager_GetAllStrings final
{
public:
	struct FOSCMessage                            Message;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class FString>                         Values;                                            // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCManager_GetAllStrings;

// Function OSC.OSCManager.GetBlob
// 0x0030 (0x0030 - 0x0000)
struct OSCManager_GetBlob final
{
public:
	struct FOSCMessage                            Message;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 Value;                                             // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OSCManager_GetBlob;

// Function OSC.OSCManager.GetBool
// 0x0018 (0x0018 - 0x0000)
struct OSCManager_GetBool final
{
public:
	struct FOSCMessage                            Message;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Value;                                             // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0015(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OSCManager_GetBool;

// Function OSC.OSCManager.GetBundlesFromBundle
// 0x0020 (0x0020 - 0x0000)
struct OSCManager_GetBundlesFromBundle final
{
public:
	struct FOSCBundle                             Bundle;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FOSCBundle>                     ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCManager_GetBundlesFromBundle;

// Function OSC.OSCManager.GetFloat
// 0x0020 (0x0020 - 0x0000)
struct OSCManager_GetFloat final
{
public:
	struct FOSCMessage                            Message;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OSCManager_GetFloat;

// Function OSC.OSCManager.GetInt32
// 0x0020 (0x0020 - 0x0000)
struct OSCManager_GetInt32 final
{
public:
	struct FOSCMessage                            Message;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Value;                                             // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OSCManager_GetInt32;

// Function OSC.OSCManager.GetInt64
// 0x0028 (0x0028 - 0x0000)
struct OSCManager_GetInt64 final
{
public:
	struct FOSCMessage                            Message;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         Value;                                             // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OSCManager_GetInt64;

// Function OSC.OSCManager.GetMessageFromBundle
// 0x0028 (0x0028 - 0x0000)
struct OSCManager_GetMessageFromBundle final
{
public:
	struct FOSCBundle                             Bundle;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSucceeded;                                        // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOSCMessage                            ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCManager_GetMessageFromBundle;

// Function OSC.OSCManager.GetMessagesFromBundle
// 0x0020 (0x0020 - 0x0000)
struct OSCManager_GetMessagesFromBundle final
{
public:
	struct FOSCBundle                             Bundle;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FOSCMessage>                    ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCManager_GetMessagesFromBundle;

// Function OSC.OSCManager.GetOSCAddressContainer
// 0x0040 (0x0040 - 0x0000)
struct OSCManager_GetOSCAddressContainer final
{
public:
	struct FOSCAddress                            Address;                                           // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0028(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCManager_GetOSCAddressContainer;

// Function OSC.OSCManager.GetOSCAddressContainerPath
// 0x0038 (0x0038 - 0x0000)
struct OSCManager_GetOSCAddressContainerPath final
{
public:
	struct FOSCAddress                            Address;                                           // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCManager_GetOSCAddressContainerPath;

// Function OSC.OSCManager.GetOSCAddressContainers
// 0x0038 (0x0038 - 0x0000)
struct OSCManager_GetOSCAddressContainers final
{
public:
	struct FOSCAddress                            Address;                                           // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         ReturnValue;                                       // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCManager_GetOSCAddressContainers;

// Function OSC.OSCManager.GetOSCAddressFullPath
// 0x0038 (0x0038 - 0x0000)
struct OSCManager_GetOSCAddressFullPath final
{
public:
	struct FOSCAddress                            Address;                                           // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCManager_GetOSCAddressFullPath;

// Function OSC.OSCManager.GetOSCAddressMethod
// 0x0038 (0x0038 - 0x0000)
struct OSCManager_GetOSCAddressMethod final
{
public:
	struct FOSCAddress                            Address;                                           // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCManager_GetOSCAddressMethod;

// Function OSC.OSCManager.GetOSCMessageAddress
// 0x0038 (0x0038 - 0x0000)
struct OSCManager_GetOSCMessageAddress final
{
public:
	struct FOSCMessage                            Message;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FOSCAddress                            ReturnValue;                                       // 0x0010(0x0028)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCManager_GetOSCMessageAddress;

// Function OSC.OSCManager.GetString
// 0x0030 (0x0030 - 0x0000)
struct OSCManager_GetString final
{
public:
	struct FOSCMessage                            Message;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Value;                                             // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OSCManager_GetString;

// Function OSC.OSCManager.ObjectPathFromOSCAddress
// 0x0038 (0x0038 - 0x0000)
struct OSCManager_ObjectPathFromOSCAddress final
{
public:
	struct FOSCAddress                            Address;                                           // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCManager_ObjectPathFromOSCAddress;

// Function OSC.OSCManager.OSCAddressFromObjectPath
// 0x0030 (0x0030 - 0x0000)
struct OSCManager_OSCAddressFromObjectPath final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOSCAddress                            ReturnValue;                                       // 0x0008(0x0028)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCManager_OSCAddressFromObjectPath;

// Function OSC.OSCManager.OSCAddressFromObjectPathString
// 0x0038 (0x0038 - 0x0000)
struct OSCManager_OSCAddressFromObjectPathString final
{
public:
	class FString                                 PathName;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOSCAddress                            ReturnValue;                                       // 0x0010(0x0028)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCManager_OSCAddressFromObjectPathString;

// Function OSC.OSCManager.OSCAddressIsValidPath
// 0x0030 (0x0030 - 0x0000)
struct OSCManager_OSCAddressIsValidPath final
{
public:
	struct FOSCAddress                            Address;                                           // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OSCManager_OSCAddressIsValidPath;

// Function OSC.OSCManager.OSCAddressIsValidPattern
// 0x0030 (0x0030 - 0x0000)
struct OSCManager_OSCAddressIsValidPattern final
{
public:
	struct FOSCAddress                            Address;                                           // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OSCManager_OSCAddressIsValidPattern;

// Function OSC.OSCManager.OSCAddressPathMatchesPattern
// 0x0058 (0x0058 - 0x0000)
struct OSCManager_OSCAddressPathMatchesPattern final
{
public:
	struct FOSCAddress                            Pattern;                                           // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOSCAddress                            Path;                                              // 0x0028(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OSCManager_OSCAddressPathMatchesPattern;

// Function OSC.OSCManager.OSCAddressPopContainer
// 0x0038 (0x0038 - 0x0000)
struct OSCManager_OSCAddressPopContainer final
{
public:
	struct FOSCAddress                            Address;                                           // 0x0000(0x0028)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCManager_OSCAddressPopContainer;

// Function OSC.OSCManager.OSCAddressPopContainers
// 0x0040 (0x0040 - 0x0000)
struct OSCManager_OSCAddressPopContainers final
{
public:
	struct FOSCAddress                            Address;                                           // 0x0000(0x0028)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumContainers;                                     // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         ReturnValue;                                       // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCManager_OSCAddressPopContainers;

// Function OSC.OSCManager.OSCAddressPushContainer
// 0x0060 (0x0060 - 0x0000)
struct OSCManager_OSCAddressPushContainer final
{
public:
	struct FOSCAddress                            Address;                                           // 0x0000(0x0028)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Container;                                         // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOSCAddress                            ReturnValue;                                       // 0x0038(0x0028)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCManager_OSCAddressPushContainer;

// Function OSC.OSCManager.OSCAddressPushContainers
// 0x0060 (0x0060 - 0x0000)
struct OSCManager_OSCAddressPushContainers final
{
public:
	struct FOSCAddress                            Address;                                           // 0x0000(0x0028)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         Containers;                                        // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FOSCAddress                            ReturnValue;                                       // 0x0038(0x0028)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCManager_OSCAddressPushContainers;

// Function OSC.OSCManager.OSCAddressRemoveContainers
// 0x0058 (0x0058 - 0x0000)
struct OSCManager_OSCAddressRemoveContainers final
{
public:
	struct FOSCAddress                            Address;                                           // 0x0000(0x0028)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x002C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOSCAddress                            ReturnValue;                                       // 0x0030(0x0028)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCManager_OSCAddressRemoveContainers;

// Function OSC.OSCManager.SetOSCAddressMethod
// 0x0060 (0x0060 - 0x0000)
struct OSCManager_SetOSCAddressMethod final
{
public:
	struct FOSCAddress                            Address;                                           // 0x0000(0x0028)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Method;                                            // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOSCAddress                            ReturnValue;                                       // 0x0038(0x0028)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCManager_SetOSCAddressMethod;

// Function OSC.OSCManager.SetOSCMessageAddress
// 0x0048 (0x0048 - 0x0000)
struct OSCManager_SetOSCMessageAddress final
{
public:
	struct FOSCMessage                            Message;                                           // 0x0000(0x0010)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FOSCAddress                            Address;                                           // 0x0010(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOSCMessage                            ReturnValue;                                       // 0x0038(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCManager_SetOSCMessageAddress;

// Function OSC.OSCServer.AddAllowlistedClient
// 0x0010 (0x0010 - 0x0000)
struct OSCServer_AddAllowlistedClient final
{
public:
	class FString                                 IPAddress;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCServer_AddAllowlistedClient;

// Function OSC.OSCServer.BindEventToOnOSCAddressPatternMatchesPath
// 0x0038 (0x0038 - 0x0000)
struct OSCServer_BindEventToOnOSCAddressPatternMatchesPath final
{
public:
	struct FOSCAddress                            OSCAddressPattern;                                 // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FOSCAddress& AddressPattern, const struct FOSCMessage& Message, const class FString& IPAddress, int32 Port)> Event; // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCServer_BindEventToOnOSCAddressPatternMatchesPath;

// Function OSC.OSCServer.RemoveAllowlistedClient
// 0x0010 (0x0010 - 0x0000)
struct OSCServer_RemoveAllowlistedClient final
{
public:
	class FString                                 IPAddress;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCServer_RemoveAllowlistedClient;

// Function OSC.OSCServer.SetAddress
// 0x0018 (0x0018 - 0x0000)
struct OSCServer_SetAddress final
{
public:
	class FString                                 ReceiveIPAddress;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Port;                                              // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OSCServer_SetAddress;

// Function OSC.OSCServer.SetAllowlistClientsEnabled
// 0x0001 (0x0001 - 0x0000)
struct OSCServer_SetAllowlistClientsEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCServer_SetAllowlistClientsEnabled;

// Function OSC.OSCServer.SetMulticastLoopback
// 0x0001 (0x0001 - 0x0000)
struct OSCServer_SetMulticastLoopback final
{
public:
	bool                                          bMulticastLoopback;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCServer_SetMulticastLoopback;

// Function OSC.OSCServer.UnbindAllEventsFromOnOSCAddressPatternMatchesPath
// 0x0028 (0x0028 - 0x0000)
struct OSCServer_UnbindAllEventsFromOnOSCAddressPatternMatchesPath final
{
public:
	struct FOSCAddress                            OSCAddressPattern;                                 // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCServer_UnbindAllEventsFromOnOSCAddressPatternMatchesPath;

// Function OSC.OSCServer.UnbindEventFromOnOSCAddressPatternMatchesPath
// 0x0038 (0x0038 - 0x0000)
struct OSCServer_UnbindEventFromOnOSCAddressPatternMatchesPath final
{
public:
	struct FOSCAddress                            OSCAddressPattern;                                 // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FOSCAddress& AddressPattern, const struct FOSCMessage& Message, const class FString& IPAddress, int32 Port)> Event; // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCServer_UnbindEventFromOnOSCAddressPatternMatchesPath;

// Function OSC.OSCServer.GetAllowlistedClients
// 0x0050 (0x0050 - 0x0000)
struct OSCServer_GetAllowlistedClients final
{
public:
	TSet<class FString>                           ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCServer_GetAllowlistedClients;

// Function OSC.OSCServer.GetBoundOSCAddressPatterns
// 0x0010 (0x0010 - 0x0000)
struct OSCServer_GetBoundOSCAddressPatterns final
{
public:
	TArray<struct FOSCAddress>                    ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCServer_GetBoundOSCAddressPatterns;

// Function OSC.OSCServer.GetIpAddress
// 0x0018 (0x0018 - 0x0000)
struct OSCServer_GetIpAddress final
{
public:
	bool                                          bIncludePort;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCServer_GetIpAddress;

// Function OSC.OSCServer.GetMulticastLoopback
// 0x0001 (0x0001 - 0x0000)
struct OSCServer_GetMulticastLoopback final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCServer_GetMulticastLoopback;

// Function OSC.OSCServer.GetPort
// 0x0004 (0x0004 - 0x0000)
struct OSCServer_GetPort final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCServer_GetPort;

// Function OSC.OSCServer.IsActive
// 0x0001 (0x0001 - 0x0000)
struct OSCServer_IsActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OSCServer_IsActive;

}

