#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OSC

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct OSC.OSCMessage
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FOSCMessage final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FOSCMessage;

// ScriptStruct OSC.OSCAddress
// 0x0028 (0x0028 - 0x0000)
struct FOSCAddress final
{
public:
	TArray<class FString>                         Containers;                                        // 0x0000(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	class FString                                 Method;                                            // 0x0010(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_20[0x8];                                       // 0x0020(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FOSCAddress;

// ScriptStruct OSC.OSCBundle
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FOSCBundle final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FOSCBundle;

}

