#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SeqPerformer_PlayerWuKong

#include "Basic.hpp"

#include "b1_Managed_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SeqPerformer_PlayerWuKong.SeqPerformer_PlayerWuKong_C
// 0x0040 (0x0380 - 0x0340)
class ASeqPerformer_PlayerWuKong_C final : public ABGUPerformerActorCS
{
public:
	class UStaticMeshComponent*                   head_hair;                                         // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 bodypart_head;                                     // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 bodypart_arm;                                      // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 bodypart_foot;                                     // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 bodypart_upwear;                                   // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 bodypart_weapon;                                   // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 bodypart_weiba;                                    // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 bodypart_hulu;                                     // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SeqPerformer_PlayerWuKong_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SeqPerformer_PlayerWuKong_C")
	}
	static class ASeqPerformer_PlayerWuKong_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASeqPerformer_PlayerWuKong_C>();
	}
};
DUMPER7_ASSERTS_ASeqPerformer_PlayerWuKong_C;

}

