#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Shadow_Parameters

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Shadow_Parameters.Shadow_Parameters
// 0x0270 (0x0270 - 0x0000)
struct FShadow_Parameters final
{
public:
	class FString                                 EnableShadow_16_42E314114DF52DDA1F746998967D0D69;  // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 EvaluateMaterialsinShadow_17_728A35714A2D2CE2BB782C87F8EDF254; // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ShadowEnableTwoSidedGeometry_18_E4F0F479419BF5462B8CA386C52019CC; // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ShadowSPP_19_222F23EF4151A938C7D877B0D90F3255;     // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ShadowDenoiserMaxBatchSize_21_A4511D17403925B727BEE6BE72A868F8; // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ShadowsSupportTranslucency_51_569C8F954113622FFC40F5B0308485F2; // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 SupportLightFunction_28_D1DCAE474964239358DA70AD73C35624; // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 LightChannelSupport_30_0503581A4B0BF0D27C6B678786D81196; // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Per_LightShadowCasting_32_119CD88B437AD7F2A694BEBFF9DAFFF7; // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 EnableVolumetricShadow_35_DF3AEAC645A1EE6B1D68F1A045EB5ACF; // 0x0090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ShadowsLODTransitionStart_55_B585CA5A498907A43C39F28E62A9DE7D; // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ShadowsLODTransitionEnd_56_3F000C594E373DD3FA646A87A2925A7D; // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ShadowCSMMaxCascade_59_A529B8084F999ABBA92452AAC23F28E4; // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ContactShadow_61_BBD754AF4DCC5DD126705B8E5E27D9E7; // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ShadowsAcceptFirstHit_64_8A92CAF74AF97AE6213DBCB602D7C167; // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 NaniteShadowModeHybirdModeDepthThreshold_78_40C9F10245D06820C8A824BFD16A7ED9; // 0x00F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 NaniteShadowModeHybirdModeRayTraceNear_79_59C6E6C94E80B16AFC61858BDFD332B9; // 0x0100(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ShadowsAvoidSelfIntersectionTraceDistance_84_DC17290F419FAF0519E4B995D41F88E2; // 0x0110(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ShadowsSupportTwoSidedFoliage_86_80833D7A4CA753046DFD12B679555091; // 0x0120(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ShadowsUseTraceRayInline_89_427D5807425436F2BC116A92D75D0E5C; // 0x0130(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 GenerateRTSceneDepth_95_D0BEE39F4DA7094AC8D653AC70078778; // 0x0140(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 LightingMaxLights_96_B4BA51CC4E4FD77B5CC3919DB591828D; // 0x0150(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 LightingMaxShadowLights_97_A258AB164DAEB2F5799A72BFEC1BEA25; // 0x0160(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 LightingObeyShadows_98_F595261B460230DE4480ACB1F765B80D; // 0x0170(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 PrioritizeDirectional_104_D35D3899473D1557A11472AFB56998D5; // 0x0180(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ShadowMaxLights_105_DB1FBF6D4BED3D0674251CB9AD27F069; // 0x0190(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ShadowMaxDenoisedLights_106_557E02334641EA07DF3256BF3B5B6F80; // 0x01A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ShadowFallbackToSharp_107_AA44FEA54E08488AD4660BBA750DDAF7; // 0x01B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ShadowMaxBatchSize_110_36A01EF946D738B22F551586D6B88377; // 0x01C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 RTSceneDepthTolerance_113_8A5587864FD9C77B487F789A6824FA60; // 0x01D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ShadowsPointLightMode_116_FEF0CF4E498EFD6C6141F895B0325CF1; // 0x01E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 FoliageUseRTDepthInRTPasses_129_9FA431B4459DE434452A6CA3E5D81241; // 0x01F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 NaniteDepthUseTraceRayInline_122_B6E29F6644722C3430D961A363B07020; // 0x0200(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 RTShadowsMode_125_F5BA06A545836A1EB67A5AA8156CA0DD; // 0x0210(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 HeterogeneousVolumesRayTracedShadowMode_128_0928BD184D76AB720953D8917C60BAB9; // 0x0220(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 DirectionalFakeHairSurfaceDensity_132_E0B683784875F7C431DC0AA295682765; // 0x0230(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 HybridInsetShadow_135_48065E7E47830917D0CA689EEB9CD5C4; // 0x0240(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ContactShadowsPatchRTShadow_138_0D3E40C14EF76E9F0D0A04B13D279388; // 0x0250(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 MaxPatchContactShadowLength_141_52B2023D4B83F3F8A72C8AB9259F7D9B; // 0x0260(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FShadow_Parameters;

}

