#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SimpleCharts

#include "Basic.hpp"

#include "SimpleCharts_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class SimpleCharts.ChartBase
// 0x01E8 (0x0318 - 0x0130)
class UChartBase : public UWidget
{
public:
	bool                                          useDirtyRect;                                      // 0x0130(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EChartTheme                                   Theme;                                             // 0x0131(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AxisStyleWithTheme;                                // 0x0132(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_133[0x5];                                      // 0x0133(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 title_text;                                        // 0x0138(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          title_show;                                        // 0x0148(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	Eposition                                     title_position;                                    // 0x0149(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14A[0x2];                                      // 0x014A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         title_fontSize;                                    // 0x014C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 title_color;                                       // 0x0150(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          legend_show;                                       // 0x0154(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	Eposition                                     legend_position;                                   // 0x0155(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOrient                                       legend_orient;                                     // 0x0156(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_157[0x1];                                      // 0x0157(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 legend_color;                                      // 0x0158(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         legend_fontSize;                                   // 0x015C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         AxisData;                                          // 0x0160(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          IsXAxis;                                           // 0x0170(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          boundaryGap;                                       // 0x0171(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_172[0x6];                                      // 0x0172(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FaxisLabel                             XaxisLabel;                                        // 0x0178(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FLineStyle                             XaxisLine;                                         // 0x01A0(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FLineStyle                             XsplitLine;                                        // 0x01B0(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FaxisLabel                             YaxisLabel;                                        // 0x01C0(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FLineStyle                             YaxisLine;                                         // 0x01E8(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FLineStyle                             YsplitLine;                                        // 0x01F8(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	ETooltipType                                  tooltip_type;                                      // 0x0208(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	SimpleCharts::ETriggerType                    tooltip_trigger;                                   // 0x0209(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20A[0x2];                                      // 0x020A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 text_color;                                        // 0x020C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 tip_backgroundColor;                               // 0x0210(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          use_custom_color;                                  // 0x0214(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_215[0x3];                                      // 0x0215(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FColor>                         custom_color;                                      // 0x0218(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_228[0xF0];                                     // 0x0228(0x00F0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetAnim(bool Active);
	void SetAxis(bool XAxis, const TArray<class FString>& Axis_Data);
	void SetCustomColor(bool Active, const TArray<struct FColor>& custom_color_0);
	void SetTheme(EChartTheme ChartTheme, bool Axis_Style_With_Theme);
	void SetTitle(const class FString& Text, bool show, Eposition position, int32 FontSize, const struct FLinearColor& Color);
	void SetTooltipStyle(SimpleCharts::ETriggerType Trigger, ETooltipType ToolTip, const struct FLinearColor& TextColor, const struct FLinearColor& BackgroundColor);
	void SetXAxisStyle(const struct FaxisLabel& Xaxis_Label, const struct FLineStyle& Xaxis_Line, const struct FLineStyle& Xsplit_Line);
	void SetYAxisStyle(const struct FaxisLabel& Yaxis_Label, const struct FLineStyle& Yaxis_Line, const struct FLineStyle& Ysplit_Line);
	void UpdateChart();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChartBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChartBase")
	}
	static class UChartBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChartBase>();
	}
};
DUMPER7_ASSERTS_UChartBase;

// Class SimpleCharts.AreaChart
// 0x0020 (0x0338 - 0x0318)
class UAreaChart final : public UChartBase
{
public:
	TArray<struct FAreaSeries>                    Series;                                            // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_328[0x10];                                     // 0x0328(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetLegend(bool show, Eposition position, EOrient Orient, const struct FLinearColor& Color, int32 FontSize);
	void SetSeries(const TArray<struct FAreaSeries>& SeriesData);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AreaChart")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AreaChart")
	}
	static class UAreaChart* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAreaChart>();
	}
};
DUMPER7_ASSERTS_UAreaChart;

// Class SimpleCharts.BarChart
// 0x0020 (0x0338 - 0x0318)
class UBarChart final : public UChartBase
{
public:
	TArray<struct FBarSeries>                     Series;                                            // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_328[0x10];                                     // 0x0328(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetLegend(bool show, Eposition position, EOrient Orient, const struct FLinearColor& Color, int32 FontSize);
	void SetSeries(const TArray<struct FBarSeries>& SeriesData);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BarChart")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BarChart")
	}
	static class UBarChart* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBarChart>();
	}
};
DUMPER7_ASSERTS_UBarChart;

// Class SimpleCharts.ChartWebBrowser
// 0x0048 (0x0178 - 0x0130)
class UChartWebBrowser final : public UWidget
{
public:
	TMulticastInlineDelegate<void(const class FText& Text)> OnUrlChanged;                            // 0x0130(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& URL, const class FString& Frame)> OnBeforePopup; // 0x0140(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FString                                 InitialURL;                                        // 0x0150(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSupportsTransparency;                             // 0x0160(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSupportIEM;                                       // 0x0161(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_162[0x16];                                     // 0x0162(0x0016)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ExecuteJavascript(const class FString& ScriptText);
	void LoadString(const class FString& Contents, const class FString& DummyURL);
	void LoadURL(const class FString& NewURL);

	class FText GetTitleText() const;
	class FString GetUrl() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChartWebBrowser")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChartWebBrowser")
	}
	static class UChartWebBrowser* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChartWebBrowser>();
	}
};
DUMPER7_ASSERTS_UChartWebBrowser;

// Class SimpleCharts.CustomChart
// 0x0058 (0x0188 - 0x0130)
class UCustomChart final : public UWidget
{
public:
	bool                                          useDirtyRect;                                      // 0x0130(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EChartTheme                                   Theme;                                             // 0x0131(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_132[0x6];                                      // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Option;                                            // 0x0138(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_148[0x40];                                     // 0x0148(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetOption(const class FString& InOption, const class FString& OtherCode);
	void SetTheme(EChartTheme ChartTheme);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CustomChart")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CustomChart")
	}
	static class UCustomChart* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomChart>();
	}
};
DUMPER7_ASSERTS_UCustomChart;

// Class SimpleCharts.DoughnutChart
// 0x00C8 (0x03E0 - 0x0318)
class UDoughnutChart final : public UChartBase
{
public:
	uint8                                         Pad_318[0x8];                                      // 0x0318(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDoughnutSeries                        Series;                                            // 0x0320(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D0[0x10];                                     // 0x03D0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetLegend(bool show, Eposition position, EOrient Orient, const struct FLinearColor& Color, int32 FontSize);
	void SetSeries(const struct FDoughnutSeries& SeriesData);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DoughnutChart")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DoughnutChart")
	}
	static class UDoughnutChart* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDoughnutChart>();
	}
};
DUMPER7_ASSERTS_UDoughnutChart;

// Class SimpleCharts.FunnelChart
// 0x0050 (0x0368 - 0x0318)
class UFunnelChart final : public UChartBase
{
public:
	struct FfunnelSeries                          Series;                                            // 0x0318(0x0040)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_358[0x10];                                     // 0x0358(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetLegend(bool show, Eposition position, EOrient Orient, const struct FLinearColor& Color, int32 FontSize);
	void SetSeries(const struct FfunnelSeries& SeriesData);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FunnelChart")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FunnelChart")
	}
	static class UFunnelChart* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFunnelChart>();
	}
};
DUMPER7_ASSERTS_UFunnelChart;

// Class SimpleCharts.GaugeChart
// 0x0038 (0x0350 - 0x0318)
class UGaugeChart final : public UChartBase
{
public:
	struct FGaugeSeries                           Series;                                            // 0x0318(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_340[0x10];                                     // 0x0340(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetLegend(bool show, Eposition position, EOrient Orient, const struct FLinearColor& Color, int32 FontSize);
	void SetSeries(const struct FGaugeSeries& SeriesData);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GaugeChart")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GaugeChart")
	}
	static class UGaugeChart* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGaugeChart>();
	}
};
DUMPER7_ASSERTS_UGaugeChart;

// Class SimpleCharts.LineBarChart
// 0x0020 (0x0338 - 0x0318)
class ULineBarChart final : public UChartBase
{
public:
	TArray<struct FLineBarSeries>                 Series;                                            // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_328[0x10];                                     // 0x0328(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetLegend(bool show, Eposition position, EOrient Orient, const struct FLinearColor& Color, int32 FontSize);
	void SetSeries(const TArray<struct FLineBarSeries>& SeriesData);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LineBarChart")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LineBarChart")
	}
	static class ULineBarChart* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULineBarChart>();
	}
};
DUMPER7_ASSERTS_ULineBarChart;

// Class SimpleCharts.LineChart
// 0x0020 (0x0338 - 0x0318)
class ULineChart final : public UChartBase
{
public:
	TArray<struct FLineSeries>                    Series;                                            // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_328[0x10];                                     // 0x0328(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetLegend(bool show, Eposition position, EOrient Orient, const struct FLinearColor& Color, int32 FontSize);
	void SetSeries(const TArray<struct FLineSeries>& SeriesData);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LineChart")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LineChart")
	}
	static class ULineChart* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULineChart>();
	}
};
DUMPER7_ASSERTS_ULineChart;

// Class SimpleCharts.PieChart
// 0x00B8 (0x03D0 - 0x0318)
class UPieChart final : public UChartBase
{
public:
	uint8                                         Pad_318[0x8];                                      // 0x0318(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPieSeries                             Series;                                            // 0x0320(0x00A0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C0[0x10];                                     // 0x03C0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetLegend(bool show, Eposition position, EOrient Orient, const struct FLinearColor& Color, int32 FontSize);
	void SetSeries(const struct FPieSeries& SeriesData);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PieChart")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PieChart")
	}
	static class UPieChart* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPieChart>();
	}
};
DUMPER7_ASSERTS_UPieChart;

// Class SimpleCharts.RadarChart
// 0x00A8 (0x03C0 - 0x0318)
class URadarChart final : public UChartBase
{
public:
	uint8                                         Pad_318[0x8];                                      // 0x0318(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRadarSeries                           Series;                                            // 0x0320(0x0060)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRadar                                 Radar;                                             // 0x0380(0x0020)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A0[0x20];                                     // 0x03A0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetLegend(bool show, Eposition position, EOrient Orient, const struct FLinearColor& Color, int32 FontSize);
	void SetRadar(const struct FRadar& RadarData);
	void SetSeries(const struct FRadarSeries& SeriesData);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RadarChart")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RadarChart")
	}
	static class URadarChart* GetDefaultObj()
	{
		return GetDefaultObjImpl<URadarChart>();
	}
};
DUMPER7_ASSERTS_URadarChart;

// Class SimpleCharts.SankeyChart
// 0x0088 (0x03A0 - 0x0318)
class USankeyChart final : public UChartBase
{
public:
	uint8                                         Pad_318[0x8];                                      // 0x0318(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSankeySeries                          Series;                                            // 0x0320(0x0070)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_390[0x10];                                     // 0x0390(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetLegend(bool show, Eposition position, EOrient Orient, const struct FLinearColor& Color, int32 FontSize);
	void SetSeries(const struct FSankeySeries& SeriesData);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SankeyChart")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SankeyChart")
	}
	static class USankeyChart* GetDefaultObj()
	{
		return GetDefaultObjImpl<USankeyChart>();
	}
};
DUMPER7_ASSERTS_USankeyChart;

// Class SimpleCharts.ScatterChart
// 0x0020 (0x0338 - 0x0318)
class UScatterChart final : public UChartBase
{
public:
	TArray<struct FScatterSeries>                 Series;                                            // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_328[0x10];                                     // 0x0328(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetLegend(bool show, Eposition position, EOrient Orient, const struct FLinearColor& Color, int32 FontSize);
	void SetSeries(const TArray<struct FScatterSeries>& SeriesData);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ScatterChart")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ScatterChart")
	}
	static class UScatterChart* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScatterChart>();
	}
};
DUMPER7_ASSERTS_UScatterChart;

}

