#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SM_HYS_LSG_DengZuo_01

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SM_HYS_LSG_DengZuo_01.SM_HYS_LSG_DengZuo_01_C
// 0x0028 (0x02B0 - 0x0288)
class ASM_HYS_LSG_DengZuo_01_C final : public AActor
{
public:
	class UStaticMeshComponent*                   SM_HYS_LSG_DengZuo_01_A2;                          // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HYS_LSG_DengZuo_01_A1;                          // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HYS_LSG_DengZuo_01;                             // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HYS_LSG_PaiFang_01_B;                           // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SM_HYS_LSG_DengZuo_01_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SM_HYS_LSG_DengZuo_01_C")
	}
	static class ASM_HYS_LSG_DengZuo_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASM_HYS_LSG_DengZuo_01_C>();
	}
};
DUMPER7_ASSERTS_ASM_HYS_LSG_DengZuo_01_C;

}

