#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMSystem

#include "Basic.hpp"

#include "SMSystem_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SMSystem.SMNodeInstance.GetContext
// 0x0008 (0x0008 - 0x0000)
struct SMNodeInstance_GetContext final
{
public:
	class UObject*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMNodeInstance_GetContext;

// Function SMSystem.SMNodeInstance.GetGuid
// 0x0010 (0x0010 - 0x0000)
struct SMNodeInstance_GetGuid final
{
public:
	struct FGuid                                  ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMNodeInstance_GetGuid;

// Function SMSystem.SMNodeInstance.GetNetworkInterface
// 0x0010 (0x0010 - 0x0000)
struct SMNodeInstance_GetNetworkInterface final
{
public:
	TScriptInterface<class ISMStateMachineNetworkedInterface> ReturnValue;                           // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMNodeInstance_GetNetworkInterface;

// Function SMSystem.SMNodeInstance.GetNodeName
// 0x0010 (0x0010 - 0x0000)
struct SMNodeInstance_GetNodeName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMNodeInstance_GetNodeName;

// Function SMSystem.SMNodeInstance.GetOwningStateMachineNodeInstance
// 0x0008 (0x0008 - 0x0000)
struct SMNodeInstance_GetOwningStateMachineNodeInstance final
{
public:
	class USMStateMachineInstance*                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMNodeInstance_GetOwningStateMachineNodeInstance;

// Function SMSystem.SMNodeInstance.GetStateMachineInstance
// 0x0010 (0x0010 - 0x0000)
struct SMNodeInstance_GetStateMachineInstance final
{
public:
	bool                                          bTopMostInstance;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USMInstance*                            ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMNodeInstance_GetStateMachineInstance;

// Function SMSystem.SMNodeInstance.GetTimeInState
// 0x0004 (0x0004 - 0x0000)
struct SMNodeInstance_GetTimeInState final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMNodeInstance_GetTimeInState;

// Function SMSystem.SMNodeInstance.HasUpdated
// 0x0001 (0x0001 - 0x0000)
struct SMNodeInstance_HasUpdated final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMNodeInstance_HasUpdated;

// Function SMSystem.SMNodeInstance.IsActive
// 0x0001 (0x0001 - 0x0000)
struct SMNodeInstance_IsActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMNodeInstance_IsActive;

// Function SMSystem.SMNodeInstance.IsInEndState
// 0x0001 (0x0001 - 0x0000)
struct SMNodeInstance_IsInEndState final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMNodeInstance_IsInEndState;

// Function SMSystem.SMInstance.EvaluateAndFindTransitionChain
// 0x0028 (0x0028 - 0x0000)
struct SMInstance_EvaluateAndFindTransitionChain final
{
public:
	class USMTransitionInstance*                  InFirstTransitionInstance;                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USMTransitionInstance*>          OutTransitionChain;                                // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	class USMStateInstance_Base*                  OutDestinationState;                               // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRequirePreviousStateActive;                       // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0021(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SMInstance_EvaluateAndFindTransitionChain;

// Function SMSystem.SMInstance.EvaluateAndTakeTransitionChain
// 0x0010 (0x0010 - 0x0000)
struct SMInstance_EvaluateAndTakeTransitionChain final
{
public:
	class USMTransitionInstance*                  InFirstTransitionInstance;                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SMInstance_EvaluateAndTakeTransitionChain;

// Function SMSystem.SMInstance.GetGuidRedirectMap
// 0x0050 (0x0050 - 0x0000)
struct SMInstance_GetGuidRedirectMap final
{
public:
	TMap<struct FGuid, struct FGuid>              ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_GetGuidRedirectMap;

// Function SMSystem.SMInstance.GetMasterReferenceOwner
// 0x0008 (0x0008 - 0x0000)
struct SMInstance_GetMasterReferenceOwner final
{
public:
	class USMInstance*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_GetMasterReferenceOwner;

// Function SMSystem.SMInstance.GetPrimaryReferenceOwner
// 0x0008 (0x0008 - 0x0000)
struct SMInstance_GetPrimaryReferenceOwner final
{
public:
	class USMInstance*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_GetPrimaryReferenceOwner;

// Function SMSystem.SMInstance.Initialize
// 0x0008 (0x0008 - 0x0000)
struct SMInstance_Initialize final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_Initialize;

// Function SMSystem.SMInstance.Internal_EvaluateAndTakeTransitionChainByGuid
// 0x0014 (0x0014 - 0x0000)
struct SMInstance_Internal_EvaluateAndTakeTransitionChainByGuid final
{
public:
	struct FGuid                                  PathGuid;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SMInstance_Internal_EvaluateAndTakeTransitionChainByGuid;

// Function SMSystem.SMInstance.Internal_EventCleanup
// 0x0010 (0x0010 - 0x0000)
struct SMInstance_Internal_EventCleanup final
{
public:
	struct FGuid                                  PathGuid;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_Internal_EventCleanup;

// Function SMSystem.SMInstance.Internal_Update
// 0x0004 (0x0004 - 0x0000)
struct SMInstance_Internal_Update final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_Internal_Update;

// Function SMSystem.SMInstance.K2_TryGetNetworkInterface
// 0x0018 (0x0018 - 0x0000)
struct SMInstance_K2_TryGetNetworkInterface final
{
public:
	TScriptInterface<class ISMStateMachineNetworkedInterface> Interface;                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsValid;                                          // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SMInstance_K2_TryGetNetworkInterface;

// Function SMSystem.SMInstance.LoadFromMultipleStates
// 0x0018 (0x0018 - 0x0000)
struct SMInstance_LoadFromMultipleStates final
{
public:
	TArray<struct FGuid>                          FromGuids;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bNotify;                                           // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SMInstance_LoadFromMultipleStates;

// Function SMSystem.SMInstance.LoadFromState
// 0x0014 (0x0014 - 0x0000)
struct SMInstance_LoadFromState final
{
public:
	struct FGuid                                  FromGuid;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllParents;                                       // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNotify;                                           // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SMInstance_LoadFromState;

// Function SMSystem.SMInstance.OnStateMachineInitialStateLoaded
// 0x0010 (0x0010 - 0x0000)
struct SMInstance_OnStateMachineInitialStateLoaded final
{
public:
	struct FGuid                                  StateGuid;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_OnStateMachineInitialStateLoaded;

// Function SMSystem.SMInstance.OnStateMachineStateChanged
// 0x0100 (0x0100 - 0x0000)
struct SMInstance_OnStateMachineStateChanged final
{
public:
	struct FSMStateInfo                           ToState;                                           // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FSMStateInfo                           FromState;                                         // 0x0080(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_OnStateMachineStateChanged;

// Function SMSystem.SMInstance.OnStateMachineStateStarted
// 0x0080 (0x0080 - 0x0000)
struct SMInstance_OnStateMachineStateStarted final
{
public:
	struct FSMStateInfo                           State;                                             // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_OnStateMachineStateStarted;

// Function SMSystem.SMInstance.OnStateMachineTransitionTaken
// 0x0098 (0x0098 - 0x0000)
struct SMInstance_OnStateMachineTransitionTaken final
{
public:
	struct FSMTransitionInfo                      Transition;                                        // 0x0000(0x0098)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_OnStateMachineTransitionTaken;

// Function SMSystem.SMInstance.OnStateMachineUpdate
// 0x0004 (0x0004 - 0x0000)
struct SMInstance_OnStateMachineUpdate final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_OnStateMachineUpdate;

// Function SMSystem.SMInstance.RunUpdateAsReference
// 0x0004 (0x0004 - 0x0000)
struct SMInstance_RunUpdateAsReference final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_RunUpdateAsReference;

// Function SMSystem.SMInstance.SetAutoManageTime
// 0x0001 (0x0001 - 0x0000)
struct SMInstance_SetAutoManageTime final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_SetAutoManageTime;

// Function SMSystem.SMInstance.SetCanEverTick
// 0x0001 (0x0001 - 0x0000)
struct SMInstance_SetCanEverTick final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_SetCanEverTick;

// Function SMSystem.SMInstance.SetCanTickWhenPaused
// 0x0001 (0x0001 - 0x0000)
struct SMInstance_SetCanTickWhenPaused final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_SetCanTickWhenPaused;

// Function SMSystem.SMInstance.SetContext
// 0x0008 (0x0008 - 0x0000)
struct SMInstance_SetContext final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_SetContext;

// Function SMSystem.SMInstance.SetGuidRedirectMap
// 0x0050 (0x0050 - 0x0000)
struct SMInstance_SetGuidRedirectMap final
{
public:
	TMap<struct FGuid, struct FGuid>              InGuidMap;                                         // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_SetGuidRedirectMap;

// Function SMSystem.SMInstance.SetStateHistoryMaxCount
// 0x0004 (0x0004 - 0x0000)
struct SMInstance_SetStateHistoryMaxCount final
{
public:
	int32                                         NewSize;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_SetStateHistoryMaxCount;

// Function SMSystem.SMInstance.SetStateMachineClass
// 0x0008 (0x0008 - 0x0000)
struct SMInstance_SetStateMachineClass final
{
public:
	TSubclassOf<class USMStateMachineInstance>    NewStateMachineClass;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_SetStateMachineClass;

// Function SMSystem.SMInstance.SetStopOnEndState
// 0x0001 (0x0001 - 0x0000)
struct SMInstance_SetStopOnEndState final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_SetStopOnEndState;

// Function SMSystem.SMInstance.SetTickBeforeBeginPlay
// 0x0001 (0x0001 - 0x0000)
struct SMInstance_SetTickBeforeBeginPlay final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_SetTickBeforeBeginPlay;

// Function SMSystem.SMInstance.SetTickInterval
// 0x0004 (0x0004 - 0x0000)
struct SMInstance_SetTickInterval final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_SetTickInterval;

// Function SMSystem.SMInstance.SetTickOnManualUpdate
// 0x0001 (0x0001 - 0x0000)
struct SMInstance_SetTickOnManualUpdate final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_SetTickOnManualUpdate;

// Function SMSystem.SMInstance.StartWithNewContext
// 0x0008 (0x0008 - 0x0000)
struct SMInstance_StartWithNewContext final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_StartWithNewContext;

// Function SMSystem.SMInstance.SwitchActiveState
// 0x0010 (0x0010 - 0x0000)
struct SMInstance_SwitchActiveState final
{
public:
	class USMStateInstance_Base*                  NewStateInstance;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDeactivateOtherStates;                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SMInstance_SwitchActiveState;

// Function SMSystem.SMInstance.SwitchActiveStateByQualifiedName
// 0x0018 (0x0018 - 0x0000)
struct SMInstance_SwitchActiveStateByQualifiedName final
{
public:
	class FString                                 InFullPath;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDeactivateOtherStates;                            // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SMInstance_SwitchActiveStateByQualifiedName;

// Function SMSystem.SMInstance.TakeTransitionChain
// 0x0018 (0x0018 - 0x0000)
struct SMInstance_TakeTransitionChain final
{
public:
	TArray<class USMTransitionInstance*>          InTransitionChain;                                 // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SMInstance_TakeTransitionChain;

// Function SMSystem.SMInstance.Tick
// 0x0004 (0x0004 - 0x0000)
struct SMInstance_Tick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_Tick;

// Function SMSystem.SMInstance.Update
// 0x0004 (0x0004 - 0x0000)
struct SMInstance_Update final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_Update;

// Function SMSystem.SMInstance.AreInitialStatesSetFromLoad
// 0x0001 (0x0001 - 0x0000)
struct SMInstance_AreInitialStatesSetFromLoad final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_AreInitialStatesSetFromLoad;

// Function SMSystem.SMInstance.CanAutoManageTime
// 0x0001 (0x0001 - 0x0000)
struct SMInstance_CanAutoManageTime final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_CanAutoManageTime;

// Function SMSystem.SMInstance.CanEverTick
// 0x0001 (0x0001 - 0x0000)
struct SMInstance_CanEverTick final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_CanEverTick;

// Function SMSystem.SMInstance.CanTickOnManualUpdate
// 0x0001 (0x0001 - 0x0000)
struct SMInstance_CanTickOnManualUpdate final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_CanTickOnManualUpdate;

// Function SMSystem.SMInstance.GetActiveStateGuid
// 0x0010 (0x0010 - 0x0000)
struct SMInstance_GetActiveStateGuid final
{
public:
	struct FGuid                                  ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_GetActiveStateGuid;

// Function SMSystem.SMInstance.GetActiveStateInstance
// 0x0010 (0x0010 - 0x0000)
struct SMInstance_GetActiveStateInstance final
{
public:
	bool                                          bCheckNested;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USMStateInstance_Base*                  ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_GetActiveStateInstance;

// Function SMSystem.SMInstance.GetActiveStateName
// 0x0010 (0x0010 - 0x0000)
struct SMInstance_GetActiveStateName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_GetActiveStateName;

// Function SMSystem.SMInstance.GetAllActiveStateGuids
// 0x0010 (0x0010 - 0x0000)
struct SMInstance_GetAllActiveStateGuids final
{
public:
	TArray<struct FGuid>                          ActiveGuids;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_GetAllActiveStateGuids;

// Function SMSystem.SMInstance.GetAllActiveStateInstances
// 0x0010 (0x0010 - 0x0000)
struct SMInstance_GetAllActiveStateInstances final
{
public:
	TArray<class USMStateInstance_Base*>          ActiveStateInstances;                              // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_GetAllActiveStateInstances;

// Function SMSystem.SMInstance.GetAllCurrentStateGuids
// 0x0010 (0x0010 - 0x0000)
struct SMInstance_GetAllCurrentStateGuids final
{
public:
	TArray<struct FGuid>                          ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_GetAllCurrentStateGuids;

// Function SMSystem.SMInstance.GetAllReferencedInstances
// 0x0018 (0x0018 - 0x0000)
struct SMInstance_GetAllReferencedInstances final
{
public:
	bool                                          bIncludeChildren;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USMInstance*>                    ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_GetAllReferencedInstances;

// Function SMSystem.SMInstance.GetAllStateInstances
// 0x0010 (0x0010 - 0x0000)
struct SMInstance_GetAllStateInstances final
{
public:
	TArray<class USMStateInstance_Base*>          StateInstances;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_GetAllStateInstances;

// Function SMSystem.SMInstance.GetAllTransitionInstances
// 0x0010 (0x0010 - 0x0000)
struct SMInstance_GetAllTransitionInstances final
{
public:
	TArray<class USMTransitionInstance*>          TransitionInstances;                               // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_GetAllTransitionInstances;

// Function SMSystem.SMInstance.GetComponentOwner
// 0x0008 (0x0008 - 0x0000)
struct SMInstance_GetComponentOwner final
{
public:
	class USMStateMachineComponent*               ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_GetComponentOwner;

// Function SMSystem.SMInstance.GetContext
// 0x0008 (0x0008 - 0x0000)
struct SMInstance_GetContext final
{
public:
	class UObject*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_GetContext;

// Function SMSystem.SMInstance.GetNestedActiveStateGuid
// 0x0010 (0x0010 - 0x0000)
struct SMInstance_GetNestedActiveStateGuid final
{
public:
	struct FGuid                                  ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_GetNestedActiveStateGuid;

// Function SMSystem.SMInstance.GetNestedActiveStateName
// 0x0010 (0x0010 - 0x0000)
struct SMInstance_GetNestedActiveStateName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_GetNestedActiveStateName;

// Function SMSystem.SMInstance.GetNetworkInterface
// 0x0010 (0x0010 - 0x0000)
struct SMInstance_GetNetworkInterface final
{
public:
	TScriptInterface<class ISMStateMachineNetworkedInterface> ReturnValue;                           // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_GetNetworkInterface;

// Function SMSystem.SMInstance.GetNodeInstanceByGuid
// 0x0018 (0x0018 - 0x0000)
struct SMInstance_GetNodeInstanceByGuid final
{
public:
	struct FGuid                                  Guid;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USMNodeInstance*                        ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_GetNodeInstanceByGuid;

// Function SMSystem.SMInstance.GetReferencedInstanceByGuid
// 0x0018 (0x0018 - 0x0000)
struct SMInstance_GetReferencedInstanceByGuid final
{
public:
	struct FGuid                                  Guid;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USMInstance*                            ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_GetReferencedInstanceByGuid;

// Function SMSystem.SMInstance.GetReferenceOwner
// 0x0008 (0x0008 - 0x0000)
struct SMInstance_GetReferenceOwner final
{
public:
	class USMInstance*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_GetReferenceOwner;

// Function SMSystem.SMInstance.GetRootStateMachineInstance
// 0x0008 (0x0008 - 0x0000)
struct SMInstance_GetRootStateMachineInstance final
{
public:
	class USMStateMachineInstance*                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_GetRootStateMachineInstance;

// Function SMSystem.SMInstance.GetRootStateMachineNodeInstance
// 0x0008 (0x0008 - 0x0000)
struct SMInstance_GetRootStateMachineNodeInstance final
{
public:
	class USMStateMachineInstance*                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_GetRootStateMachineNodeInstance;

// Function SMSystem.SMInstance.GetSingleActiveStateGuid
// 0x0014 (0x0014 - 0x0000)
struct SMInstance_GetSingleActiveStateGuid final
{
public:
	bool                                          bCheckNested;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  ReturnValue;                                       // 0x0004(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_GetSingleActiveStateGuid;

// Function SMSystem.SMInstance.GetSingleActiveStateInstance
// 0x0010 (0x0010 - 0x0000)
struct SMInstance_GetSingleActiveStateInstance final
{
public:
	bool                                          bCheckNested;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USMStateInstance_Base*                  ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_GetSingleActiveStateInstance;

// Function SMSystem.SMInstance.GetStateHistory
// 0x0010 (0x0010 - 0x0000)
struct SMInstance_GetStateHistory final
{
public:
	TArray<struct FSMStateHistory>                ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_GetStateHistory;

// Function SMSystem.SMInstance.GetStateHistoryMaxCount
// 0x0004 (0x0004 - 0x0000)
struct SMInstance_GetStateHistoryMaxCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_GetStateHistoryMaxCount;

// Function SMSystem.SMInstance.GetStateInstanceByGuid
// 0x0018 (0x0018 - 0x0000)
struct SMInstance_GetStateInstanceByGuid final
{
public:
	struct FGuid                                  Guid;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USMStateInstance_Base*                  ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_GetStateInstanceByGuid;

// Function SMSystem.SMInstance.GetStateInstanceByQualifiedName
// 0x0018 (0x0018 - 0x0000)
struct SMInstance_GetStateInstanceByQualifiedName final
{
public:
	class FString                                 InFullPath;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USMStateInstance_Base*                  ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_GetStateInstanceByQualifiedName;

// Function SMSystem.SMInstance.GetStateMachineClass
// 0x0008 (0x0008 - 0x0000)
struct SMInstance_GetStateMachineClass final
{
public:
	TSubclassOf<class USMStateMachineInstance>    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_GetStateMachineClass;

// Function SMSystem.SMInstance.GetStopOnEndState
// 0x0001 (0x0001 - 0x0000)
struct SMInstance_GetStopOnEndState final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_GetStopOnEndState;

// Function SMSystem.SMInstance.GetTickInterval
// 0x0004 (0x0004 - 0x0000)
struct SMInstance_GetTickInterval final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_GetTickInterval;

// Function SMSystem.SMInstance.GetTransitionInstanceByGuid
// 0x0018 (0x0018 - 0x0000)
struct SMInstance_GetTransitionInstanceByGuid final
{
public:
	struct FGuid                                  Guid;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USMTransitionInstance*                  ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_GetTransitionInstanceByGuid;

// Function SMSystem.SMInstance.HasStarted
// 0x0001 (0x0001 - 0x0000)
struct SMInstance_HasStarted final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_HasStarted;

// Function SMSystem.SMInstance.IsActive
// 0x0001 (0x0001 - 0x0000)
struct SMInstance_IsActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_IsActive;

// Function SMSystem.SMInstance.IsInEndState
// 0x0001 (0x0001 - 0x0000)
struct SMInstance_IsInEndState final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_IsInEndState;

// Function SMSystem.SMInstance.IsInitialized
// 0x0001 (0x0001 - 0x0000)
struct SMInstance_IsInitialized final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_IsInitialized;

// Function SMSystem.SMInstance.IsTickable
// 0x0001 (0x0001 - 0x0000)
struct SMInstance_IsTickable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_IsTickable;

// Function SMSystem.SMInstance.IsTickableWhenPaused
// 0x0001 (0x0001 - 0x0000)
struct SMInstance_IsTickableWhenPaused final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMInstance_IsTickableWhenPaused;

// Function SMSystem.SMInstance.TryGetNestedActiveState
// 0x0088 (0x0088 - 0x0000)
struct SMInstance_TryGetNestedActiveState final
{
public:
	struct FSMStateInfo                           FoundState;                                        // 0x0000(0x0080)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          bSuccess;                                          // 0x0080(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SMInstance_TryGetNestedActiveState;

// Function SMSystem.SMInstance.TryGetStateInfo
// 0x0098 (0x0098 - 0x0000)
struct SMInstance_TryGetStateInfo final
{
public:
	struct FGuid                                  Guid;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSMStateInfo                           StateInfo;                                         // 0x0010(0x0080)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          bSuccess;                                          // 0x0090(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SMInstance_TryGetStateInfo;

// Function SMSystem.SMInstance.TryGetTransitionInfo
// 0x00B0 (0x00B0 - 0x0000)
struct SMInstance_TryGetTransitionInfo final
{
public:
	struct FGuid                                  Guid;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSMTransitionInfo                      TransitionInfo;                                    // 0x0010(0x0098)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          bSuccess;                                          // 0x00A8(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SMInstance_TryGetTransitionInfo;

// Function SMSystem.SMStateInstance_Base.SetActive
// 0x0003 (0x0003 - 0x0000)
struct SMStateInstance_Base_SetActive final
{
public:
	bool                                          bValue;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetAllParents;                                    // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bActivateNow;                                      // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMStateInstance_Base_SetActive;

// Function SMSystem.SMStateInstance_Base.SetAlwaysUpdate
// 0x0001 (0x0001 - 0x0000)
struct SMStateInstance_Base_SetAlwaysUpdate final
{
public:
	bool                                          bValue;                                            // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMStateInstance_Base_SetAlwaysUpdate;

// Function SMSystem.SMStateInstance_Base.SetDisableTickTransitionEvaluation
// 0x0001 (0x0001 - 0x0000)
struct SMStateInstance_Base_SetDisableTickTransitionEvaluation final
{
public:
	bool                                          bValue;                                            // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMStateInstance_Base_SetDisableTickTransitionEvaluation;

// Function SMSystem.SMStateInstance_Base.SetEvalTransitionsOnStart
// 0x0001 (0x0001 - 0x0000)
struct SMStateInstance_Base_SetEvalTransitionsOnStart final
{
public:
	bool                                          bValue;                                            // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMStateInstance_Base_SetEvalTransitionsOnStart;

// Function SMSystem.SMStateInstance_Base.SetExcludeFromAnyState
// 0x0001 (0x0001 - 0x0000)
struct SMStateInstance_Base_SetExcludeFromAnyState final
{
public:
	bool                                          bValue;                                            // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMStateInstance_Base_SetExcludeFromAnyState;

// Function SMSystem.SMStateInstance_Base.SwitchToLinkedState
// 0x0010 (0x0010 - 0x0000)
struct SMStateInstance_Base_SwitchToLinkedState final
{
public:
	class USMStateInstance_Base*                  NextStateInstance;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRequireTransitionToPass;                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bActivateNow;                                      // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000A(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SMStateInstance_Base_SwitchToLinkedState;

// Function SMSystem.SMStateInstance_Base.SwitchToLinkedStateByName
// 0x0018 (0x0018 - 0x0000)
struct SMStateInstance_Base_SwitchToLinkedStateByName final
{
public:
	class FString                                 NextStateName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRequireTransitionToPass;                          // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bActivateNow;                                      // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0012(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SMStateInstance_Base_SwitchToLinkedStateByName;

// Function SMSystem.SMStateInstance_Base.SwitchToLinkedStateByTransition
// 0x0010 (0x0010 - 0x0000)
struct SMStateInstance_Base_SwitchToLinkedStateByTransition final
{
public:
	class USMTransitionInstance*                  TransitionInstance;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRequireTransitionToPass;                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bActivateNow;                                      // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000A(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SMStateInstance_Base_SwitchToLinkedStateByTransition;

// Function SMSystem.SMStateInstance_Base.AreAllIncomingTransitionsFromAnAnyState
// 0x0001 (0x0001 - 0x0000)
struct SMStateInstance_Base_AreAllIncomingTransitionsFromAnAnyState final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMStateInstance_Base_AreAllIncomingTransitionsFromAnAnyState;

// Function SMSystem.SMStateInstance_Base.AreAllOutgoingTransitionsFromAnAnyState
// 0x0001 (0x0001 - 0x0000)
struct SMStateInstance_Base_AreAllOutgoingTransitionsFromAnAnyState final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMStateInstance_Base_AreAllOutgoingTransitionsFromAnAnyState;

// Function SMSystem.SMStateInstance_Base.GetAlwaysUpdate
// 0x0001 (0x0001 - 0x0000)
struct SMStateInstance_Base_GetAlwaysUpdate final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMStateInstance_Base_GetAlwaysUpdate;

// Function SMSystem.SMStateInstance_Base.GetDisableTickTransitionEvaluation
// 0x0001 (0x0001 - 0x0000)
struct SMStateInstance_Base_GetDisableTickTransitionEvaluation final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMStateInstance_Base_GetDisableTickTransitionEvaluation;

// Function SMSystem.SMStateInstance_Base.GetEvalTransitionsOnStart
// 0x0001 (0x0001 - 0x0000)
struct SMStateInstance_Base_GetEvalTransitionsOnStart final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMStateInstance_Base_GetEvalTransitionsOnStart;

// Function SMSystem.SMStateInstance_Base.GetExcludeFromAnyState
// 0x0001 (0x0001 - 0x0000)
struct SMStateInstance_Base_GetExcludeFromAnyState final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMStateInstance_Base_GetExcludeFromAnyState;

// Function SMSystem.SMStateInstance_Base.GetIncomingTransitions
// 0x0018 (0x0018 - 0x0000)
struct SMStateInstance_Base_GetIncomingTransitions final
{
public:
	TArray<class USMTransitionInstance*>          Transitions;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bExcludeAlwaysFalse;                               // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SMStateInstance_Base_GetIncomingTransitions;

// Function SMSystem.SMStateInstance_Base.GetNextStateByName
// 0x0018 (0x0018 - 0x0000)
struct SMStateInstance_Base_GetNextStateByName final
{
public:
	class FString                                 StateName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USMStateInstance_Base*                  ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMStateInstance_Base_GetNextStateByName;

// Function SMSystem.SMStateInstance_Base.GetNextStateByTransitionIndex
// 0x0010 (0x0010 - 0x0000)
struct SMStateInstance_Base_GetNextStateByTransitionIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USMStateInstance_Base*                  ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMStateInstance_Base_GetNextStateByTransitionIndex;

// Function SMSystem.SMStateInstance_Base.GetOutgoingTransitions
// 0x0018 (0x0018 - 0x0000)
struct SMStateInstance_Base_GetOutgoingTransitions final
{
public:
	TArray<class USMTransitionInstance*>          Transitions;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bExcludeAlwaysFalse;                               // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SMStateInstance_Base_GetOutgoingTransitions;

// Function SMSystem.SMStateInstance_Base.GetPreviousActiveState
// 0x0008 (0x0008 - 0x0000)
struct SMStateInstance_Base_GetPreviousActiveState final
{
public:
	class USMStateInstance_Base*                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMStateInstance_Base_GetPreviousActiveState;

// Function SMSystem.SMStateInstance_Base.GetPreviousActiveTransition
// 0x0008 (0x0008 - 0x0000)
struct SMStateInstance_Base_GetPreviousActiveTransition final
{
public:
	class USMTransitionInstance*                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SMStateInstance_Base_GetPreviousActiveTransition;

// Function SMSystem.SMStateInstance_Base.GetPreviousStateByName
// 0x0018 (0x0018 - 0x0000)
struct SMStateInstance_Base_GetPreviousStateByName final
{
public:
