#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpiderNavigation

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "SpiderNavigation_structs.hpp"


namespace SDK
{

// Class SpiderNavigation.SpiderNavGridBuilder
// 0x0150 (0x03D8 - 0x0288)
class ASpiderNavGridBuilder final : public AActor
{
public:
	class UBoxComponent*                          VolumeBox;                                         // 0x0288(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ASpiderNavGridTracer>       TracerActorBP;                                     // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ASpiderNavPoint>            NavPointActorBP;                                   // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ASpiderNavPointEdge>        NavPointEdgeActorBP;                               // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GridStepSize;                                      // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         ActorsWhiteList;                                   // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bUseActorWhiteList;                                // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         ActorsBlackList;                                   // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bUseActorBlackList;                                // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoRemoveTracers;                                // 0x02D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoSaveGrid;                                     // 0x02DA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2DB[0x1];                                      // 0x02DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BounceNavDistance;                                 // 0x02DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TraceDistanceModificator;                          // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ClosePointsFilterModificator;                      // 0x02E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ConnectionSphereRadiusModificator;                 // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TraceDistanceForEdgesModificator;                  // 0x02EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EgdeDeviationModificator;                          // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSingleDirectionTrace;                             // 0x02F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2F5[0xE3];                                     // 0x02F5(0x00E3)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 BuildGrid();
	void DrawDebugRelations();
	void SaveGrid();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpiderNavGridBuilder")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpiderNavGridBuilder")
	}
	static class ASpiderNavGridBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASpiderNavGridBuilder>();
	}
};
DUMPER7_ASSERTS_ASpiderNavGridBuilder;

// Class SpiderNavigation.SpiderNavGridSaveGame
// 0x0108 (0x0130 - 0x0028)
class USpiderNavGridSaveGame final : public USaveGame
{
public:
	TMap<int32, struct FVector>                   NavLocations;                                      // 0x0028(0x0050)(NativeAccessSpecifierPublic)
	TMap<int32, struct FVector>                   NavNormals;                                        // 0x0078(0x0050)(NativeAccessSpecifierPublic)
	TMap<int32, struct FSpiderNavRelations>       NavRelations;                                      // 0x00C8(0x0050)(NativeAccessSpecifierPublic)
	class FString                                 SaveSlotName;                                      // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        UserIndex;                                         // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpiderNavGridSaveGame")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpiderNavGridSaveGame")
	}
	static class USpiderNavGridSaveGame* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpiderNavGridSaveGame>();
	}
};
DUMPER7_ASSERTS_USpiderNavGridSaveGame;

// Class SpiderNavigation.SpiderNavGridTracer
// 0x0008 (0x0290 - 0x0288)
class ASpiderNavGridTracer final : public AActor
{
public:
	class USphereComponent*                       CollisionComp;                                     // 0x0288(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpiderNavGridTracer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpiderNavGridTracer")
	}
	static class ASpiderNavGridTracer* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASpiderNavGridTracer>();
	}
};
DUMPER7_ASSERTS_ASpiderNavGridTracer;

// Class SpiderNavigation.SpiderNavigation
// 0x0078 (0x0300 - 0x0288)
class ASpiderNavigation final : public AActor
{
public:
	uint8                                         Pad_288[0x70];                                     // 0x0288(0x0070)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bAutoLoadGrid;                                     // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2F9[0x3];                                      // 0x02F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DebugLinesThickness;                               // 0x02FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void DrawDebugRelations();
	struct FVector FindClosestNodeLocation(const struct FVector& Location);
	struct FVector FindClosestNodeNormal(const struct FVector& Location);
	bool FindNextLocationAndNormal(const struct FVector& CurrentLocation, const struct FVector& TargetLocation, struct FVector* NextLocation, struct FVector* Normal);
	TArray<struct FVector> FindPath(const struct FVector& Start, const struct FVector& End, bool* bFoundCompletePath);
	int32 GetNavNodesCount();
	bool LoadGrid();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpiderNavigation")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpiderNavigation")
	}
	static class ASpiderNavigation* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASpiderNavigation>();
	}
};
DUMPER7_ASSERTS_ASpiderNavigation;

// Class SpiderNavigation.SpiderNavPoint
// 0x0040 (0x02C8 - 0x0288)
class ASpiderNavPoint : public AActor
{
public:
	class USphereComponent*                       CollisionComp;                                     // 0x0288(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_290[0x38];                                     // 0x0290(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpiderNavPoint")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpiderNavPoint")
	}
	static class ASpiderNavPoint* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASpiderNavPoint>();
	}
};
DUMPER7_ASSERTS_ASpiderNavPoint;

// Class SpiderNavigation.SpiderNavPointEdge
// 0x0000 (0x02C8 - 0x02C8)
class ASpiderNavPointEdge final : public ASpiderNavPoint
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpiderNavPointEdge")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpiderNavPointEdge")
	}
	static class ASpiderNavPointEdge* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASpiderNavPointEdge>();
	}
};
DUMPER7_ASSERTS_ASpiderNavPointEdge;

}

