#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Unit_EquipPreview_Wukong

#include "Basic.hpp"

#include "BP_EquipPreviewActorBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Unit_EquipPreview_Wukong.Unit_EquipPreview_Wukong_C
// 0x0040 (0x0368 - 0x0328)
class AUnit_EquipPreview_Wukong_C final : public ABP_EquipPreviewActorBase_C
{
public:
	class UStaticMeshComponent*                   head_hair;                                         // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 bodypart_weiba;                                    // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 bodypart_hulu;                                     // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 bodypart_weapon;                                   // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 bodypart_foot;                                     // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 bodypart_arm;                                      // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 bodypart_upwear;                                   // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 bodypart_head;                                     // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Unit_EquipPreview_Wukong_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Unit_EquipPreview_Wukong_C")
	}
	static class AUnit_EquipPreview_Wukong_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUnit_EquipPreview_Wukong_C>();
	}
};
DUMPER7_ASSERTS_AUnit_EquipPreview_Wukong_C;

}

