#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UnrealExtent

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UnrealExtent_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "MovieScene_structs.hpp"
#include "Niagara_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK::Params
{

// Function UnrealExtent.GSE_FoliageFuncLib.IFA_GetSelectedInstanceName
// 0x0018 (0x0018 - 0x0000)
struct GSE_FoliageFuncLib_IFA_GetSelectedInstanceName final
{
public:
	class AInstancedFoliageActor*                 FoliageActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_FoliageFuncLib_IFA_GetSelectedInstanceName;

// Function UnrealExtent.GSE_FoliageFuncLib.InstancedFoliageActorSetCullDistance
// 0x0010 (0x0010 - 0x0000)
struct GSE_FoliageFuncLib_InstancedFoliageActorSetCullDistance final
{
public:
	class AInstancedFoliageActor*                 FoliageActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinLodDist;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxLodDist;                                        // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_FoliageFuncLib_InstancedFoliageActorSetCullDistance;

// Function UnrealExtent.GSE_NetFuncLib.GetAllActiveConnectionInfo
// 0x0018 (0x0018 - 0x0000)
struct GSE_NetFuncLib_GetAllActiveConnectionInfo final
{
public:
	class UObject*                                WorldContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGSConnectionInfo>              ConnectionInfos;                                   // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_NetFuncLib_GetAllActiveConnectionInfo;

// Function UnrealExtent.AlphaScanButton.SetAdvancedHitAlpha
// 0x0004 (0x0004 - 0x0000)
struct AlphaScanButton_SetAdvancedHitAlpha final
{
public:
	int32                                         InAlpha;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AlphaScanButton_SetAdvancedHitAlpha;

// Function UnrealExtent.AlphaScanButton.SetAdvancedHitTexture
// 0x0008 (0x0008 - 0x0000)
struct AlphaScanButton_SetAdvancedHitTexture final
{
public:
	class UTexture2D*                             InTexture;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AlphaScanButton_SetAdvancedHitTexture;

// Function UnrealExtent.GSE_NiagaraFuncLib.ClearUnusedPooledNiagara
// 0x0010 (0x0010 - 0x0000)
struct GSE_NiagaraFuncLib_ClearUnusedPooledNiagara final
{
public:
	class UWorld*                                 World;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OverrideKillUnusedTime;                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSE_NiagaraFuncLib_ClearUnusedPooledNiagara;

// Function UnrealExtent.GSE_NiagaraFuncLib.ForceDestroyNiagaraComponent
// 0x0008 (0x0008 - 0x0000)
struct GSE_NiagaraFuncLib_ForceDestroyNiagaraComponent final
{
public:
	class UNiagaraComponent*                      NC;                                                // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_NiagaraFuncLib_ForceDestroyNiagaraComponent;

// Function UnrealExtent.GSE_NiagaraFuncLib.GetNiagaraComponentPoolMethod
// 0x0010 (0x0010 - 0x0000)
struct GSE_NiagaraFuncLib_GetNiagaraComponentPoolMethod final
{
public:
	class UNiagaraComponent*                      NC;                                                // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENCPoolMethod                                 ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSE_NiagaraFuncLib_GetNiagaraComponentPoolMethod;

// Function UnrealExtent.GSE_NiagaraFuncLib.SetEffectTypeManagerState
// 0x0001 (0x0001 - 0x0000)
struct GSE_NiagaraFuncLib_SetEffectTypeManagerState final
{
public:
	EEffectTypeManagerCullMode                    NewMode;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_NiagaraFuncLib_SetEffectTypeManagerState;

// Function UnrealExtent.GSE_NiagaraFuncLib.SetTextureParameterValueOnMeshRenderMaterials
// 0x0018 (0x0018 - 0x0000)
struct GSE_NiagaraFuncLib_SetTextureParameterValueOnMeshRenderMaterials final
{
public:
	class UNiagaraComponent*                      NiagaraComponent;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ParameterName;                                     // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture*                               ParameterValue;                                    // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_NiagaraFuncLib_SetTextureParameterValueOnMeshRenderMaterials;

// Function UnrealExtent.AudioVisualizeBox.SetAudioInfo
// 0x0020 (0x0020 - 0x0000)
struct AudioVisualizeBox_SetAudioInfo final
{
public:
	struct FVector2D                              InLoudness;                                        // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 InConstantInfo;                                    // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AudioVisualizeBox_SetAudioInfo;

// Function UnrealExtent.AudioVisualizeBox.SetFreqInfo
// 0x0010 (0x0010 - 0x0000)
struct AudioVisualizeBox_SetFreqInfo final
{
public:
	TArray<float>                                 InConstantInfo;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AudioVisualizeBox_SetFreqInfo;

// Function UnrealExtent.AudioVisualizeBox.SetFreqNum
// 0x0004 (0x0004 - 0x0000)
struct AudioVisualizeBox_SetFreqNum final
{
public:
	int32                                         InFreqNum;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AudioVisualizeBox_SetFreqNum;

// Function UnrealExtent.AudioVisualizeBox.SetLoudnessInfo
// 0x0010 (0x0010 - 0x0000)
struct AudioVisualizeBox_SetLoudnessInfo final
{
public:
	struct FVector2D                              InLoudness;                                        // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AudioVisualizeBox_SetLoudnessInfo;

// Function UnrealExtent.GSE_SaveGameFuncLib.GetAllSaveGameSlotNames
// 0x0010 (0x0010 - 0x0000)
struct GSE_SaveGameFuncLib_GetAllSaveGameSlotNames final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_SaveGameFuncLib_GetAllSaveGameSlotNames;

// Function UnrealExtent.GSE_SaveGameFuncLib.LoadDataFromSlot
// 0x0028 (0x0028 - 0x0000)
struct GSE_SaveGameFuncLib_LoadDataFromSlot final
{
public:
	TArray<uint8>                                 OutSaveData;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 SlotName;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UserIndex;                                         // 0x0020(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSE_SaveGameFuncLib_LoadDataFromSlot;

// Function UnrealExtent.GSE_SaveGameFuncLib.SaveDataToSlot
// 0x0028 (0x0028 - 0x0000)
struct GSE_SaveGameFuncLib_SaveDataToSlot final
{
public:
	TArray<uint8>                                 InSaveData;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 SlotName;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UserIndex;                                         // 0x0020(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSE_SaveGameFuncLib_SaveDataToSlot;

// Function UnrealExtent.AudioVisualizeUtil.OnAudioPlaybackPercentCallback
// 0x0010 (0x0010 - 0x0000)
struct AudioVisualizeUtil_OnAudioPlaybackPercentCallback final
{
public:
	const class USoundWave*                       SoundWave;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Percent;                                           // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AudioVisualizeUtil_OnAudioPlaybackPercentCallback;

// Function UnrealExtent.HttpResposeListener.OnReponseComplete
// 0x0018 (0x0018 - 0x0000)
struct HttpResposeListener_OnReponseComplete final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HttpCode;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 Content;                                           // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HttpResposeListener_OnReponseComplete;

// Function UnrealExtent.HttpResposeListener.OnRequestProgress
// 0x000C (0x000C - 0x0000)
struct HttpResposeListener_OnRequestProgress final
{
public:
	int32                                         sentBytes;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         lReceivedBytes;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         lTotalBytes;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HttpResposeListener_OnRequestProgress;

// Function UnrealExtent.HttpResposeListener.IsNeedProgress
// 0x0001 (0x0001 - 0x0000)
struct HttpResposeListener_IsNeedProgress final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HttpResposeListener_IsNeedProgress;

// Function UnrealExtent.GSE_SDKFuncLib.AddCrashUserData
// 0x0028 (0x0028 - 0x0000)
struct GSE_SDKFuncLib_AddCrashUserData final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSE_SDKFuncLib_AddCrashUserData;

// Function UnrealExtent.GSE_SDKFuncLib.FCommandLine_AddArg
// 0x0010 (0x0010 - 0x0000)
struct GSE_SDKFuncLib_FCommandLine_AddArg final
{
public:
	class FString                                 Command;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_SDKFuncLib_FCommandLine_AddArg;

// Function UnrealExtent.GSE_SDKFuncLib.FCommandLine_Get
// 0x0010 (0x0010 - 0x0000)
struct GSE_SDKFuncLib_FCommandLine_Get final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_SDKFuncLib_FCommandLine_Get;

// Function UnrealExtent.GSE_SDKFuncLib.GetAllPS5UsbStorageDeviceId
// 0x0018 (0x0018 - 0x0000)
struct GSE_SDKFuncLib_GetAllPS5UsbStorageDeviceId final
{
public:
	TArray<class FString>                         OutIds;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSE_SDKFuncLib_GetAllPS5UsbStorageDeviceId;

// Function UnrealExtent.GSE_SDKFuncLib.GetGameRunEnvContext
// 0x0050 (0x0050 - 0x0000)
struct GSE_SDKFuncLib_GetGameRunEnvContext final
{
public:
	TMap<class FString, class FString>            OutContext;                                        // 0x0000(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_SDKFuncLib_GetGameRunEnvContext;

// Function UnrealExtent.GSE_SDKFuncLib.GetIOSBundlePath
// 0x0010 (0x0010 - 0x0000)
struct GSE_SDKFuncLib_GetIOSBundlePath final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_SDKFuncLib_GetIOSBundlePath;

// Function UnrealExtent.GSE_SDKFuncLib.GetIOSDocumentPath
// 0x0010 (0x0010 - 0x0000)
struct GSE_SDKFuncLib_GetIOSDocumentPath final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_SDKFuncLib_GetIOSDocumentPath;

// Function UnrealExtent.GSE_SDKFuncLib.GetNatInfo
// 0x0001 (0x0001 - 0x0000)
struct GSE_SDKFuncLib_GetNatInfo final
{
public:
	EBGWNATType                                   ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_SDKFuncLib_GetNatInfo;

// Function UnrealExtent.GSE_SDKFuncLib.GetPS5UsbStorageDeviceInfo
// 0x0038 (0x0038 - 0x0000)
struct GSE_SDKFuncLib_GetPS5UsbStorageDeviceInfo final
{
public:
	class FString                                 DeviceID;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUsbStorageDeviceInfo                  OutInfo;                                           // 0x0010(0x0020)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSE_SDKFuncLib_GetPS5UsbStorageDeviceInfo;

// Function UnrealExtent.GSE_SDKFuncLib.GetPS5UserAccountRegionCode
// 0x0010 (0x0010 - 0x0000)
struct GSE_SDKFuncLib_GetPS5UserAccountRegionCode final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_SDKFuncLib_GetPS5UserAccountRegionCode;

// Function UnrealExtent.GSE_SDKFuncLib.GetPS5UserDefinedParam
// 0x0008 (0x0008 - 0x0000)
struct GSE_SDKFuncLib_GetPS5UserDefinedParam final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_SDKFuncLib_GetPS5UserDefinedParam;

// Function UnrealExtent.GSE_SDKFuncLib.HttpPostFile
// 0x0080 (0x0080 - 0x0000)
struct GSE_SDKFuncLib_HttpPostFile final
{
public:
	class FString                                 PostUrl;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            ExHeaders;                                         // 0x0010(0x0050)(Parm, NativeAccessSpecifierPublic)
	class FString                                 FilePath;                                          // 0x0060(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHttpResposeListener*                   Listener;                                          // 0x0070(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0078(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSE_SDKFuncLib_HttpPostFile;

// Function UnrealExtent.GSE_SDKFuncLib.HttpPostFileContent
// 0x0090 (0x0090 - 0x0000)
struct GSE_SDKFuncLib_HttpPostFileContent final
{
public:
	class FString                                 PostUrl;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            ExHeaders;                                         // 0x0010(0x0050)(Parm, NativeAccessSpecifierPublic)
	class FString                                 Filename;                                          // 0x0060(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 FileContentData;                                   // 0x0070(0x0010)(ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class UHttpResposeListener*                   Listener;                                          // 0x0080(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0088(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSE_SDKFuncLib_HttpPostFileContent;

// Function UnrealExtent.GSE_SDKFuncLib.HttpPostFileList
// 0x0080 (0x0080 - 0x0000)
struct GSE_SDKFuncLib_HttpPostFileList final
{
public:
	class FString                                 PostUrl;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            ExHeaders;                                         // 0x0010(0x0050)(Parm, NativeAccessSpecifierPublic)
	TArray<class FString>                         FilePathList;                                      // 0x0060(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class UHttpResposeListener*                   Listener;                                          // 0x0070(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0078(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSE_SDKFuncLib_HttpPostFileList;

// Function UnrealExtent.GSE_SDKFuncLib.IsCleanVersion
// 0x0001 (0x0001 - 0x0000)
struct GSE_SDKFuncLib_IsCleanVersion final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_SDKFuncLib_IsCleanVersion;

// Function UnrealExtent.GSE_SDKFuncLib.IsPureVersion
// 0x0001 (0x0001 - 0x0000)
struct GSE_SDKFuncLib_IsPureVersion final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_SDKFuncLib_IsPureVersion;

// Function UnrealExtent.GSE_SDKFuncLib.NonGameThreadStartHttpRawDataRequestWithBlockMode
// 0x00E0 (0x00E0 - 0x0000)
struct GSE_SDKFuncLib_NonGameThreadStartHttpRawDataRequestWithBlockMode final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Method;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            ExHeaders;                                         // 0x0020(0x0050)(Parm, NativeAccessSpecifierPublic)
	TArray<uint8>                                 PostRawData;                                       // 0x0070(0x0010)(ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         RequestTimeout;                                    // 0x0080(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, class FString>            OutResponse;                                       // 0x0088(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x00D8(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSE_SDKFuncLib_NonGameThreadStartHttpRawDataRequestWithBlockMode;

// Function UnrealExtent.GSE_SDKFuncLib.PostException
// 0x0040 (0x0040 - 0x0000)
struct GSE_SDKFuncLib_PostException final
{
public:
	int32                                         Type;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Name_0;                                            // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Message;                                           // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 StackTrace;                                        // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSE_SDKFuncLib_PostException;

// Function UnrealExtent.GSE_SDKFuncLib.PostExceptionSample
// 0x0018 (0x0018 - 0x0000)
struct GSE_SDKFuncLib_PostExceptionSample final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSE_SDKFuncLib_PostExceptionSample;

// Function UnrealExtent.GSE_SDKFuncLib.PS5ExportDataToUsb
// 0x0028 (0x0028 - 0x0000)
struct GSE_SDKFuncLib_PS5ExportDataToUsb final
{
public:
	class FString                                 Filename;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 FileContentData;                                   // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	EPS5UsbWriteErrorCode                         ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSE_SDKFuncLib_PS5ExportDataToUsb;

// Function UnrealExtent.GSE_SDKFuncLib.PS5RequestMapUsb
// 0x0038 (0x0038 - 0x0000)
struct GSE_SDKFuncLib_PS5RequestMapUsb final
{
public:
	class FString                                 DeviceID;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UsrDir;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutMountPoint;                                     // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPS5RequestMapUsbErrorCode                    ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSE_SDKFuncLib_PS5RequestMapUsb;

// Function UnrealExtent.GSE_SDKFuncLib.PS5RequestUnMapUsb
// 0x0028 (0x0028 - 0x0000)
struct GSE_SDKFuncLib_PS5RequestUnMapUsb final
{
public:
	class FString                                 DeviceID;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UsrDir;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPS5RequestUnMapUsbErrorCode                  ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSE_SDKFuncLib_PS5RequestUnMapUsb;

// Function UnrealExtent.GSE_SDKFuncLib.PS5UsbMkSubDir
// 0x0058 (0x0058 - 0x0000)
struct GSE_SDKFuncLib_PS5UsbMkSubDir final
{
public:
	class FString                                 DeviceID;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MountPoint;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UsrDir;                                            // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SubDir;                                            // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutDirPath;                                        // 0x0040(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSE_SDKFuncLib_PS5UsbMkSubDir;

// Function UnrealExtent.GSE_SDKFuncLib.PS5UsbSelectDevice
// 0x0028 (0x0028 - 0x0000)
struct GSE_SDKFuncLib_PS5UsbSelectDevice final
{
public:
	class FString                                 UsrDir;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutDeviceId;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPS5UsbSelectErrorCode                        ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSE_SDKFuncLib_PS5UsbSelectDevice;

// Function UnrealExtent.GSE_SDKFuncLib.QueryIsOwnPS5EntitlementSync
// 0x0018 (0x0018 - 0x0000)
struct GSE_SDKFuncLib_QueryIsOwnPS5EntitlementSync final
{
public:
	class FString                                 QueryEntitlementId;                                // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSE_SDKFuncLib_QueryIsOwnPS5EntitlementSync;

// Function UnrealExtent.GSE_SDKFuncLib.QueryIsOwnXBOXEntitlementSync
// 0x0018 (0x0018 - 0x0000)
struct GSE_SDKFuncLib_QueryIsOwnXBOXEntitlementSync final
{
public:
	class FString                                 QueryEntitlementId;                                // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSE_SDKFuncLib_QueryIsOwnXBOXEntitlementSync;

// Function UnrealExtent.GSE_SDKFuncLib.SentryCrashReporterSetContext
// 0x0060 (0x0060 - 0x0000)
struct GSE_SDKFuncLib_SentryCrashReporterSetContext final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            ContextValues;                                     // 0x0010(0x0050)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_SDKFuncLib_SentryCrashReporterSetContext;

// Function UnrealExtent.GSE_SDKFuncLib.SentryCrashReporterSetRoot
// 0x0020 (0x0020 - 0x0000)
struct GSE_SDKFuncLib_SentryCrashReporterSetRoot final
{
public:
	class FString                                 RootKey;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RootValue;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_SDKFuncLib_SentryCrashReporterSetRoot;

// Function UnrealExtent.GSE_SDKFuncLib.SentryCrashReporterSetTag
// 0x0020 (0x0020 - 0x0000)
struct GSE_SDKFuncLib_SentryCrashReporterSetTag final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_SDKFuncLib_SentryCrashReporterSetTag;

// Function UnrealExtent.GSE_SDKFuncLib.SentryCrashReporterSetUser
// 0x0020 (0x0020 - 0x0000)
struct GSE_SDKFuncLib_SentryCrashReporterSetUser final
{
public:
	class FString                                 UserKey;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UserValue;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_SDKFuncLib_SentryCrashReporterSetUser;

// Function UnrealExtent.GSE_SDKFuncLib.SetAppIsAutoTestingMode
// 0x0004 (0x0004 - 0x0000)
struct GSE_SDKFuncLib_SetAppIsAutoTestingMode final
{
public:
	int32                                         bEnable;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_SDKFuncLib_SetAppIsAutoTestingMode;

// Function UnrealExtent.GSE_SDKFuncLib.SetBuglyUserMap
// 0x0028 (0x0028 - 0x0000)
struct GSE_SDKFuncLib_SetBuglyUserMap final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSE_SDKFuncLib_SetBuglyUserMap;

// Function UnrealExtent.GSE_SDKFuncLib.SetCrashReportClientEnable
// 0x0004 (0x0004 - 0x0000)
struct GSE_SDKFuncLib_SetCrashReportClientEnable final
{
public:
	int32                                         bEnable;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GSE_SDKFuncLib_SetCrashReportClientEnable;

// Function UnrealExtent.GSE_SDKFuncLib.StartHttpBase64DataRequest
// 0x0090 (0x0090 - 0x0000)
struct GSE_SDKFuncLib_StartHttpBase64DataRequest final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Method;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            ExHeaders;                                         // 0x0020(0x0050)(Parm, NativeAccessSpecifierPublic)
	class FString                                 Base64PostData;                                    // 0x0070(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHttpResposeListener*                   Listener;                                          // 0x0080(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RequestTimeout;                                    // 0x0088(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x008C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSE_SDKFuncLib_StartHttpBase64DataRequest;

// Function UnrealExtent.GSE_SDKFuncLib.StartHttpRawDataRequest
// 0x0090 (0x0090 - 0x0000)
struct GSE_SDKFuncLib_StartHttpRawDataRequest final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Method;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            ExHeaders;                                         // 0x0020(0x0050)(Parm, NativeAccessSpecifierPublic)
	TArray<uint8>                                 PostRawData;                                       // 0x0070(0x0010)(ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class UHttpResposeListener*                   Listener;                                          // 0x0080(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RequestTimeout;                                    // 0x0088(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x008C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSE_SDKFuncLib_StartHttpRawDataRequest;

// Function UnrealExtent.GSE_SDKFuncLib.TestCallAndroidFunc
// 0x0018 (0x0018 - 0x0000)
struct GSE_SDKFuncLib_TestCallAndroidFunc final
{
public:
	class FString                                 Content;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSE_SDKFuncLib_TestCallAndroidFunc;

// Function UnrealExtent.GSE_SDKFuncLib.UsbStorageIsExist
// 0x0028 (0x0028 - 0x0000)
struct GSE_SDKFuncLib_UsbStorageIsExist final
{
public:
	class FString                                 DeviceIdStr;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Path;                                              // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsFile;                                            // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0021(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GSE_SDKFuncLib_UsbStorageIsExist;

// Function UnrealExtent.AutoMovementMonitor.CheckHitRotation
// 0x0018 (0x0018 - 0x0000)
struct AutoMovementMonitor_CheckHitRotation final
{
public:
	struct FRotator                               InRotator;                                         // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoMovementMonitor_CheckHitRotation;

// Function UnrealExtent.AutoMovementMonitor.CreatePointInstances
// 0x0010 (0x0010 - 0x0000)
struct AutoMovementMonitor_CreatePointInstances final
{
public:
	TArray<struct FVector>                        InPoints;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoMovementMonitor_CreatePointInstances;

// Function UnrealExtent.AutoMovementMonitor.DrawStatOnHeatmap
// 0x0018 (0x0018 - 0x0000)
struct AutoMovementMonitor_DrawStatOnHeatmap final
{
public:
	class FString                                 InStatName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InTileCount;                                       // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AutoMovementMonitor_DrawStatOnHeatmap;

// Function UnrealExtent.AutoMovementMonitor.GetPointExecutionDurationInfo
// 0x0018 (0x0018 - 0x0000)
struct AutoMovementMonitor_GetPointExecutionDurationInfo final
{
public:
	int64                                         InStartTimestamp;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoMovementMonitor_GetPointExecutionDurationInfo;

// Function UnrealExtent.AutoMovementMonitor.GetRotationIncrement
// 0x0088 (0x0088 - 0x0000)
struct AutoMovementMonitor_GetRotationIncrement final
{
public:
	struct FVector                                InRotatorMask;                                     // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAutoMovementViewingPattern            ViewingPattern;                                    // 0x0018(0x0058)(Parm, NativeAccessSpecifierPublic)
	struct FRotator                               ReturnValue;                                       // 0x0070(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoMovementMonitor_GetRotationIncrement;

// Function UnrealExtent.AutoMovementMonitor.IncreaseViewingRotation
// 0x0002 (0x0002 - 0x0000)
struct AutoMovementMonitor_IncreaseViewingRotation final
{
public:
	ERotateType                                   RotateType;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bProxyCall;                                        // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoMovementMonitor_IncreaseViewingRotation;

// Function UnrealExtent.AutoMovementMonitor.ProcessAutoMovement
// 0x0030 (0x0030 - 0x0000)
struct AutoMovementMonitor_ProcessAutoMovement final
{
public:
	struct FVector                                InLocation;                                        // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               InRotator;                                         // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoMovementMonitor_ProcessAutoMovement;

// Function UnrealExtent.AutoMovementMonitor.SetSparseVersionEnabled
// 0x0001 (0x0001 - 0x0000)
struct AutoMovementMonitor_SetSparseVersionEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoMovementMonitor_SetSparseVersionEnabled;

// Function UnrealExtent.AutoMovementMonitor.SwitchToVirtualPawn
// 0x0020 (0x0020 - 0x0000)
struct AutoMovementMonitor_SwitchToVirtualPawn final
{
public:
	class UClass*                                 VirtualPlayerBaseClass;                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                SpawningOffset;                                    // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoMovementMonitor_SwitchToVirtualPawn;

// Function UnrealExtent.AutoMovementMonitor.TransportViewingPosition
// 0x0038 (0x0038 - 0x0000)
struct AutoMovementMonitor_TransportViewingPosition final
{
public:
	struct FVector                                InLocation;                                        // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               InRotator;                                         // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bProxyCall;                                        // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AutoMovementMonitor_TransportViewingPosition;

// Function UnrealExtent.AutoMovementMonitor.CheckAutoMovementCompleted
// 0x0001 (0x0001 - 0x0000)
struct AutoMovementMonitor_CheckAutoMovementCompleted final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoMovementMonitor_CheckAutoMovementCompleted;

// Function UnrealExtent.AutoMovementMonitor.CheckHitLocation
// 0x0020 (0x0020 - 0x0000)
struct AutoMovementMonitor_CheckHitLocation final
{
public:
	struct FVector                                InLocation;                                        // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AutoMovementMonitor_CheckHitLocation;

// Function UnrealExtent.AutoMovementMonitor.HasCompletedPitchingObservation
// 0x0001 (0x0001 - 0x0000)
struct AutoMovementMonitor_HasCompletedPitchingObservation final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoMovementMonitor_HasCompletedPitchingObservation;

// Function UnrealExtent.AutoMovementMonitor.HasCompletedYawingObservation
// 0x0001 (0x0001 - 0x0000)
struct AutoMovementMonitor_HasCompletedYawingObservation final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoMovementMonitor_HasCompletedYawingObservation;

// Function UnrealExtent.AutoMovementUtil.AppendGeneralStatisticsToCapturedReport
// 0x0018 (0x0018 - 0x0000)
struct AutoMovementUtil_AppendGeneralStatisticsToCapturedReport final
{
public:
	class FString                                 InFilename;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MetricsNum;                                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PointNum;                                          // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoMovementUtil_AppendGeneralStatisticsToCapturedReport;

// Function UnrealExtent.AutoMovementUtil.AppendHeaderToCapturedReport
// 0x0020 (0x0020 - 0x0000)
struct AutoMovementUtil_AppendHeaderToCapturedReport final
{
public:
	TArray<class FString>                         CapturedInfoNameList;                              // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 InFilename;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoMovementUtil_AppendHeaderToCapturedReport;

// Function UnrealExtent.AutoMovementUtil.AppendOfflinePathPoints
// 0x0020 (0x0020 - 0x0000)
struct AutoMovementUtil_AppendOfflinePathPoints final
{
public:
	TArray<struct FVector>                        InPoints;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 InFilePathUnderProjFolder;                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoMovementUtil_AppendOfflinePathPoints;

// Function UnrealExtent.AutoMovementUtil.ExportCapturedInfoBatch
// 0x0030 (0x0030 - 0x0000)
struct AutoMovementUtil_ExportCapturedInfoBatch final
{
public:
	int32                                         BatchSize;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalPointNum;                                     // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGSPathPointStatInfo>           InPathPointStatsInfo;                              // 0x0008(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 InFilename;                                        // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
