#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UnrealExtent

#include "Basic.hpp"

#include "UnrealExtent_structs.hpp"
#include "NavigationSystem_classes.hpp"
#include "AIModule_classes.hpp"
#include "SlateCore_structs.hpp"
#include "MovieScene_structs.hpp"
#include "MovieScene_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "MovieSceneTracks_classes.hpp"
#include "Water_classes.hpp"
#include "Niagara_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "Slate_structs.hpp"
#include "PCG_classes.hpp"


namespace SDK
{

// Class UnrealExtent.GSE_FoliageFuncLib
// 0x0000 (0x0028 - 0x0028)
class UGSE_FoliageFuncLib final : public UBlueprintFunctionLibrary
{
public:
	static class FString IFA_GetSelectedInstanceName(class AInstancedFoliageActor* FoliageActor);
	static void InstancedFoliageActorSetCullDistance(class AInstancedFoliageActor* FoliageActor, int32 MinLodDist, int32 MaxLodDist);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSE_FoliageFuncLib")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSE_FoliageFuncLib")
	}
	static class UGSE_FoliageFuncLib* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSE_FoliageFuncLib>();
	}
};
DUMPER7_ASSERTS_UGSE_FoliageFuncLib;

// Class UnrealExtent.GSCrowdFollowingComponent
// 0x0000 (0x0328 - 0x0328)
class UGSCrowdFollowingComponent : public UCrowdFollowingComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSCrowdFollowingComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSCrowdFollowingComponent")
	}
	static class UGSCrowdFollowingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSCrowdFollowingComponent>();
	}
};
DUMPER7_ASSERTS_UGSCrowdFollowingComponent;

// Class UnrealExtent.GSE_NetFuncLib
// 0x0000 (0x0028 - 0x0028)
class UGSE_NetFuncLib final : public UBlueprintFunctionLibrary
{
public:
	static void GetAllActiveConnectionInfo(class UObject* WorldContext, TArray<struct FGSConnectionInfo>* ConnectionInfos);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSE_NetFuncLib")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSE_NetFuncLib")
	}
	static class UGSE_NetFuncLib* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSE_NetFuncLib>();
	}
};
DUMPER7_ASSERTS_UGSE_NetFuncLib;

// Class UnrealExtent.AlphaScanButton
// 0x0010 (0x05E0 - 0x05D0)
class UAlphaScanButton final : public UButton
{
public:
	class UTexture2D*                             AdvancedHitTexture;                                // 0x05C8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AdvancedHitAlpha;                                  // 0x05D0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5D4[0xC];                                      // 0x05D4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetAdvancedHitAlpha(int32 InAlpha);
	void SetAdvancedHitTexture(class UTexture2D* InTexture);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AlphaScanButton")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AlphaScanButton")
	}
	static class UAlphaScanButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAlphaScanButton>();
	}
};
DUMPER7_ASSERTS_UAlphaScanButton;

// Class UnrealExtent.GSE_NiagaraFuncLib
// 0x0000 (0x0028 - 0x0028)
class UGSE_NiagaraFuncLib final : public UBlueprintFunctionLibrary
{
public:
	static void ClearUnusedPooledNiagara(class UWorld* World, float OverrideKillUnusedTime);
	static void ForceDestroyNiagaraComponent(class UNiagaraComponent* NC);
	static ENCPoolMethod GetNiagaraComponentPoolMethod(class UNiagaraComponent* NC);
	static void SetEffectTypeManagerState(EEffectTypeManagerCullMode NewMode);
	static void SetTextureParameterValueOnMeshRenderMaterials(class UNiagaraComponent* NiagaraComponent, const class FName& ParameterName, class UTexture* ParameterValue);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSE_NiagaraFuncLib")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSE_NiagaraFuncLib")
	}
	static class UGSE_NiagaraFuncLib* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSE_NiagaraFuncLib>();
	}
};
DUMPER7_ASSERTS_UGSE_NiagaraFuncLib;

// Class UnrealExtent.AudioVisualizeBox
// 0x00A8 (0x0340 - 0x0298)
class UAudioVisualizeBox final : public UUserWidget
{
public:
	class UImage*                                 LayoutWidget;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FreqNum;                                           // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LoudnessNum;                                       // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 FreqSpecInfoArray;                                 // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector2D>                      LoudnessInfoArray;                                 // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         FreqThickness;                                     // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           FreqColor;                                         // 0x02CC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FreqHeightFinalScale;                              // 0x02DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FreqHeightScale;                                   // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FreqPaintPower;                                    // 0x02E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LoudnessThickness;                                 // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           LoudnessColor;                                     // 0x02EC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              LoudnessHeightRange;                               // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LoudnessRandomScaleFactor;                         // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              OffsetInWidget;                                    // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          PaintFreq;                                         // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          PaintLoudness;                                     // 0x0329(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32A[0x2];                                      // 0x032A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FreqDisturbInterval;                               // 0x032C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_330[0x10];                                     // 0x0330(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void PausePainting();
	void ResetVisualizing();
	void SetAudioInfo(const struct FVector2D& InLoudness, const TArray<float>& InConstantInfo);
	void SetFreqInfo(const TArray<float>& InConstantInfo);
	void SetFreqNum(const int32 InFreqNum);
	void SetLoudnessInfo(const struct FVector2D& InLoudness);
	void StartPainting();
	void StopPainting();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AudioVisualizeBox")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AudioVisualizeBox")
	}
	static class UAudioVisualizeBox* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioVisualizeBox>();
	}
};
DUMPER7_ASSERTS_UAudioVisualizeBox;

// Class UnrealExtent.GSE_SaveGameFuncLib
// 0x0000 (0x0028 - 0x0028)
class UGSE_SaveGameFuncLib final : public UBlueprintFunctionLibrary
{
public:
	static TArray<class FString> GetAllSaveGameSlotNames();
	static bool LoadDataFromSlot(TArray<uint8>* OutSaveData, const class FString& SlotName, const int32 UserIndex);
	static bool SaveDataToSlot(const TArray<uint8>& InSaveData, const class FString& SlotName, const int32 UserIndex);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSE_SaveGameFuncLib")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSE_SaveGameFuncLib")
	}
	static class UGSE_SaveGameFuncLib* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSE_SaveGameFuncLib>();
	}
};
DUMPER7_ASSERTS_UGSE_SaveGameFuncLib;

// Class UnrealExtent.AudioVisualizeUtil
// 0x0030 (0x02B8 - 0x0288)
class AAudioVisualizeUtil final : public AActor
{
public:
	class UAudioComponent*                        Audio;                                             // 0x0288(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULoudnessNRT*                           LoudnessAnalyzer;                                  // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UConstantQNRT*                          ConstantAnalyzer;                                  // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A0[0x18];                                     // 0x02A0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnAudioPlaybackPercentCallback(const class USoundWave* SoundWave, const float Percent);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AudioVisualizeUtil")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AudioVisualizeUtil")
	}
	static class AAudioVisualizeUtil* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAudioVisualizeUtil>();
	}
};
DUMPER7_ASSERTS_AAudioVisualizeUtil;

// Class UnrealExtent.HttpResposeListener
// 0x0008 (0x0030 - 0x0028)
class UHttpResposeListener : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnReponseComplete(bool bSuccess, int32 HttpCode, const TArray<uint8>& Content);
	void OnRequestProgress(int32 sentBytes, int32 lReceivedBytes, int32 lTotalBytes);

	bool IsNeedProgress() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HttpResposeListener")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HttpResposeListener")
	}
	static class UHttpResposeListener* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHttpResposeListener>();
	}
};
DUMPER7_ASSERTS_UHttpResposeListener;

// Class UnrealExtent.AutoMovementPattern
// 0x00C8 (0x00F8 - 0x0030)
class UAutoMovementPattern final : public UPrimaryDataAsset
{
public:
	float                                         TickInterval;                                      // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAutoMovementViewingPattern            ViewingPattern;                                    // 0x0038(0x0058)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FAutoMovementHeatmapConfig             HeatmapConfig;                                     // 0x0090(0x0068)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AutoMovementPattern")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AutoMovementPattern")
	}
	static class UAutoMovementPattern* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAutoMovementPattern>();
	}
};
DUMPER7_ASSERTS_UAutoMovementPattern;

// Class UnrealExtent.GSE_SDKFuncLib
// 0x0000 (0x0028 - 0x0028)
class UGSE_SDKFuncLib final : public UBlueprintFunctionLibrary
{
public:
	static bool AddCrashUserData(const class FString& Key, const class FString& Value);
	static void DisableMediaPlay();
	static void FCommandLine_AddArg(const class FString& Command);
	static class FString FCommandLine_Get();
	static bool GetAllPS5UsbStorageDeviceId(TArray<class FString>* OutIds);
	static void GetGameRunEnvContext(TMap<class FString, class FString>* OutContext);
	static class FString GetIOSBundlePath();
	static class FString GetIOSDocumentPath();
	static EBGWNATType GetNatInfo();
	static bool GetPS5UsbStorageDeviceInfo(const class FString& DeviceID, struct FUsbStorageDeviceInfo* OutInfo);
	static class FString GetPS5UserAccountRegionCode();
	static int32 GetPS5UserDefinedParam(int32 Index_0);
	static bool HttpPostFile(const class FString& PostUrl, const TMap<class FString, class FString>& ExHeaders, const class FString& FilePath, class UHttpResposeListener* Listener);
	static bool HttpPostFileContent(const class FString& PostUrl, const TMap<class FString, class FString>& ExHeaders, const class FString& Filename, const TArray<uint8>& FileContentData, class UHttpResposeListener* Listener);
	static bool HttpPostFileList(const class FString& PostUrl, const TMap<class FString, class FString>& ExHeaders, const TArray<class FString>& FilePathList, class UHttpResposeListener* Listener);
	static bool IsCleanVersion();
	static bool IsPureVersion();
	static int32 NonGameThreadStartHttpRawDataRequestWithBlockMode(const class FString& URL, const class FString& Method, const TMap<class FString, class FString>& ExHeaders, const TArray<uint8>& PostRawData, int32 RequestTimeout, TMap<class FString, class FString>* OutResponse);
	static bool PostException(int32 Type, const class FString& Name_0, const class FString& Message, const class FString& StackTrace);
	static bool PostExceptionSample(const class FString& Message);
	static void PrintCachedEntitlements();
	static EPS5UsbWriteErrorCode PS5ExportDataToUsb(const class FString& Filename, const TArray<uint8>& FileContentData);
	static EPS5RequestMapUsbErrorCode PS5RequestMapUsb(const class FString& DeviceID, const class FString& UsrDir, class FString* OutMountPoint);
	static EPS5RequestUnMapUsbErrorCode PS5RequestUnMapUsb(const class FString& DeviceID, const class FString& UsrDir);
	static bool PS5UsbMkSubDir(const class FString& DeviceID, const class FString& MountPoint, const class FString& UsrDir, const class FString& SubDir, class FString* OutDirPath);
	static EPS5UsbSelectErrorCode PS5UsbSelectDevice(const class FString& UsrDir, class FString* OutDeviceId);
	static bool QueryIsOwnPS5EntitlementSync(const class FString& QueryEntitlementId);
	static bool QueryIsOwnXBOXEntitlementSync(const class FString& QueryEntitlementId);
	static void ReenableMediaPlay();
	static void SentryCrashReporterSetContext(const class FString& Key, const TMap<class FString, class FString>& ContextValues);
	static void SentryCrashReporterSetRoot(const class FString& RootKey, const class FString& RootValue);
	static void SentryCrashReporterSetTag(const class FString& Key, const class FString& Value);
	static void SentryCrashReporterSetUser(const class FString& UserKey, const class FString& UserValue);
	static void SetAppIsAutoTestingMode(int32 bEnable);
	static bool SetBuglyUserMap(const class FString& Key, const class FString& Value);
	static void SetCrashReportClientEnable(int32 bEnable);
	static bool StartHttpBase64DataRequest(const class FString& URL, const class FString& Method, const TMap<class FString, class FString>& ExHeaders, const class FString& Base64PostData, class UHttpResposeListener* Listener, int32 RequestTimeout);
	static bool StartHttpRawDataRequest(const class FString& URL, const class FString& Method, const TMap<class FString, class FString>& ExHeaders, const TArray<uint8>& PostRawData, class UHttpResposeListener* Listener, int32 RequestTimeout);
	static bool TestCallAndroidFunc(const class FString& Content);
	static bool UsbStorageIsExist(const class FString& DeviceIdStr, const class FString& Path, bool* IsFile);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSE_SDKFuncLib")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSE_SDKFuncLib")
	}
	static class UGSE_SDKFuncLib* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSE_SDKFuncLib>();
	}
};
DUMPER7_ASSERTS_UGSE_SDKFuncLib;

// Class UnrealExtent.AutoMovementMonitor
// 0x00A8 (0x0330 - 0x0288)
class AAutoMovementMonitor : public AActor
{
public:
	class UAutoMovementPattern*                   AutoMovePattern;                                   // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReportFilePath;                                    // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        PathPoints;                                        // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        CachedPathPoints;                                  // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	bool                                          bLogProcessingState;                               // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsReadyToProcess;                                 // 0x02C1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPitchingPositively;                               // 0x02C2(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C3[0x1];                                      // 0x02C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TargetPositionIndex;                               // 0x02C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TargetYawIndex;                                    // 0x02C8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TargetPitchIndex;                                  // 0x02CC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TargetPosition;                                    // 0x02D0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               TargetRotation;                                    // 0x02E8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ViewingPhaseIndex;                                 // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AutoMoveStartTimeSinceAppStarted;                  // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LastPointEndTimestamp;                             // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31C[0x14];                                     // 0x031C(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CaptureViewingInfo();
	void CheckHitRotation(const struct FRotator& InRotator);
	void CreatePointInstances(const TArray<struct FVector>& InPoints);
	void DrawStatOnHeatmap(const class FString& InStatName, const int32 InTileCount);
	void EnableAutoMovement();
	void ExitAppOnAutoMoveFinished();
	class FString GetPointExecutionDurationInfo(int64 InStartTimestamp);
	struct FRotator GetRotationIncrement(const struct FVector& InRotatorMask, const struct FAutoMovementViewingPattern& ViewingPattern);
	void IncreaseViewingRotation(ERotateType RotateType, bool bProxyCall);
	void LoadPathPoints();
	void PauseAutoMovement();
	void PostAutoMovement();
	void PreAutoMovement();
	void ProcessAutoMovement(const struct FVector& InLocation, const struct FRotator& InRotator);
	void RegisterAutoMovementConsoleCommands();
	void ResetAutoMovement();
	void ResetPitchRotation();
	void ResetTransportAttemptedCount();
	void ResetYawRotation();
	void ResumeAutoMovement();
	void SetSparseVersionEnabled(bool bEnabled);
	void StopAutoMovement();
	void SwitchRotateDirection();
	void SwitchToVirtualPawn(class UClass* VirtualPlayerBaseClass, const struct FVector& SpawningOffset);
	void TransportViewingPosition(const struct FVector& InLocation, const struct FRotator& InRotator, bool bProxyCall);

	bool CheckAutoMovementCompleted() const;
	bool CheckHitLocation(const struct FVector& InLocation) const;
	bool HasCompletedPitchingObservation() const;
	bool HasCompletedYawingObservation() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AutoMovementMonitor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AutoMovementMonitor")
	}
	static class AAutoMovementMonitor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAutoMovementMonitor>();
	}
};
DUMPER7_ASSERTS_AAutoMovementMonitor;

// Class UnrealExtent.GSE_SequenceMasterCppBase
// 0x0000 (0x0288 - 0x0288)
class AGSE_SequenceMasterCppBase final : public AActor
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSE_SequenceMasterCppBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSE_SequenceMasterCppBase")
	}
	static class AGSE_SequenceMasterCppBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGSE_SequenceMasterCppBase>();
	}
};
DUMPER7_ASSERTS_AGSE_SequenceMasterCppBase;

// Class UnrealExtent.AutoMovementUtil
// 0x0000 (0x0028 - 0x0028)
class UAutoMovementUtil final : public UBlueprintFunctionLibrary
{
public:
	static void AppendGeneralStatisticsToCapturedReport(const class FString& InFilename, int32 MetricsNum, int32 PointNum);
	static void AppendHeaderToCapturedReport(const TArray<class FString>& CapturedInfoNameList, const class FString& InFilename);
	static void AppendOfflinePathPoints(const TArray<struct FVector>& InPoints, const class FString& InFilePathUnderProjFolder);
	static bool ExportCapturedInfoBatch(const int32 BatchSize, const int32 TotalPointNum, const TArray<struct FGSPathPointStatInfo>& InPathPointStatsInfo, const class FString& InFilename, bool bLastBatch, bool bOutputHeader);
	static void ExportStatsCapturedReport(const TArray<struct FGSPathPointStatInfo>& InPathPointStatsInfo, const class FString& InFilename, bool bAppend, bool bOutputHeader);
	static class FString ExtractDateTimeInfo(const class FString& InString);
	static class FString FormatTimeAuto(const double InDuration, const int32 NumDigits);
	static class FString FormatTimeSeconds(const float InDuration);
	static struct FDateTime FromTimestamp(int64 Time);
	static TMap<class FString, float> GetCurPointProcessedMetricsMap(const struct FCapturedInfoArrayPerPoint& InCapturedInfoPerPoint);
	static int64 GetNowTimestamp();
	static TArray<struct FVector> GetOfflinePathPoints(const class FString& InFilePathUnderProjDir, bool bUseSparsePoints);
	static class FString GetVfxAutoPlayerRootFolderPath();
	static struct FCapturedInfoArrayPerPoint InsertIntoCapturedInfoArrayPerPoint(const TArray<struct FGSCapturedStatResult>& RawCapturedData, const struct FCapturedInfoArrayPerPoint& CapturedInfoArrayPerPoint);
	static bool LoadStatsCapturerReport(const class FString& InFileNameUnderProjFolder, TArray<struct FGSPathPointStatInfo>* AllPathPointStatInfo, int32 PointNum);
	static bool MergeMipReportsWithFileNameKeyword(const class FString& InDirectoryUnderProjDir, const class FString& InFileNameKeyword, const class FString& OutputMergedFileName);
	static bool MergeMultiTextureMipReports(const TArray<class FString>& InReportFilePaths, const class FString& OutputMergedFileName);
	static void SaveOfflinePathPoints(const TArray<struct FVector>& InPoints, const class FString& InFilePathUnderProjFolder);
	static void SetVfxAutoPlayerRootFolderPath(const class FString& InRootFolderPath);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AutoMovementUtil")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AutoMovementUtil")
	}
	static class UAutoMovementUtil* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAutoMovementUtil>();
	}
};
DUMPER7_ASSERTS_UAutoMovementUtil;

// Class UnrealExtent.AutoMoveTaskAssembler
// 0x0028 (0x0358 - 0x0330)
class AAutoMoveTaskAssembler final : public AAutoMovementMonitor
{
public:
	TArray<class AAutoMovementMonitor*>           Tasks;                                             // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	int32                                         TaskID;                                            // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 PointsTaskIdList;                                  // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)

public:
	void IncreaseSubTaskViewingRotation(ERotateType InRotateType);
	void InitAutoMoveAssembler();
	void TransportSubTaskViewingPosition(const struct FVector& InLocation, const struct FRotator& InRotator);
	void UpdateProcessingState();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AutoMoveTaskAssembler")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AutoMoveTaskAssembler")
	}
	static class AAutoMoveTaskAssembler* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAutoMoveTaskAssembler>();
	}
};
DUMPER7_ASSERTS_AAutoMoveTaskAssembler;

// Class UnrealExtent.AutoOnlineSubsystemTest
// 0x0000 (0x0028 - 0x0028)
class UAutoOnlineSubsystemTest final : public UObject
{
public:
	static void TestGSSdkAuthToken();
	static void TestLogin();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AutoOnlineSubsystemTest")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AutoOnlineSubsystemTest")
	}
	static class UAutoOnlineSubsystemTest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAutoOnlineSubsystemTest>();
	}
};
DUMPER7_ASSERTS_UAutoOnlineSubsystemTest;

// Class UnrealExtent.BattleCloud
// 0x0008 (0x0290 - 0x0288)
class ABattleCloud final : public AActor
{
public:
	bool                                          EnableSim;                                         // 0x0288(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MipmapDistanceScale;                               // 0x028C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BattleCloud")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BattleCloud")
	}
	static class ABattleCloud* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABattleCloud>();
	}
};
DUMPER7_ASSERTS_ABattleCloud;

// Class UnrealExtent.BGUAsyncLineTraceObject
// 0x0030 (0x0058 - 0x0028)
class UBGUAsyncLineTraceObject final : public UObject
{
public:
	TArray<class AActor*>                         IgnoreActors;                                      // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x20];                                      // 0x0038(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void RequestAsyncLineTraceByChannelSingleStatic(class UBGUAsyncLineTraceObject* InLineTraceObject, int32 ReqID, const struct FVector& Start, const struct FVector& End, ECollisionChannel TraceChannel, bool bTraceComplex, bool bDebug);
	static void RequestAsyncLineTraceByObjectTypeSingleStatic(class UBGUAsyncLineTraceObject* InLineTraceObject, int32 ReqID, const struct FVector& Start, const struct FVector& End, const TArray<EObjectTypeQuery>& ObjectTypes, bool bTraceComplex, bool bDebug);

	int32 GetAndCleanLineTraceResults(TArray<struct FAsyncLineTraceSingleResult>* OutAsyncLineTraceResults);
	void RequestAsyncLineTraceByChannelOnlyCheck(int32 ReqID, const struct FVector& Start, const struct FVector& End, ECollisionChannel TraceChannel, bool bTraceComplex, bool bDebug);
	void RequestAsyncLineTraceByChannelSingle(int32 ReqID, const struct FVector& Start, const struct FVector& End, ECollisionChannel TraceChannel, bool bTraceComplex, bool bDebug);
	void RequestAsyncLineTraceByChannelSingle_Batch(const TArray<struct FAsyncLineTraceReq>& ReqList, ECollisionChannel TraceChannel, bool bTraceComplex, bool bDebug);
	void RequestAsyncLineTraceByObjectTypeSingle(int32 ReqID, const struct FVector& Start, const struct FVector& End, const TArray<EObjectTypeQuery>& ObjectTypes, bool bTraceComplex, bool bDebug);
	void RequestAsyncLineTraceByObjectTypeSingle_Batch(const TArray<struct FAsyncLineTraceReq>& ReqList, const TArray<EObjectTypeQuery>& ObjectTypes, bool bTraceComplex, bool bDebug);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BGUAsyncLineTraceObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BGUAsyncLineTraceObject")
	}
	static class UBGUAsyncLineTraceObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBGUAsyncLineTraceObject>();
	}
};
DUMPER7_ASSERTS_UBGUAsyncLineTraceObject;

// Class UnrealExtent.BGUMovieSceneComponentMaterialTrack
// 0x0010 (0x00B0 - 0x00A0)
class UBGUMovieSceneComponentMaterialTrack final : public UMovieSceneMaterialTrack
{
public:
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaterialIndex;                                     // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BGUMovieSceneComponentMaterialTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BGUMovieSceneComponentMaterialTrack")
	}
	static class UBGUMovieSceneComponentMaterialTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBGUMovieSceneComponentMaterialTrack>();
	}
};
DUMPER7_ASSERTS_UBGUMovieSceneComponentMaterialTrack;

// Class UnrealExtent.BGUMovieSceneParameterSection
// 0x0038 (0x0120 - 0x00E8)
class UBGUMovieSceneParameterSection final : public UMovieSceneSection
{
public:
	bool                                          bAffectClothMaterial;                              // 0x00E8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAffectAllMaterial;                                // 0x00E9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBGUScalarParameterInfoAndCurve> ScalarParameterInfosAndCurves;                    // 0x00F0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FBGUVectorParameterInfoAndCurves> VectorParameterInfosAndCurves;                   // 0x0100(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FBGUColorParameterInfoAndCurves> ColorParameterInfosAndCurves;                     // 0x0110(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	void AddColorParameterKey(const struct FBGUMaterialParameterInfo& InParameterInfo, const struct FFrameNumber& InTime, const struct FLinearColor& InValue);
	void AddScalarParameterKey(const struct FBGUMaterialParameterInfo& InParameterInfo, const struct FFrameNumber& InTime, float InValue);
	void AddVectorParameterKey(const struct FBGUMaterialParameterInfo& InParameterInfo, const struct FFrameNumber& InTime, const struct FVector& InValue);
	bool RemoveColorParameter(const struct FBGUMaterialParameterInfo& InParameterInfo);
	bool RemoveColorParameterByName(const class FName& InParameterInfoName);
	bool RemoveScalarParameter(const struct FBGUMaterialParameterInfo& InParameterInfo);
	bool RemoveScalarParameterByName(const class FName& InParameterInfoName);
	bool RemoveVectorParameter(const struct FBGUMaterialParameterInfo& InParameterInfo);
	bool RemoveVectorParameterByName(const class FName& InParameterInfoName);

	void GetParameterInfos(TSet<struct FBGUMaterialParameterInfo>* ParameterInfos) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BGUMovieSceneParameterSection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BGUMovieSceneParameterSection")
	}
	static class UBGUMovieSceneParameterSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBGUMovieSceneParameterSection>();
	}
};
DUMPER7_ASSERTS_UBGUMovieSceneParameterSection;

// Class UnrealExtent.BGWBlockingVolume
// 0x0010 (0x02D0 - 0x02C0)
class ABGWBlockingVolume final : public AVolume
{
public:
	uint8                                         Pad_2C0[0x8];                                      // 0x02C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bNavModify;                                        // 0x02C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMaskFillCollisionUnderneathForNavmesh;            // 0x02C9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CA[0x6];                                      // 0x02CA(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BGWBlockingVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BGWBlockingVolume")
	}
	static class ABGWBlockingVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABGWBlockingVolume>();
	}
};
DUMPER7_ASSERTS_ABGWBlockingVolume;

// Class UnrealExtent.CLRBindingTrigger
// 0x0000 (0x0288 - 0x0288)
class ACLRBindingTrigger final : public AActor
{
public:
	void GenerateClrBindingCode();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CLRBindingTrigger")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CLRBindingTrigger")
	}
	static class ACLRBindingTrigger* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACLRBindingTrigger>();
	}
};
DUMPER7_ASSERTS_ACLRBindingTrigger;

// Class UnrealExtent.AssetDataArray
// 0x0018 (0x0040 - 0x0028)
class UAssetDataArray final : public UObject
{
public:
	TArray<struct FAssetData>                     AssetDataArr;                                      // 0x0028(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ActiveIdx;                                         // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 GetAssetDataCount();
	class FString GetTagValueByIdx(class FName TagName, int32 Idx);
	void SetActiveIdx(int32 Idx);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AssetDataArray")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AssetDataArray")
	}
	static class UAssetDataArray* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetDataArray>();
	}
};
DUMPER7_ASSERTS_UAssetDataArray;

// Class UnrealExtent.ExedreScriptedTexture
// 0x0080 (0x0340 - 0x02C0)
class UExedreScriptedTexture final : public USceneComponent
{
public:
	bool                                          UseMipMaps;                                        // 0x02C0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextureRenderTargetFormat                    RTFormat;                                          // 0x02C1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C2[0x66];                                     // 0x02C2(0x0066)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 ScriptedTexture;                                   // 0x0328(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UUserWidget*                            RenderingWidget;                                   // 0x0330(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_338[0x8];                                      // 0x0338(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ExedreScriptedTexture")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ExedreScriptedTexture")
	}
	static class UExedreScriptedTexture* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExedreScriptedTexture>();
	}
};
DUMPER7_ASSERTS_UExedreScriptedTexture;

// Class UnrealExtent.ExedreWidgetRenderTarget
// 0x00F8 (0x0390 - 0x0298)
class UExedreWidgetRenderTarget final : public UUserWidget
{
public:
	uint8                                         Pad_298[0x10];                                     // 0x0298(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     RenderingMaterial;                                 // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FSlateBrush                            ImageBrush;                                        // 0x02B0(0x00D0)(NativeAccessSpecifierPrivate)
	class UTexture2D*                             DefaultTexture;                                    // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_388[0x8];                                      // 0x0388(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ExedreWidgetRenderTarget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ExedreWidgetRenderTarget")
	}
	static class UExedreWidgetRenderTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExedreWidgetRenderTarget>();
	}
};
DUMPER7_ASSERTS_UExedreWidgetRenderTarget;

// Class UnrealExtent.FoliageInteractiveVolume
// 0x0000 (0x0290 - 0x0290)
class AFoliageInteractiveVolume final : public ATriggerBox
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FoliageInteractiveVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FoliageInteractiveVolume")
	}
	static class AFoliageInteractiveVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFoliageInteractiveVolume>();
	}
};
DUMPER7_ASSERTS_AFoliageInteractiveVolume;

// Class UnrealExtent.GenerateLandscapeHeightfieldVolume
// 0x0000 (0x02C0 - 0x02C0)
class AGenerateLandscapeHeightfieldVolume final : public AVolume
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GenerateLandscapeHeightfieldVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GenerateLandscapeHeightfieldVolume")
	}
	static class AGenerateLandscapeHeightfieldVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGenerateLandscapeHeightfieldVolume>();
	}
};
DUMPER7_ASSERTS_AGenerateLandscapeHeightfieldVolume;

// Class UnrealExtent.GenerateLandscapeVolume
// 0x00A0 (0x0360 - 0x02C0)
class AGenerateLandscapeVolume final : public AVolume
{
public:
	class FString                                 ExportFilename;                                    // 0x02C0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LandscapeHeightLiftUp;                             // 0x02D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ResolutionPerComponent;                            // 0x02D4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     LandscapeMaterial;                                 // 0x02D8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     LandscapeHoleMaterial;                             // 0x02E0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataAsset*                             StaticMeshToPMGrassList;                           // 0x02E8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           IgnoreActorTags;                                   // 0x02F0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FVector2D                              ComponentScaleXY;                                  // 0x0300(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector3d                              OriginPoint;                                       // 0x0310(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDeltaZ;                                         // 0x0328(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              ComponentMinIndex;                                 // 0x032C(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              ComponentNum;                                      // 0x0334(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              HeightfieldResolution;                             // 0x033C(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALandscape*                             LandscapeActor;                                    // 0x0348(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         LandscapeStreamingProxies;                         // 0x0350(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GenerateLandscapeVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GenerateLandscapeVolume")
	}
	static class AGenerateLandscapeVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGenerateLandscapeVolume>();
	}
};
DUMPER7_ASSERTS_AGenerateLandscapeVolume;

// Class UnrealExtent.GSBitmapFontBox
// 0x0140 (0x0270 - 0x0130)
class UGSBitmapFontBox final : public UWidget
{
public:
	struct FSlateBrush                            Brush;                                             // 0x0130(0x00D0)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TDelegate<void()>                             BrushDelegate;                                     // 0x0200(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	class UFont*                                  Font;                                              // 0x0210(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Text;                                              // 0x0218(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TDelegate<void()>                             TextDelegate;                                      // 0x0230(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	float                                         FontScaleFactor;                                   // 0x0240(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CharSpacing;                                       // 0x0244(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGSBitmapJustification                        Justification;                                     // 0x0248(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_249[0x27];                                     // 0x0249(0x0027)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetText(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSBitmapFontBox")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSBitmapFontBox")
	}
	static class UGSBitmapFontBox* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSBitmapFontBox>();
	}
};
DUMPER7_ASSERTS_UGSBitmapFontBox;

// Class UnrealExtent.GSCrowdManagerV1
// 0x00B0 (0x01A0 - 0x00F0)
class UGSCrowdManagerV1 final : public UCrowdManager
{
public:
	uint8                                         Pad_F0[0xB0];                                      // 0x00F0(0x00B0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSCrowdManagerV1")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSCrowdManagerV1")
	}
	static class UGSCrowdManagerV1* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSCrowdManagerV1>();
	}
};
DUMPER7_ASSERTS_UGSCrowdManagerV1;

// Class UnrealExtent.GSDropCanvasPanel
// 0x0010 (0x0168 - 0x0158)
class UGSDropCanvasPanel final : public UCanvasPanel
{
public:
	TMulticastInlineDelegate<void(const TArray<class FString>& DraggedItems, const TArray<class FString>& DraggedFiles, const TArray<class FString>& DraggedFolders)> OnDropEvent; // 0x0158(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSDropCanvasPanel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSDropCanvasPanel")
	}
	static class UGSDropCanvasPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSDropCanvasPanel>();
	}
};
DUMPER7_ASSERTS_UGSDropCanvasPanel;

// Class UnrealExtent.GSEWaterBodyRiver
// 0x0000 (0x02B8 - 0x02B8)
class AGSEWaterBodyRiver final : public AWaterBodyRiver
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSEWaterBodyRiver")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSEWaterBodyRiver")
	}
	static class AGSEWaterBodyRiver* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGSEWaterBodyRiver>();
	}
};
DUMPER7_ASSERTS_AGSEWaterBodyRiver;

// Class UnrealExtent.GSE_AIFuncLib
// 0x0000 (0x0028 - 0x0028)
class UGSE_AIFuncLib final : public UBlueprintFunctionLibrary
{
public:
	static void AISetBT(class AActor* Actor, class UBehaviorTree* BTAsset);
	static void ListenerForgetsActor(class UAIPerceptionComponent* PerceptionComp, class AActor* ActorToForget);
	static void SetAIBTPause(class UBrainComponent* BrainComponent, bool bEnable);
	static void SetAIBTStop(class UBehaviorTreeComponent* BTComp);
	static void SetAISenseConfig(class UAIPerceptionComponent* PerceptionComp, float HearRange, float SightRange, float LoseSightRange, float VisionAngleDegrees, float ASRangeFromLastSeenLoc, bool IsSightDominantSense, bool* IsHearingSet, bool* IsSightSet);
	static void SetPerceptionForgetAll(class UAIPerceptionComponent* PerceptionComp);
	static void SinglePerceptionSetEnable(class UAIPerceptionComponent* PerceptionComp, bool IsHearing, bool bEnable);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSE_AIFuncLib")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSE_AIFuncLib")
	}
	static class UGSE_AIFuncLib* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSE_AIFuncLib>();
	}
};
DUMPER7_ASSERTS_UGSE_AIFuncLib;

// Class UnrealExtent.GSE_AnimationFuncLib
// 0x0000 (0x0028 - 0x0028)
class UGSE_AnimationFuncLib final : public UBlueprintFunctionLibrary
{
public:
	static void AnimationBindAllPossessableObject(class UUserWidget* RootWidget, class UWidgetAnimation* Animation, bool UseDisplayName);
	static void AnimationBindPossessableObjectCS(class UWidgetAnimation* Animation, const struct FSequenceBindingIDInCS& BindingID, class UObject* BindObj, class UObject* Ctx);
	static class UWidgetAnimation* DuplicateAnimation(class UWidgetAnimation* InAnimation, class UObject* Outer_0, class FName Name_0);
	static struct FMovieSceneObjectBindingID GetAnimationBindingIDByDisplayName(class UWidgetAnimation* Animation, const class FName& TargetName);
	static struct FMovieSceneObjectBindingID GetAnimationBindingIDByName(class UWidgetAnimation* Animation, const class FName& TargetName);
	static struct FSequenceBindingIDInCS GetAnimationBindingIDByNameCS(class UWidgetAnimation* Animation, const class FName& TargetName);
	static bool SaveAsset(class UWidgetAnimation* InAnimation, const class FString& Path, const class FString& Name_0);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSE_AnimationFuncLib")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSE_AnimationFuncLib")
	}
	static class UGSE_AnimationFuncLib* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSE_AnimationFuncLib>();
	}
};
DUMPER7_ASSERTS_UGSE_AnimationFuncLib;

// Class UnrealExtent.GSE_AnimDistanceMatchingLibrary
// 0x0000 (0x0028 - 0x0028)
class UGSE_AnimDistanceMatchingLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FSequenceEvaluatorReference AdvanceTimeByDistanceMatchToTarget(const struct FAnimUpdateContext& UpdateContext, const struct FSequenceEvaluatorReference& SequenceEvaluator, float DistanceToTarget, class FName DistanceCurveName, const struct FVector2D& PlayRateClamp);
	static struct FSequenceEvaluatorReference AdvanceTimeBySpeedMatching(const struct FAnimUpdateContext& UpdateContext, const struct FSequenceEvaluatorReference& SequenceEvaluator, float SpeedToMatch, const struct FVector2D& PlayRateClamp);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GSE_AnimDistanceMatchingLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GSE_AnimDistanceMatchingLibrary")
	}
	static class UGSE_AnimDistanceMatchingLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSE_AnimDistanceMatchingLibrary>();
	}
};
DUMPER7_ASSERTS_UGSE_AnimDistanceMatchingLibrary;

// Class UnrealExtent.GSE_AnimFuncLib
// 0x0000 (0x0028 - 0x0028)
class UGSE_AnimFuncLib final : public UBlueprintFunctionLibrary
{
public:
	static float ABPStateMachineGetGlobalWeight(class UAnimInstance* AnimInst, const class FName& StateMachineName, const class FName& StateName);
	static bool AddAnimSequence(class UAnimMontage* TargetMontage, class UAnimSequence* Sequence);
	static bool AddPoint(class UBlendSpace* BlendSpace, class UAnimSequence* PointSequence, const struct FVector& PointValue);
	static bool AddPreviewAssetToSkeleton(class USkeleton* InUSkeleton, const class FString& BoneName, class UObject* PreviewAsset);
	static bool AddSocketToSkeleton(class USkeleton* InUSkeleton, const class FString& BoneName, const class FString& SocketName, const struct FTransform& Offset);
	static void AnimInstanceMontageSetPos(class UAnimInstance* AnimInst, float MontagePos);
	static void AnimMontageGetBlendInAndOutTime(class UAnimMontage* AnimMontage, float* BlendInTime, float* BlendOutTime);
	static struct FTransform AnimMontageGetBoneTransformWS(class UAnimMontage* AnimMontage, const class USkeletalMeshComponent* MeshComponent, class FName BoneName, float Pos, bool IsNeedFixRotator, const struct FRotator& FixRotator);
	static float AnimMontageGetMontageEndTimeForScale(class UAnimMontage* AnimMontage);
	static struct FTransform AnimMontageGetQTEBoneTransform(class UAnimMontage* AnimMontage, const class USkeletalMeshComponent* MeshComponent, class FName BoneName, float Pos);
	static bool AnimMontageGetRootMotionLocationForScale(class UAnimMontage* AnimMontage, struct FVector* OutStartPos, struct FVector* OutEndPos, float LeftScaleTime, float RightScaleTime);
	static bool AnimMontageGetRootMotionRotationForScale(class UAnimMontage* AnimMontage, struct FRotator* OutStartRotation, struct FRotator* OutEndRotation, float LeftScaleTime, float RightScaleTime);
	static bool AnimMontageGetSocketLocationForScale(class UAnimMontage* AnimMontage, struct FVector* OutEndPos, float ScaleTime, const class FString& SocketName);
	static float AnimSequenceFindPosWithDistanceCurve(class UAnimSequence* AnimationSequence, class FName CurveName, float DistanceValue);
	static bool AnimSequenceGetRootMotionLocationForScale(class UAnimSequence* AnimMontage, struct FVector* OutStartPos, struct FVector* OutEndPos, float LeftScaleTime, float RightScaleTime);
	static bool AnimSequenceGetRootMotionRotationForScale(class UAnimSequence* AnimMontage, struct FQuat* OutStartPos, struct FQuat* OutEndPos, float LeftScaleTime, float RightScaleTime);
	static void ApplyDamage(class UDestructibleComponent* Destructible, float DamageAmount, const struct FVector& HitLocation, const struct FVector& ImpulseDir, float ImpulseStrength);
	static void ApplyRadiusDamage(class UDestructibleComponent* Destructible, float BaseDamage, const struct FVector& HurtOrigin, float DamageRadius, float ImpulseStrength, bool bFullDamage);
	static float CalcSlotMontageLocalWeight(class UAnimInstance* AnimInst, const class FName& SlotNodeName);
	static bool ChangeAnimSeqParamAndSave(class UAnimSequence* AnimMontage, bool bRootMotion, bool bForceRootLock);
