#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UnrealExtent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "MovieSceneTracks_structs.hpp"
#include "SlateCore_structs.hpp"
#include "MovieScene_structs.hpp"


namespace SDK
{

// Enum UnrealExtent.ERotateType
// NumValues: 0x0004
enum class ERotateType : uint8
{
	PITCH                                    = 0,
	YAW                                      = 1,
	ROLL                                     = 2,
	ERotateType_MAX                          = 3,
};

// Enum UnrealExtent.EGSNiagaraSysParamType
// NumValues: 0x0007
enum class EGSNiagaraSysParamType : uint8
{
	GSNPT_None                               = 0,
	GSNPT_Float                              = 1,
	GSNPT_Bool                               = 2,
	GSNPT_Int                                = 3,
	GSNPT_Vector                             = 4,
	GSNPT_LinearColor                        = 5,
	GSNPT_MAX                                = 6,
};

// Enum UnrealExtent.EGSToggleActorTickEnableType
// NumValues: 0x0007
enum class EGSToggleActorTickEnableType : uint8
{
	ActorTick                                = 0,
	MoveComp                                 = 1,
	SKMeshComp                               = 2,
	AkComp                                   = 3,
	AIComp                                   = 4,
	INCLUDE_CHILD_ACTOR                      = 5,
	EGSToggleActorTickEnableType_MAX         = 6,
};

// Enum UnrealExtent.EConfigIniFileNames
// NumValues: 0x0012
enum class EConfigIniFileNames : uint8
{
	GEngineIni                               = 0,
	GGameIni                                 = 1,
	GGameUserSettingsIni                     = 2,
	GEditorIni                               = 3,
	GEditorKeyBindingsIni                    = 4,
	GEditorLayoutIni                         = 5,
	GEditorSettingsIni                       = 6,
	GEditorPerProjectIni                     = 7,
	GCompatIni                               = 8,
	GLightmassIni                            = 9,
	GScalabilityIni                          = 10,
	GHardwareIni                             = 11,
	GInputIni                                = 12,
	GRuntimeOptionsIni                       = 13,
	GInstallBundleIni                        = 14,
	GDeviceProfilesIni                       = 15,
	GSGameVersionIni                         = 16,
	EConfigIniFileNames_MAX                  = 17,
};

// Enum UnrealExtent.EGSQualityLevel
// NumValues: 0x0007
enum class EGSQualityLevel : uint8
{
	INVALID                                  = 0,
	LOW                                      = 1,
	MEDIUM                                   = 2,
	HIGH                                     = 3,
	EPIC                                     = 4,
	CINE                                     = 5,
	EGSQualityLevel_MAX                      = 6,
};

// Enum UnrealExtent.EGSCapturedStatType
// NumValues: 0x0005
enum class EGSCapturedStatType : uint8
{
	NONE                                     = 0,
	CYCLE                                    = 1,
	MEMORY                                   = 2,
	NUM                                      = 3,
	EGSCapturedStatType_MAX                  = 4,
};

// Enum UnrealExtent.EEffectTypeManagerCullMode
// NumValues: 0x0004
enum class EEffectTypeManagerCullMode : uint8
{
	Enabled                                  = 0,
	Paused                                   = 1,
	Disabled                                 = 2,
	EEffectTypeManagerCullMode_MAX           = 3,
};

// Enum UnrealExtent.EBGWNATType
// NumValues: 0x000C
enum class EBGWNATType : uint8
{
	SONY_NAT_TYPE_UNKNOWN                    = 0,
	SONY_NAT_TYPE_1                          = 1,
	SONY_NAT_TYPE_2                          = 2,
	SONY_NAT_TYPE_3                          = 3,
	STEAM_IS_BEHIND_NAT                      = 4,
	STEAM_NOT_BEHIND_NAT                     = 5,
	EOS_NAT_Unknown                          = 6,
	EOS_NAT_Open                             = 7,
	EOS_NAT_Moderate                         = 8,
	EOS_NAT_Strict                           = 9,
	NotSupport                               = 10,
	EBGWNATType_MAX                          = 11,
};

// Enum UnrealExtent.EScalabilityQuality
// NumValues: 0x0007
enum class EScalabilityQuality : uint8
{
	INVALID                                  = 0,
	LOW                                      = 1,
	MEDIUM                                   = 2,
	HIGH                                     = 3,
	EPIC                                     = 4,
	CINE                                     = 5,
	EScalabilityQuality_MAX                  = 6,
};

// Enum UnrealExtent.EGSScreenMode
// NumValues: 0x0004
enum class EGSScreenMode : uint8
{
	FULL_SCREEN                              = 0,
	WINDOWED_NO_BORDER                       = 1,
	WINDOWED                                 = 2,
	EGSScreenMode_MAX                        = 3,
};

// Enum UnrealExtent.EGSPriorityMode
// NumValues: 0x0003
enum class EGSPriorityMode : uint8
{
	QUALITY_PRIOR                            = 0,
	PERF_PRIOR                               = 1,
	EGSPriorityMode_MAX                      = 2,
};

// Enum UnrealExtent.EGSGraphicsMemoryMode
// NumValues: 0x0004
enum class EGSGraphicsMemoryMode : uint8
{
	DEDICATED                                = 0,
	SHARED                                   = 1,
	TOTAL                                    = 2,
	EGSGraphicsMemoryMode_MAX                = 3,
};

// Enum UnrealExtent.UGSE_BULKDATA_LOCKMODE
// NumValues: 0x0003
enum class EUGSE_BULKDATA_LOCKMODE : uint8
{
	LOCK_READ_ONLY                           = 1,
	LOCK_READ_WRITE                          = 2,
	LOCK_READ_MAX                            = 3,
};

// Enum UnrealExtent.ERRIndicatorType
// NumValues: 0x0006
enum class ERRIndicatorType : uint8
{
	Top                                      = 0,
	Bottom                                   = 1,
	Left                                     = 2,
	Right                                    = 3,
	Middle                                   = 4,
	ERRIndicatorType_MAX                     = 5,
};

// Enum UnrealExtent.EGSUIConflictNavigationType
// NumValues: 0x0004
enum class EGSUIConflictNavigationType : uint8
{
	Gamepad_DPad                             = 0,
	Gamepad_Left                             = 1,
	Keyboard                                 = 2,
	EGSUIConflictNavigationType_MAX          = 3,
};

// Enum UnrealExtent.ESampleType
// NumValues: 0x0003
enum class ESampleType : uint8
{
	Nearest                                  = 0,
	Bilinear                                 = 1,
	ESampleType_MAX                          = 2,
};

// Enum UnrealExtent.EPS5UsbStorageErrorCode
// NumValues: 0x000A
enum class EPS5UsbStorageErrorCode : uint8
{
	DeviceDoesNotExist                       = 0,
	TargetDirNotExist                        = 1,
	TargetDirIsUsedByAnotherProcess          = 2,
	TargetDirIsNotInParamJson                = 3,
	MapNumMax                                = 4,
	TargetDirIsFile                          = 5,
	MkSubDirFailed                           = 6,
	Unknown                                  = 7,
	Success                                  = 8,
	EPS5UsbStorageErrorCode_MAX              = 9,
};

// Enum UnrealExtent.EPS5RequestMapUsbErrorCode
// NumValues: 0x000A
enum class EPS5RequestMapUsbErrorCode : uint8
{
	DeviceDoesNotExist                       = 0,
	TargetDirNotExist                        = 1,
	TargetDirIsUsedByAnotherProcess          = 2,
	TargetDirIsNotInParamJson                = 3,
	MkSubDirFailed                           = 4,
	MapNumMax                                = 5,
	Unknown                                  = 6,
	Success                                  = 7,
	NotSupport                               = 8,
	EPS5RequestMapUsbErrorCode_MAX           = 9,
};

// Enum UnrealExtent.EPS5RequestUnMapUsbErrorCode
// NumValues: 0x0006
enum class EPS5RequestUnMapUsbErrorCode : uint8
{
	DeviceDoesNotExist                       = 0,
	TargetDirNotMap                          = 1,
	Unknown                                  = 2,
	Success                                  = 3,
	NotSupport                               = 4,
	EPS5RequestUnMapUsbErrorCode_MAX         = 5,
};

// Enum UnrealExtent.EPS5UsbWriteErrorCode
// NumValues: 0x0008
enum class EPS5UsbWriteErrorCode : uint8
{
	NoAvailableSpace                         = 0,
	OpenIOError                              = 1,
	WriteIOError                             = 2,
	NoUsbStorageDevice                       = 3,
	Unknown                                  = 4,
	Success                                  = 5,
	NotSupport                               = 6,
	EPS5UsbWriteErrorCode_MAX                = 7,
};

// Enum UnrealExtent.EPS5UsbSelectErrorCode
// NumValues: 0x0008
enum class EPS5UsbSelectErrorCode : uint8
{
	UsrNotInit                               = 0,
	UsrParamError                            = 1,
	OperationCantBeUsed                      = 2,
	UsrCancel                                = 3,
	Unknown                                  = 4,
	Success                                  = 5,
	NotSupport                               = 6,
	EPS5UsbSelectErrorCode_MAX               = 7,
};

// Enum UnrealExtent.EGSBitmapJustification
// NumValues: 0x0004
enum class EGSBitmapJustification : uint8
{
	Left                                     = 0,
	Middle                                   = 1,
	Right                                    = 2,
	EGSBitmapJustification_MAX               = 3,
};

// Enum UnrealExtent.EStatUISimulatedGraphicsCard
// NumValues: 0x000E
enum class EStatUISimulatedGraphicsCard : uint8
{
	GTX_1050Ti                               = 0,
	GTX_1660                                 = 1,
	GTX_1660Ti                               = 2,
	RTX_2060                                 = 3,
	RTX_2060S                                = 4,
	RTX_2070                                 = 5,
	RTX_2080                                 = 6,
	RTX_2080Ti                               = 7,
	RTX_3060                                 = 8,
	RTX_3070                                 = 9,
	RTX_3080                                 = 10,
	RTX_3080Ti                               = 11,
	RTX_3090                                 = 12,
	EStatUISimulatedGraphicsCard_MAX         = 13,
};

// ScriptStruct UnrealExtent.AutoMovementViewingPattern
// 0x0058 (0x0058 - 0x0000)
struct FAutoMovementViewingPattern final
{
public:
	class FString                                 PathPointsFilePath;                                // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSparseVersion;                                 // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVisualizeScatteredPoints;                         // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PointInstanceScale;                                // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               InitialRotation;                                   // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FIntVector                             DirectionCount;                                    // 0x0030(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TotalPitchDegree;                                  // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TotalYawDegree;                                    // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DistanceCheckBias;                                 // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotationCheckBias;                                 // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PoseTickTotalCount;                                // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseVirtualPlayer;                                 // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAttractEnemy;                                     // 0x0051(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAutoMovementViewingPattern;

// ScriptStruct UnrealExtent.AutoMovementHeatmapConfig
// 0x0068 (0x0068 - 0x0000)
struct FAutoMovementHeatmapConfig final
{
public:
	struct FVector                                HeatmapPlaneOrigin;                                // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HeatmapPlaneSize;                                  // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 HeatmapTexParentFolder;                            // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 HeatmapBaseImgPath;                                // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 HeatmapProfilingFilePath;                          // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HeatmapIntensityScale;                             // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         HeatmapTileCount;                                  // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAutoMovementHeatmapConfig;

// ScriptStruct UnrealExtent.GSPathPointStatInfo
// 0x0078 (0x0078 - 0x0000)
struct FGSPathPointStatInfo final
{
public:
	TMap<class FString, float>                    StatNameAndValue;                                  // 0x0000(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FVector                                position;                                          // 0x0050(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Duration;                                          // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGSPathPointStatInfo;

// ScriptStruct UnrealExtent.CapturedInfoSequencePerPoint
// 0x0018 (0x0018 - 0x0000)
struct FCapturedInfoSequencePerPoint final
{
public:
	TArray<float>                                 CapturedInfoSequencePerPoint;                      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	EGSCapturedStatType                           StatType;                                          // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCapturedInfoSequencePerPoint;

// ScriptStruct UnrealExtent.CapturedInfoArrayPerPoint
// 0x0050 (0x0050 - 0x0000)
struct FCapturedInfoArrayPerPoint final
{
public:
	TMap<class FString, struct FCapturedInfoSequencePerPoint> InfoMap;                               // 0x0000(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCapturedInfoArrayPerPoint;

// ScriptStruct UnrealExtent.AsyncLineTraceSingleResult
// 0x0018 (0x0018 - 0x0000)
struct FAsyncLineTraceSingleResult final
{
public:
	int32                                         ReqID;                                             // 0x0000(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHitResult>                     HitResults;                                        // 0x0008(0x0010)(BlueprintVisible, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAsyncLineTraceSingleResult;

// ScriptStruct UnrealExtent.AsyncLineTraceReq
// 0x0038 (0x0038 - 0x0000)
struct FAsyncLineTraceReq final
{
public:
	int32                                         ReqID;                                             // 0x0000(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                TraceStart;                                        // 0x0008(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TraceEnd;                                          // 0x0020(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAsyncLineTraceReq;

// ScriptStruct UnrealExtent.AsyncLineTraceReqArray
// 0x0010 (0x0010 - 0x0000)
struct FAsyncLineTraceReqArray final
{
public:
	TArray<struct FAsyncLineTraceReq>             ReqArr;                                            // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAsyncLineTraceReqArray;

// ScriptStruct UnrealExtent.BGUMaterialParameterInfo
// 0x0010 (0x0020 - 0x0010)
struct FBGUMaterialParameterInfo final : public FMaterialParameterInfo
{
public:
	class UMaterialFunctionInterface*             LayerMaterial;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialFunctionInterface*             BlendMaterial;                                     // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBGUMaterialParameterInfo;

// ScriptStruct UnrealExtent.BGUScalarParameterInfoAndCurve
// 0x0118 (0x0118 - 0x0000)
struct FBGUScalarParameterInfoAndCurve final
{
public:
	struct FMaterialParameterInfo                 ParameterInfo;                                     // 0x0000(0x0010)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBGUMaterialParameterInfo              BGUParameterInfo;                                  // 0x0010(0x0020)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovieSceneFloatChannel                ParameterCurve;                                    // 0x0030(0x00E8)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBGUScalarParameterInfoAndCurve;

// ScriptStruct UnrealExtent.BGUVectorParameterInfoAndCurves
// 0x02E8 (0x02E8 - 0x0000)
struct FBGUVectorParameterInfoAndCurves final
{
public:
	struct FMaterialParameterInfo                 ParameterInfo;                                     // 0x0000(0x0010)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBGUMaterialParameterInfo              BGUParameterInfo;                                  // 0x0010(0x0020)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovieSceneFloatChannel                XCurve;                                            // 0x0030(0x00E8)(NativeAccessSpecifierPublic)
	struct FMovieSceneFloatChannel                YCurve;                                            // 0x0118(0x00E8)(NativeAccessSpecifierPublic)
	struct FMovieSceneFloatChannel                ZCurve;                                            // 0x0200(0x00E8)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBGUVectorParameterInfoAndCurves;

// ScriptStruct UnrealExtent.BGUColorParameterInfoAndCurves
// 0x03D0 (0x03D0 - 0x0000)
struct FBGUColorParameterInfoAndCurves final
{
public:
	struct FMaterialParameterInfo                 ParameterInfo;                                     // 0x0000(0x0010)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBGUMaterialParameterInfo              BGUParameterInfo;                                  // 0x0010(0x0020)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovieSceneFloatChannel                RedCurve;                                          // 0x0030(0x00E8)(NativeAccessSpecifierPublic)
	struct FMovieSceneFloatChannel                GreenCurve;                                        // 0x0118(0x00E8)(NativeAccessSpecifierPublic)
	struct FMovieSceneFloatChannel                BlueCurve;                                         // 0x0200(0x00E8)(NativeAccessSpecifierPublic)
	struct FMovieSceneFloatChannel                AlphaCurve;                                        // 0x02E8(0x00E8)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBGUColorParameterInfoAndCurves;

// ScriptStruct UnrealExtent.BGUMovieSceneComponentMaterialSectionTemplate
// 0x0038 (0x00B8 - 0x0080)
struct FBGUMovieSceneComponentMaterialSectionTemplate final : public FMovieSceneParameterSectionTemplate
{
public:
	TArray<struct FBGUScalarParameterInfoAndCurve> ScalarParams;                                     // 0x0080(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FBGUVectorParameterInfoAndCurves> VectorParams;                                    // 0x0090(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FBGUColorParameterInfoAndCurves> ColorParams;                                      // 0x00A0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	int32                                         MaterialIndex;                                     // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAffectClothMaterial;                              // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAffectAllMaterial;                                // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B6[0x2];                                       // 0x00B6(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FBGUMovieSceneComponentMaterialSectionTemplate;

// ScriptStruct UnrealExtent.IntPtr
// 0x0008 (0x0008 - 0x0000)
struct FIntPtr final
{
public:
	int32                                         LowerBits;                                         // 0x0000(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         HigherBits;                                        // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FIntPtr;

// ScriptStruct UnrealExtent.ColorBufferPtr
// 0x0008 (0x0008 - 0x0000)
struct FColorBufferPtr final
{
public:
	uint8                                         B;                                                 // 0x0000(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         G;                                                 // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         R;                                                 // 0x0002(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         A;                                                 // 0x0003(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AlignmentDummy;                                    // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FColorBufferPtr;

// ScriptStruct UnrealExtent.GSInputActionKeyMapping
// 0x0014 (0x0014 - 0x0000)
struct FGSInputActionKeyMapping final
{
public:
	class FName                                   ActionName;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bShift : 1;                                        // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCtrl : 1;                                         // 0x0008(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAlt : 1;                                          // 0x0008(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCmd : 1;                                          // 0x0008(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Key;                                               // 0x000C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGSInputActionKeyMapping;

// ScriptStruct UnrealExtent.GSInputAxisKeyMapping
// 0x0014 (0x0014 - 0x0000)
struct FGSInputAxisKeyMapping final
{
public:
	class FName                                   AxisName;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Key;                                               // 0x000C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGSInputAxisKeyMapping;

// ScriptStruct UnrealExtent.GSNotifyEventTimeInfo
// 0x0008 (0x0008 - 0x0000)
struct FGSNotifyEventTimeInfo final
{
public:
	float                                         TriggerTime;                                       // 0x0000(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndTriggerTime;                                    // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGSNotifyEventTimeInfo;

// ScriptStruct UnrealExtent.GSNiagaraSysParam
// 0x0040 (0x0040 - 0x0000)
struct FGSNiagaraSysParam final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGSNiagaraSysParamType                        ParamType;                                         // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FloatValue;                                        // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          BoolValue;                                         // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         IntValue;                                          // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                VectorValue;                                       // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           LinearColorValue;                                  // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGSNiagaraSysParam;

// ScriptStruct UnrealExtent.GSMontageAndNotifiesWarp
// 0x0018 (0x0018 - 0x0000)
struct FGSMontageAndNotifiesWarp final
{
public:
	class UAnimMontage*                           AM;                                                // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAnimNotifyEvent>               ANEArr;                                            // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGSMontageAndNotifiesWarp;

// ScriptStruct UnrealExtent.AnimNotifyEventSimple
// 0x0038 (0x0038 - 0x0000)
struct FAnimNotifyEventSimple final
{
public:
	float                                         StartTime;                                         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NotifyName;                                        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimNotify*                            Notify;                                            // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimNotifyState*                       NotifyStateClass;                                  // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GuidString;                                        // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TrackIndex;                                        // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAnimNotifyEventSimple;

// ScriptStruct UnrealExtent.BehaviorTreeNodeData
// 0x0010 (0x0010 - 0x0000)
struct FBehaviorTreeNodeData final
{
public:
	TArray<class UBTTaskNode*>                    TaskNodeList;                                      // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBehaviorTreeNodeData;

// ScriptStruct UnrealExtent.GSCapturedStatResult
// 0x0018 (0x0018 - 0x0000)
struct FGSCapturedStatResult final
{
public:
	class FString                                 StatName;                                          // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGSCapturedStatType                           StatType;                                          // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGSCapturedStatResult;

// ScriptStruct UnrealExtent.CachedActivityIntentReceivedParamCS
// 0x0030 (0x0030 - 0x0000)
struct FCachedActivityIntentReceivedParamCS final
{
public:
	class FString                                 UserId;                                            // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ActivityId;                                        // 0x0010(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SessionId;                                         // 0x0020(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCachedActivityIntentReceivedParamCS;

// ScriptStruct UnrealExtent.GamePresets
// 0x0020 (0x0020 - 0x0000)
struct FGamePresets final
{
public:
	int32                                         difficulty;                                        // 0x0000(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         invertVerticalViewFor1stPersonView;                // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         invertHorizontalViewFor1stPersonView;              // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         invertVerticalViewFor3rdPersonView;                // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         invertHorizontalViewFor3rdPersonView;              // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         displaySubtitles;                                  // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         audioLanguage;                                     // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGamePresets;

// ScriptStruct UnrealExtent.GridlyTableCell
// 0x0030 (0x0030 - 0x0000)
struct FGridlyTableCell final
{
public:
	class FString                                 ColumnId;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DependencyStatus;                                  // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGridlyTableCell;

// ScriptStruct UnrealExtent.GridlyTableRow
// 0x0030 (0x0030 - 0x0000)
struct FGridlyTableRow final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Path;                                              // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGridlyTableCell>               Cells;                                             // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGridlyTableRow;

// ScriptStruct UnrealExtent.GSConnectionInfo
// 0x0058 (0x0058 - 0x0000)
struct FGSConnectionInfo final
{
public:
	class FString                                 URLInfo;                                           // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InSpeedByte;                                       // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutSpeedByte;                                      // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        NetLagMS;                                          // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       PlayerId;                                          // 0x0020(0x0030)(BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PktLostRate;                                       // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGSConnectionInfo;

// ScriptStruct UnrealExtent.SequenceBindingIDInCS
// 0x0018 (0x0018 - 0x0000)
struct FSequenceBindingIDInCS final
{
public:
	int32                                         SequenceID;                                        // 0x0000(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Space;                                             // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  Guid;                                              // 0x0008(0x0010)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSequenceBindingIDInCS;

// ScriptStruct UnrealExtent.GSScalabilityQualities
// 0x0010 (0x0010 - 0x0000)
struct FGSScalabilityQualities final
{
public:
	float                                         ResolutionQualityScale;                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EScalabilityQuality                           ViewDistanceQuality;                               // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EScalabilityQuality                           AntiAliasingQuality;                               // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EScalabilityQuality                           ShadowQuality;                                     // 0x0006(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EScalabilityQuality                           PostProcessQuality;                                // 0x0007(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EScalabilityQuality                           TextureQuality;                                    // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EScalabilityQuality                           EffectsQuality;                                    // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EScalabilityQuality                           FoliageQuality;                                    // 0x000A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EScalabilityQuality                           ShadingQuality;                                    // 0x000B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EScalabilityQuality                           GlobalIlluminationQuality;                         // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EScalabilityQuality                           ReflectionQuality;                                 // 0x000D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGSScalabilityQualities;

// ScriptStruct UnrealExtent.GSMonitorInfo
// 0x0038 (0x0038 - 0x0000)
struct FGSMonitorInfo final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ID;                                                // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPrimary;                                        // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              NativeResolution;                                  // 0x0024(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              DisplayResolution;                                 // 0x002C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGSMonitorInfo;

// ScriptStruct UnrealExtent.ProjWidgetInfo
// 0x0070 (0x0070 - 0x0000)
struct FProjWidgetInfo final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                WorldPos;                                          // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGSRoundRectQuick*                      RoundRect;                                         // 0x0020(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseRoundRectCalSize;                               // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              RoundRectCalSize;                                  // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGSRoundRectQuick*                      HideRoundRect;                                     // 0x0040(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          NeedCheckProjView;                                 // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ShowDistanceMax;                                   // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseDistanceZoom;                                   // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinScale;                                          // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxScale;                                          // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScaleRate;                                         // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         XMinScale;                                         // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         XMaxScale;                                         // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         YMinScale;                                         // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         YMaxScale;                                         // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FProjWidgetInfo;

// ScriptStruct UnrealExtent.ProjResult
// 0x0038 (0x0038 - 0x0000)
struct FProjResult final
{
public:
	bool                                          IsInSight;                                         // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsInRound;                                         // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              ScrPos;                                            // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RectAngle;                                         // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IndicatorType;                                     // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              SizeScale;                                         // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FProjResult;

// ScriptStruct UnrealExtent.TextFoldingConfig
// 0x0020 (0x0020 - 0x0000)
struct FTextFoldingConfig final
{
public:
	int32                                         BeginIndex;                                        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EndIndex;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DisplayWidth;                                      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SubstituteString;                                  // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTextFoldingConfig;

// ScriptStruct UnrealExtent.ActorInfo
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x04) FActorInfo final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FActorInfo;

// ScriptStruct UnrealExtent.GSRichCaltureConfig
// 0x0014 (0x0014 - 0x0000)
struct FGSRichCaltureConfig final
{
public:
	float                                         LinePercent;                                       // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                Margin;                                            // 0x0004(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGSRichCaltureConfig;

// ScriptStruct UnrealExtent.Mesh
// 0x0020 (0x0020 - 0x0000)
struct FMesh final
{
public:
	TArray<int32>                                 Indices;                                           // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector3f>                      Positions;                                         // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMesh;

// ScriptStruct UnrealExtent.LandscapeReaderWeightData
// 0x0048 (0x0048 - 0x0000)
struct FLandscapeReaderWeightData final
{
public:
	class FString                                 LayerName;                                         // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PhysicMatName;                                     // 0x0010(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         SurfaceType;                                       // 0x0020(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           LayerUsageDebugColor;                              // 0x0024(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 arrData;                                           // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLandscapeReaderWeightData;

// ScriptStruct UnrealExtent.LandscapeReaderAllWeightData
// 0x0010 (0x0010 - 0x0000)
struct FLandscapeReaderAllWeightData final
{
public:
	TArray<struct FLandscapeReaderWeightData>     AllLayerData;                                      // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLandscapeReaderAllWeightData;

// ScriptStruct UnrealExtent.LayerData
// 0x0048 (0x0048 - 0x0000)
struct FLayerData final
{
public:
	class FString                                 LayerName;                                         // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PhysicMatName;                                     // 0x0010(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         SurfaceType;                                       // 0x0020(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           LayerUsageDebugColor;                              // 0x0024(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
