#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: V8

#include "Basic.hpp"

#include "V8_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function V8.DirectoryWatcher.Contains
// 0x0018 (0x0018 - 0x0000)
struct DirectoryWatcher_Contains final
{
public:
	class FString                                 file;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DirectoryWatcher_Contains;

// Function V8.DirectoryWatcher.Watch
// 0x0010 (0x0010 - 0x0000)
struct DirectoryWatcher_Watch final
{
public:
	class FString                                 Directory;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DirectoryWatcher_Watch;

// Function V8.JavascriptComponent.Expose
// 0x0018 (0x0018 - 0x0000)
struct JavascriptComponent_Expose final
{
public:
	class FString                                 ExposedAs;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                Object;                                            // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptComponent_Expose;

// Function V8.JavascriptComponent.Invoke
// 0x0008 (0x0008 - 0x0000)
struct JavascriptComponent_Invoke final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptComponent_Invoke;

// Function V8.JavascriptComponent.ResolveAsset
// 0x0018 (0x0018 - 0x0000)
struct JavascriptComponent_ResolveAsset final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTryLoad;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptComponent_ResolveAsset;

// Function V8.JavascriptComponent.ResolveClass
// 0x0010 (0x0010 - 0x0000)
struct JavascriptComponent_ResolveClass final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptComponent_ResolveClass;

// Function V8.JavascriptContext.CreateInspector
// 0x0004 (0x0004 - 0x0000)
struct JavascriptContext_CreateInspector final
{
public:
	int32                                         Port;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptContext_CreateInspector;

// Function V8.JavascriptContext.Expose
// 0x0018 (0x0018 - 0x0000)
struct JavascriptContext_Expose final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                Object;                                            // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptContext_Expose;

// Function V8.JavascriptContext.FindPathFile
// 0x0030 (0x0030 - 0x0000)
struct JavascriptContext_FindPathFile final
{
public:
	class FString                                 TargetRootPath;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TargetFileName;                                    // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         OutFiles;                                          // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptContext_FindPathFile;

// Function V8.JavascriptContext.GetScriptFileFullPath
// 0x0020 (0x0020 - 0x0000)
struct JavascriptContext_GetScriptFileFullPath final
{
public:
	class FString                                 Filename;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptContext_GetScriptFileFullPath;

// Function V8.JavascriptContext.ReadScriptFile
// 0x0020 (0x0020 - 0x0000)
struct JavascriptContext_ReadScriptFile final
{
public:
	class FString                                 Filename;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptContext_ReadScriptFile;

// Function V8.JavascriptContext.RegisterConsoleCommand
// 0x0030 (0x0030 - 0x0000)
struct JavascriptContext_RegisterConsoleCommand final
{
public:
	class FString                                 Command;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Help;                                              // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FJavascriptFunction                    Function;                                          // 0x0020(0x0010)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptContext_RegisterConsoleCommand;

// Function V8.JavascriptContext.RunFile
// 0x0010 (0x0010 - 0x0000)
struct JavascriptContext_RunFile final
{
public:
	class FString                                 Filename;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptContext_RunFile;

// Function V8.JavascriptContext.RunScript
// 0x0028 (0x0028 - 0x0000)
struct JavascriptContext_RunScript final
{
public:
	class FString                                 Script;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutput;                                           // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptContext_RunScript;

// Function V8.JavascriptContext.SetContextId
// 0x0010 (0x0010 - 0x0000)
struct JavascriptContext_SetContextId final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptContext_SetContextId;

// Function V8.JavascriptContext.UnregisterConsoleCommand
// 0x0010 (0x0010 - 0x0000)
struct JavascriptContext_UnregisterConsoleCommand final
{
public:
	class FString                                 Command;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptContext_UnregisterConsoleCommand;

// Function V8.JavascriptContext.WriteAliases
// 0x0018 (0x0018 - 0x0000)
struct JavascriptContext_WriteAliases final
{
public:
	class FString                                 Target;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_JavascriptContext_WriteAliases;

// Function V8.JavascriptContext.WriteDTS
// 0x0018 (0x0018 - 0x0000)
struct JavascriptContext_WriteDTS final
{
public:
	class FString                                 Target;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludingTooltip;                                 // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_JavascriptContext_WriteDTS;

// Function V8.JavascriptContext.IsDebugContext
// 0x0001 (0x0001 - 0x0000)
struct JavascriptContext_IsDebugContext final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptContext_IsDebugContext;

// Function V8.JavascriptGlobalDelegates.Bind
// 0x0010 (0x0010 - 0x0000)
struct JavascriptGlobalDelegates_Bind final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptGlobalDelegates_Bind;

// Function V8.JavascriptGlobalDelegates.LevelAddedToWorld
// 0x0010 (0x0010 - 0x0000)
struct JavascriptGlobalDelegates_LevelAddedToWorld final
{
public:
	class ULevel*                                 Level;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWorld*                                 World;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptGlobalDelegates_LevelAddedToWorld;

// Function V8.JavascriptGlobalDelegates.LevelRemovedFromWorld
// 0x0010 (0x0010 - 0x0000)
struct JavascriptGlobalDelegates_LevelRemovedFromWorld final
{
public:
	class ULevel*                                 Level;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWorld*                                 World;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptGlobalDelegates_LevelRemovedFromWorld;

// Function V8.JavascriptGlobalDelegates.OnActorLabelChanged
// 0x0008 (0x0008 - 0x0000)
struct JavascriptGlobalDelegates_OnActorLabelChanged final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptGlobalDelegates_OnActorLabelChanged;

// Function V8.JavascriptGlobalDelegates.OnAssetLoaded
// 0x0008 (0x0008 - 0x0000)
struct JavascriptGlobalDelegates_OnAssetLoaded final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptGlobalDelegates_OnAssetLoaded;

// Function V8.JavascriptGlobalDelegates.OnObjectModified
// 0x0008 (0x0008 - 0x0000)
struct JavascriptGlobalDelegates_OnObjectModified final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptGlobalDelegates_OnObjectModified;

// Function V8.JavascriptGlobalDelegates.OnObjectPropertyChanged_Friendly
// 0x0050 (0x0050 - 0x0000)
struct JavascriptGlobalDelegates_OnObjectPropertyChanged_Friendly final
{
public:
	class UObject*                                InObject;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TFieldPath<class FProperty>                   Property;                                          // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TFieldPath<class FProperty>                   MemberProperty;                                    // 0x0028(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ChangeType;                                        // 0x0048(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_JavascriptGlobalDelegates_OnObjectPropertyChanged_Friendly;

// Function V8.JavascriptGlobalDelegates.OnObjectSaved
// 0x0008 (0x0008 - 0x0000)
struct JavascriptGlobalDelegates_OnObjectSaved final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptGlobalDelegates_OnObjectSaved;

// Function V8.JavascriptGlobalDelegates.OnPostDuplicate_Friendly
// 0x0010 (0x0010 - 0x0000)
struct JavascriptGlobalDelegates_OnPostDuplicate_Friendly final
{
public:
	class UWorld*                                 World;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDuplicateForPIE;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_JavascriptGlobalDelegates_OnPostDuplicate_Friendly;

// Function V8.JavascriptGlobalDelegates.OnPostWorldCreation
// 0x0008 (0x0008 - 0x0000)
struct JavascriptGlobalDelegates_OnPostWorldCreation final
{
public:
	class UWorld*                                 World;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptGlobalDelegates_OnPostWorldCreation;

// Function V8.JavascriptGlobalDelegates.OnPostWorldInitialization_Friendly
// 0x0008 (0x0008 - 0x0000)
struct JavascriptGlobalDelegates_OnPostWorldInitialization_Friendly final
{
public:
	class UWorld*                                 World;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptGlobalDelegates_OnPostWorldInitialization_Friendly;

// Function V8.JavascriptGlobalDelegates.OnPreObjectPropertyChanged_Friendly
// 0x0048 (0x0048 - 0x0000)
struct JavascriptGlobalDelegates_OnPreObjectPropertyChanged_Friendly final
{
public:
	class UObject*                                InObject;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TFieldPath<class FProperty>                   Property;                                          // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TFieldPath<class FProperty>                   MemberProperty;                                    // 0x0028(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptGlobalDelegates_OnPreObjectPropertyChanged_Friendly;

// Function V8.JavascriptGlobalDelegates.OnPreWorldFinishDestroy
// 0x0008 (0x0008 - 0x0000)
struct JavascriptGlobalDelegates_OnPreWorldFinishDestroy final
{
public:
	class UWorld*                                 World;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptGlobalDelegates_OnPreWorldFinishDestroy;

// Function V8.JavascriptGlobalDelegates.OnPreWorldInitialization_Friendly
// 0x0008 (0x0008 - 0x0000)
struct JavascriptGlobalDelegates_OnPreWorldInitialization_Friendly final
{
public:
	class UWorld*                                 World;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptGlobalDelegates_OnPreWorldInitialization_Friendly;

// Function V8.JavascriptGlobalDelegates.OnWorldCleanup
// 0x0010 (0x0010 - 0x0000)
struct JavascriptGlobalDelegates_OnWorldCleanup final
{
public:
	class UWorld*                                 World;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSessionEnded;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCleanupResources;                                 // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_JavascriptGlobalDelegates_OnWorldCleanup;

// Function V8.JavascriptGlobalDelegates.PackageCreatedForLoad
// 0x0008 (0x0008 - 0x0000)
struct JavascriptGlobalDelegates_PackageCreatedForLoad final
{
public:
	class UPackage*                               InPackage;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptGlobalDelegates_PackageCreatedForLoad;

// Function V8.JavascriptGlobalDelegates.PostApplyLevelOffset
// 0x0030 (0x0030 - 0x0000)
struct JavascriptGlobalDelegates_PostApplyLevelOffset final
{
public:
	class ULevel*                                 Level;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWorld*                                 World;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Offset;                                            // 0x0010(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Flag;                                              // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_JavascriptGlobalDelegates_PostApplyLevelOffset;

// Function V8.JavascriptGlobalDelegates.PostLoadMapWithWorld
// 0x0008 (0x0008 - 0x0000)
struct JavascriptGlobalDelegates_PostLoadMapWithWorld final
{
public:
	class UWorld*                                 World;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptGlobalDelegates_PostLoadMapWithWorld;

// Function V8.JavascriptGlobalDelegates.PreLoadMap
// 0x0010 (0x0010 - 0x0000)
struct JavascriptGlobalDelegates_PreLoadMap final
{
public:
	class FString                                 MapName;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptGlobalDelegates_PreLoadMap;

// Function V8.JavascriptGlobalDelegates.RedirectorFollowed
// 0x0018 (0x0018 - 0x0000)
struct JavascriptGlobalDelegates_RedirectorFollowed final
{
public:
	class FString                                 PackageName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                Redirector;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptGlobalDelegates_RedirectorFollowed;

// Function V8.JavascriptGlobalDelegates.Unbind
// 0x0010 (0x0010 - 0x0000)
struct JavascriptGlobalDelegates_Unbind final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptGlobalDelegates_Unbind;

// Function V8.JavascriptIsolate.CreateContext
// 0x0008 (0x0008 - 0x0000)
struct JavascriptIsolate_CreateContext final
{
public:
	class UJavascriptContext*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptIsolate_CreateContext;

// Function V8.JavascriptIsolate.GetHeapStatistics
// 0x0020 (0x0020 - 0x0000)
struct JavascriptIsolate_GetHeapStatistics final
{
public:
	struct FJavascriptHeapStatistics              Statistics;                                        // 0x0000(0x0020)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptIsolate_GetHeapStatistics;

// Function V8.JavascriptIsolate.Init
// 0x0001 (0x0001 - 0x0000)
struct JavascriptIsolate_Init final
{
public:
	bool                                          bIsEditor;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptIsolate_Init;

// Function V8.JavascriptLibrary.Actor_GetWorld
// 0x0010 (0x0010 - 0x0000)
struct JavascriptLibrary_Actor_GetWorld final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWorld*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptLibrary_Actor_GetWorld;

// Function V8.JavascriptLibrary.AddDynamicBinding
// 0x0010 (0x0010 - 0x0000)
struct JavascriptLibrary_AddDynamicBinding final
{
public:
	class UClass*                                 Outer_0;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicBlueprintBinding*               BindingObject;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptLibrary_AddDynamicBinding;

// Function V8.JavascriptLibrary.AddMessage
// 0x0002 (0x0002 - 0x0000)
struct JavascriptLibrary_AddMessage final
{
public:
	struct FJavascriptStat                        Stat;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	EJavascriptStatOperation                      InStatOperation;                                   // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptLibrary_AddMessage;

// Function V8.JavascriptLibrary.AddMessage_float
// 0x000C (0x000C - 0x0000)
struct JavascriptLibrary_AddMessage_float final
{
public:
	struct FJavascriptStat                        Stat;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	EJavascriptStatOperation                      InStatOperation;                                   // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Value;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsCycle;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_JavascriptLibrary_AddMessage_float;

// Function V8.JavascriptLibrary.AddMessage_int
// 0x000C (0x000C - 0x0000)
struct JavascriptLibrary_AddMessage_int final
{
public:
	struct FJavascriptStat                        Stat;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	EJavascriptStatOperation                      InStatOperation;                                   // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Value;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsCycle;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_JavascriptLibrary_AddMessage_int;

// Function V8.JavascriptLibrary.CallJS
// 0x0018 (0x0018 - 0x0000)
struct JavascriptLibrary_CallJS final
{
public:
	struct FJavascriptFunction                    Function;                                          // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	struct FJavascriptStubStruct                  CustomStruct;                                      // 0x0010(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_JavascriptLibrary_CallJS;

// Function V8.JavascriptLibrary.ClipboardCopy
// 0x0010 (0x0010 - 0x0000)
struct JavascriptLibrary_ClipboardCopy final
{
public:
	class FString                                 String;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptLibrary_ClipboardCopy;

// Function V8.JavascriptLibrary.ClipboardPaste
// 0x0010 (0x0010 - 0x0000)
struct JavascriptLibrary_ClipboardPaste final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptLibrary_ClipboardPaste;

// Function V8.JavascriptLibrary.ConvertRelativePathToFull
// 0x0028 (0x0028 - 0x0000)
struct JavascriptLibrary_ConvertRelativePathToFull final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RelativePath;                                      // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptLibrary_ConvertRelativePathToFull;

// Function V8.JavascriptLibrary.CreateEnum
// 0x0038 (0x0038 - 0x0000)
struct JavascriptLibrary_CreateEnum final
{
public:
	class UObject*                                Outer_0;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           DisplayNames;                                      // 0x0010(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         Flags_0;                                           // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class UEnum*                                  ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptLibrary_CreateEnum;

// Function V8.JavascriptLibrary.CreateInternetAddr
// 0x0010 (0x0010 - 0x0000)
struct JavascriptLibrary_CreateInternetAddr final
{
public:
	struct FJavascriptInternetAddr                ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptLibrary_CreateInternetAddr;

// Function V8.JavascriptLibrary.CreateLogCategory
// 0x0028 (0x0028 - 0x0000)
struct JavascriptLibrary_CreateLogCategory final
{
public:
	class FString                                 CategoryName;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELogVerbosity_JS                              InDefaultVerbosity;                                // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJavascriptLogCategory                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptLibrary_CreateLogCategory;

// Function V8.JavascriptLibrary.CreatePackage
// 0x0020 (0x0020 - 0x0000)
struct JavascriptLibrary_CreatePackage final
{
public:
	class UObject*                                Outer_0;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PackageName;                                       // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPackage*                               ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptLibrary_CreatePackage;

// Function V8.JavascriptLibrary.CreateSocket
// 0x0030 (0x0030 - 0x0000)
struct JavascriptLibrary_CreateSocket final
{
public:
	class FName                                   SocketType;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Description;                                       // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceUDP;                                         // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJavascriptSocket                      ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptLibrary_CreateSocket;

// Function V8.JavascriptLibrary.CreateStreamableManager
// 0x0010 (0x0010 - 0x0000)
struct JavascriptLibrary_CreateStreamableManager final
{
public:
	struct FJavascriptStreamableManager           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptLibrary_CreateStreamableManager;

// Function V8.JavascriptLibrary.DeleteDirectory
// 0x0018 (0x0018 - 0x0000)
struct JavascriptLibrary_DeleteDirectory final
{
public:
	class FString                                 Path;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          RequireExists;                                     // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Tree;                                              // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0012(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_JavascriptLibrary_DeleteDirectory;

// Function V8.JavascriptLibrary.DeleteFile
// 0x0018 (0x0018 - 0x0000)
struct JavascriptLibrary_DeleteFile final
{
public:
	class FString                                 Filename;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReadOnly;                                          // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_JavascriptLibrary_DeleteFile;

// Function V8.JavascriptLibrary.DirectoryExists
// 0x0018 (0x0018 - 0x0000)
struct JavascriptLibrary_DirectoryExists final
{
public:
	class FString                                 InDirectory;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_JavascriptLibrary_DirectoryExists;

// Function V8.JavascriptLibrary.Duplicate
// 0x0020 (0x0020 - 0x0000)
struct JavascriptLibrary_Duplicate final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                Outer_0;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptLibrary_Duplicate;

// Function V8.JavascriptLibrary.FileExists
// 0x0018 (0x0018 - 0x0000)
struct JavascriptLibrary_FileExists final
{
public:
	class FString                                 Filename;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_JavascriptLibrary_FileExists;

// Function V8.JavascriptLibrary.FindObjectWithOuter
// 0x0020 (0x0020 - 0x0000)
struct JavascriptLibrary_FindObjectWithOuter final
{
public:
	class UObject*                                Outer_0;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 ClassToLookFor;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NameToLookFor;                                     // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptLibrary_FindObjectWithOuter;

// Function V8.JavascriptLibrary.FindPackage
// 0x0020 (0x0020 - 0x0000)
struct JavascriptLibrary_FindPackage final
{
public:
	class UObject*                                InOuter;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PackageName;                                       // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPackage*                               ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptLibrary_FindPackage;

// Function V8.JavascriptLibrary.GenerateNavigation
// 0x0010 (0x0010 - 0x0000)
struct JavascriptLibrary_GenerateNavigation final
{
public:
	class UWorld*                                 InWorld;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARecastNavMesh*                         NavData;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptLibrary_GenerateNavigation;

// Function V8.JavascriptLibrary.GetAllActorsOfClassAndTags
// 0x0040 (0x0040 - 0x0000)
struct JavascriptLibrary_GetAllActorsOfClassAndTags final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     ActorClass;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           Tags_Accept;                                       // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class FName>                           Tags_Deny;                                         // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         OutActors;                                         // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptLibrary_GetAllActorsOfClassAndTags;

// Function V8.JavascriptLibrary.GetAllActorsOfClassAndTagsInCurrentLevel
// 0x0040 (0x0040 - 0x0000)
struct JavascriptLibrary_GetAllActorsOfClassAndTagsInCurrentLevel final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     ActorClass;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           Tags_Accept;                                       // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class FName>                           Tags_Deny;                                         // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         OutActors;                                         // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptLibrary_GetAllActorsOfClassAndTagsInCurrentLevel;

// Function V8.JavascriptLibrary.GetArchetypePathName
// 0x0018 (0x0018 - 0x0000)
struct JavascriptLibrary_GetArchetypePathName final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptLibrary_GetArchetypePathName;

// Function V8.JavascriptLibrary.GetBailoutReason
// 0x0018 (0x0018 - 0x0000)
struct JavascriptLibrary_GetBailoutReason final
{
public:
	struct FJavascriptProfileNode                 Node;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptLibrary_GetBailoutReason;

// Function V8.JavascriptLibrary.GetBlueprintGeneratedClass
// 0x0010 (0x0010 - 0x0000)
struct JavascriptLibrary_GetBlueprintGeneratedClass final
{
public:
	class UBlueprint*                             Blueprint;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptLibrary_GetBlueprintGeneratedClass;

// Function V8.JavascriptLibrary.GetBlueprintGeneratedClassFromPath
// 0x0018 (0x0018 - 0x0000)
struct JavascriptLibrary_GetBlueprintGeneratedClassFromPath final
{
public:
	class FString                                 Path;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptLibrary_GetBlueprintGeneratedClassFromPath;

// Function V8.JavascriptLibrary.GetCallUid
// 0x0010 (0x0010 - 0x0000)
struct JavascriptLibrary_GetCallUid final
{
public:
	struct FJavascriptProfileNode                 Node;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_JavascriptLibrary_GetCallUid;

// Function V8.JavascriptLibrary.GetCategoryName
// 0x0018 (0x0018 - 0x0000)
struct JavascriptLibrary_GetCategoryName final
{
public:
	struct FJavascriptLogCategory                 Category;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptLibrary_GetCategoryName;

// Function V8.JavascriptLibrary.GetChild
// 0x0018 (0x0018 - 0x0000)
struct JavascriptLibrary_GetChild final
{
public:
	struct FJavascriptProfileNode                 Node;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJavascriptProfileNode                 ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptLibrary_GetChild;

// Function V8.JavascriptLibrary.GetChildrenCount
// 0x0010 (0x0010 - 0x0000)
struct JavascriptLibrary_GetChildrenCount final
{
public:
	struct FJavascriptProfileNode                 Node;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_JavascriptLibrary_GetChildrenCount;

// Function V8.JavascriptLibrary.GetClassPathName
// 0x0018 (0x0018 - 0x0000)
struct JavascriptLibrary_GetClassPathName final
{
public:
	class UClass*                                 Class_0;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptLibrary_GetClassPathName;

// Function V8.JavascriptLibrary.GetColumnNumber
// 0x0010 (0x0010 - 0x0000)
struct JavascriptLibrary_GetColumnNumber final
{
public:
	struct FJavascriptProfileNode                 Node;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_JavascriptLibrary_GetColumnNumber;

// Function V8.JavascriptLibrary.GetComponentsByClass
// 0x0020 (0x0020 - 0x0000)
struct JavascriptLibrary_GetComponentsByClass final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UActorComponent>            ComponentClass;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UActorComponent*>                ReturnValue;                                       // 0x0010(0x0010)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptLibrary_GetComponentsByClass;

// Function V8.JavascriptLibrary.GetCurrentProcessId
// 0x0004 (0x0004 - 0x0000)
struct JavascriptLibrary_GetCurrentProcessId final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptLibrary_GetCurrentProcessId;

// Function V8.JavascriptLibrary.GetDeoptInfo_Reason
// 0x0020 (0x0020 - 0x0000)
struct JavascriptLibrary_GetDeoptInfo_Reason final
{
public:
	struct FJavascriptProfileNode                 Node;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptLibrary_GetDeoptInfo_Reason;

// Function V8.JavascriptLibrary.GetDeoptInfo_Stack
// 0x0020 (0x0020 - 0x0000)
struct JavascriptLibrary_GetDeoptInfo_Stack final
{
public:
	struct FJavascriptProfileNode                 Node;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptLibrary_GetDeoptInfo_Stack;

// Function V8.JavascriptLibrary.GetDeoptInfosCount
// 0x0010 (0x0010 - 0x0000)
struct JavascriptLibrary_GetDeoptInfosCount final
{
public:
	struct FJavascriptProfileNode                 Node;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_JavascriptLibrary_GetDeoptInfosCount;

// Function V8.JavascriptLibrary.GetDerivedClasses
// 0x0020 (0x0020 - 0x0000)
struct JavascriptLibrary_GetDerivedClasses final
{
public:
	class UClass*                                 ClassToLookFor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UClass*>                         Results;                                           // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bRecursive;                                        // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
