#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: V8

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum V8.EJavascriptStatDataType
// NumValues: 0x0007
enum class EJavascriptStatDataType : uint8
{
	Invalid                                  = 0,
	ST_None                                  = 1,
	ST_int64                                 = 2,
	ST_double                                = 3,
	ST_FName                                 = 4,
	ST_Ptr                                   = 5,
	EJavascriptStatDataType_MAX              = 6,
};

// Enum V8.EJavascriptEncodingOptions
// NumValues: 0x0006
enum class EJavascriptEncodingOptions : uint8
{
	AutoDetect                               = 0,
	ForceAnsi                                = 1,
	ForceUnicode                             = 2,
	ForceUTF8                                = 3,
	ForceUTF8WithoutBOM                      = 4,
	EJavascriptEncodingOptions_MAX           = 5,
};

// Enum V8.EJavascriptStatOperation
// NumValues: 0x0011
enum class EJavascriptStatOperation : uint8
{
	Invalid                                  = 0,
	SetLongName                              = 1,
	AdvanceFrameEventGameThread              = 2,
	AdvanceFrameEventRenderThread            = 3,
	CycleScopeStart                          = 4,
	CycleScopeEnd                            = 5,
	SpecialMessageMarker                     = 6,
	Set                                      = 7,
	Clear                                    = 8,
	Add                                      = 9,
	Subtract                                 = 10,
	ChildrenStart                            = 11,
	ChildrenEnd                              = 12,
	Leaf                                     = 13,
	MaxVal                                   = 14,
	Memory                                   = 15,
	EJavascriptStatOperation_MAX             = 16,
};

// Enum V8.ELogVerbosity_JS
// NumValues: 0x0009
enum class ELogVerbosity_JS : uint8
{
	NoLogging                                = 0,
	Fatal                                    = 1,
	Error                                    = 2,
	Warning                                  = 3,
	Display                                  = 4,
	Log                                      = 5,
	Verbose                                  = 6,
	VeryVerbose                              = 7,
	ELogVerbosity_MAX                        = 8,
};

// ScriptStruct V8.JavascriptHeapStatistics
// 0x0020 (0x0020 - 0x0000)
struct FJavascriptHeapStatistics final
{
public:
	int32                                         TotalHeapSize;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalHeapSizeExecutable;                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalPhysicalSize;                                 // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalAvailableSize;                                // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UsedHeapSize;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         HeapSizeLimit;                                     // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MallocedMemory;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDoesZapGarbage;                                   // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FJavascriptHeapStatistics;

// ScriptStruct V8.JavascriptClassAsset
// 0x0010 (0x0010 - 0x0000)
struct FJavascriptClassAsset final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UObject>                    Class;                                             // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJavascriptClassAsset;

// ScriptStruct V8.JavascriptRawAccess_Data
// 0x0001 (0x0001 - 0x0000)
struct FJavascriptRawAccess_Data final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FJavascriptRawAccess_Data;

// ScriptStruct V8.JavascriptAsset
// 0x0020 (0x0020 - 0x0000)
struct FJavascriptAsset final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        Asset;                                             // 0x0008(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJavascriptAsset;

// ScriptStruct V8.JavascriptRawAccess
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FJavascriptRawAccess final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FJavascriptRawAccess;

// ScriptStruct V8.JavascriptMemoryStruct
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FJavascriptMemoryStruct final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FJavascriptMemoryStruct;

// ScriptStruct V8.JavascriptFunction
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FJavascriptFunction final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FJavascriptFunction;

// ScriptStruct V8.JavascriptRef
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FJavascriptRef final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FJavascriptRef;

// ScriptStruct V8.ReadStringFromFileHandle
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FReadStringFromFileHandle final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FReadStringFromFileHandle;

// ScriptStruct V8.ReadStringFromFileAsyncData
// 0x0010 (0x0010 - 0x0000)
struct FReadStringFromFileAsyncData final
{
public:
	class FString                                 String;                                            // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FReadStringFromFileAsyncData;

// ScriptStruct V8.DirectoryItem
// 0x0018 (0x0018 - 0x0000)
struct FDirectoryItem final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDirectory;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDirectoryItem;

// ScriptStruct V8.JavascriptStat
// 0x0001 (0x0001 - 0x0000)
struct FJavascriptStat final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FJavascriptStat;

// ScriptStruct V8.JavascriptLogCategory
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FJavascriptLogCategory final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FJavascriptLogCategory;

// ScriptStruct V8.JavascriptStreamableManager
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FJavascriptStreamableManager final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FJavascriptStreamableManager;

// ScriptStruct V8.JavascriptStubStruct
// 0x0001 (0x0001 - 0x0000)
struct FJavascriptStubStruct final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FJavascriptStubStruct;

// ScriptStruct V8.JavascriptSocket
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FJavascriptSocket final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FJavascriptSocket;

// ScriptStruct V8.JavascriptInternetAddr
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FJavascriptInternetAddr final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FJavascriptInternetAddr;

// ScriptStruct V8.JavscriptProperty
// 0x0020 (0x0020 - 0x0000)
struct FJavscriptProperty final
{
public:
	class FString                                 Type;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name;                                              // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJavscriptProperty;

// ScriptStruct V8.JavascriptText
// 0x0050 (0x0050 - 0x0000)
struct FJavascriptText final
{
public:
	class FString                                 String;                                            // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Namespace;                                         // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TableId;                                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x18];                                      // 0x0038(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FJavascriptText;

// ScriptStruct V8.JavascriptCpuProfiler
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FJavascriptCpuProfiler final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FJavascriptCpuProfiler;

// ScriptStruct V8.JavascriptProfileNode
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FJavascriptProfileNode final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FJavascriptProfileNode;

// ScriptStruct V8.JavascriptAutomatedTestInstance
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FJavascriptAutomatedTestInstance final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FJavascriptAutomatedTestInstance;

// ScriptStruct V8.JavascriptAutomatedTestParameters
// 0x0020 (0x0020 - 0x0000)
struct FJavascriptAutomatedTestParameters final
{
public:
	class FString                                 TestFunctionName;                                  // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FJavascriptAutomatedTestInstance       Tester;                                            // 0x0010(0x0010)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJavascriptAutomatedTestParameters;

// ScriptStruct V8.JavascriptAutomatedTest
// 0x0040 (0x0040 - 0x0000)
struct FJavascriptAutomatedTest final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bComplexTask;                                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TestFlags;                                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RequiredDeviceNum;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         TestFunctionNames;                                 // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FJavascriptFunction                    Function;                                          // 0x0030(0x0010)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FJavascriptAutomatedTest;

}

