#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponAim

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ControlRig_structs.hpp"
#include "ControlRig_classes.hpp"
#include "RigVM_classes.hpp"


namespace SDK
{

// RigVMMemoryStorageGeneratorClass WeaponAim.RigVMMemory_Work
// 0x0318 (0x0340 - 0x0028)
class WeaponAim::URigVMMemory_Work final : public URigVMMemoryStorage
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FControlRigExecuteContext              ExecuteContext_;                                   // 0x0030(0x00C0)(Edit, EditConst, NonTransactional)
	struct FRigElementKey                         AimItem_1_Item__IO;                                // 0x00F0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                MathVectorAdd_1_1_Result;                          // 0x0100(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_118[0x8];                                      // 0x0118(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             GetTransform_Transform;                            // 0x0120(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FRigElementKey                         GetTransform_Item__IO;                             // 0x0180(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              GetTransform_CachedIndex;                          // 0x0190(0x0010)(Edit, EditConst, NonTransactional)
	struct FVector                                MathVectorAdd_1_1_A;                               // 0x01A0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MathVectorMul_Result;                              // 0x01B8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MathQuaternionRotateVector_2_Result;               // 0x01D0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E8[0x8];                                      // 0x01E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  MathQuaternionFromAxisAndAngle_Result;             // 0x01F0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FVector                                MathQuaternionToAxisAndAngle_Axis;                 // 0x0210(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_228[0x8];                                      // 0x0228(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  MathQuaternionFromTwoVectors_Result;               // 0x0230(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FVector                                MathQuaternionRotateVector_1_Result;               // 0x0250(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  MathQuaternionRotateVector_1_Quaternion;           // 0x0270(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FVector                                MathVectorSub_Result;                              // 0x0290(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         MathQuaternionToAxisAndAngle_Angle;                // 0x02A8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         MathFloatClamp_Result;                             // 0x02AC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         MathFloatRad_Result;                               // 0x02B0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         MathFloatNegate_Result;                            // 0x02B4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         MathFloatAbs_Result;                               // 0x02B8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         MathFloatAbs_Value;                                // 0x02BC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         MathFloatRad_1_Result;                             // 0x02C0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimItem_Target                AimItem_1_Primary__IO;                             // 0x02C8(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              AimItem_1_CachedItem;                              // 0x0310(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              AimItem_1_PrimaryCachedSpace;                      // 0x0320(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              AimItem_1_SecondaryCachedSpace;                    // 0x0330(0x0010)(Edit, EditConst, NonTransactional)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL_FULLNAME("RigVMMemoryStorageGeneratorClass WeaponAim.RigVMMemory_Work")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RigVMMemory_Work")
	}
	static class WeaponAim::URigVMMemory_Work* GetDefaultObj()
	{
		return GetDefaultObjImpl<WeaponAim::URigVMMemory_Work>();
	}
};
DUMPER7_ASSERTS_WeaponAim__URigVMMemory_Work;

// RigVMMemoryStorageGeneratorClass WeaponAim.RigVMMemory_Literal
// 0x0148 (0x0170 - 0x0028)
class WeaponAim::URigVMMemory_Literal final : public URigVMMemoryStorage
{
public:
	struct FRigElementKey                         AimItem_1_Item__Const;                             // 0x0028(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimItem_Target                AimItem_1_Primary__Const;                          // 0x0038(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FRigElementKey                         GetTransform_Item__Const;                          // 0x0080(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EBoneGetterSetterMode                         GetTransform_Space__Const;                         // 0x008C(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         GetTransform_bInitial__Const : 1;                  // 0x008D(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_8E[0x2];                                       // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                MathVectorMul_B__Const;                            // 0x0090(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigUnit_AimItem_Target                AimItem_1_Secondary__Const;                        // 0x00A8(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	float                                         AimItem_1_Weight__Const;                           // 0x00F0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0xC];                                       // 0x00F4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimBone_DebugSettings         AimItem_1_DebugSettings__Const;                    // 0x0100(0x0070)(Edit, EditConst, NonTransactional, NoDestructor)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL_FULLNAME("RigVMMemoryStorageGeneratorClass WeaponAim.RigVMMemory_Literal")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RigVMMemory_Literal")
	}
	static class WeaponAim::URigVMMemory_Literal* GetDefaultObj()
	{
		return GetDefaultObjImpl<WeaponAim::URigVMMemory_Literal>();
	}
};
DUMPER7_ASSERTS_WeaponAim__URigVMMemory_Literal;

// ControlRigBlueprintGeneratedClass WeaponAim.WeaponAim_C
// 0x0040 (0x04D0 - 0x0490)
class UWeaponAim_C final : public UControlRig
{
public:
	uint8                                         Pad_488[0x8];                                      // 0x0488(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                AimPos;                                            // 0x0490(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   WeaponBoneName;                                    // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                AimAxis;                                           // 0x04B0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DegreesConstraint;                                 // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WeaponAim_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WeaponAim_C")
	}
	static class UWeaponAim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWeaponAim_C>();
	}
};
DUMPER7_ASSERTS_UWeaponAim_C;

}

